{
//CONFIGURATION SETTINGS
	"config.section.CharacterInclude.name": "Character Dialogue Selection",
	"config.section.CharacterInclude.description": "Select to add or remove a character's dialogue.",

	"config.AbigailDialogue.name": "Abigail",
	"config.AbigailDialogue.description": "Enable Abigail's dialogue",

	"config.AlexDialogue.name": "Alex",
	"config.AlexDialogue.description": "Enable Alex's dialogue",

	"config.CarolineDialogue.name": "Caroline",
	"config.CarolineDialogue.description": "Enable Caroline's dialogue",

	"config.ClintDialogue.name": "Clint",
	"config.ClintDialogue.description": "Enable Clint's dialogue",

	"config.DemetriusDialogue.name": "Demetrius",
	"config.DemetriusDialogue.description": "Enable Demetrius' dialogue",

	"config.ElliottDialogue.name": "Elliott",
	"config.ElliottDialogue.description": "Enable Elliott's dialogue",

	"config.EmilyDialogue.name": "Emily",
	"config.EmilyDialogue.description": "Enable Emily's dialogue",

	"config.EvelynDialogue.name": "Evelyn",
	"config.EvelynDialogue.description": "Enable Evelyn's dialogue",

	"config.GeorgeDialogue.name": "George",
	"config.GeorgeDialogue.description": "Enable George's dialogue",

	"config.GusDialogue.name": "Gus",
	"config.GusDialogue.description": "Enable Gus's dialogue",

	"config.HaleyDialogue.name": "Haley",
	"config.HaleyDialogue.description": "Enable Haley's dialogue",

	"config.HarveyDialogue.name": "Harvey",
	"config.HarveyDialogue.description": "Enable Harvey's dialogue",

	"config.JodiDialogue.name": "Jodi",
	"config.JodiDialogue.description": "Enable Jodi's dialogue",

	"config.KentDialogue.name": "Kent",
	"config.KentDialogue.description": "Enable Kent's dialogue",

	"config.LewisDialogue.name": "Lewis",
	"config.LewisDialogue.description": "Enable Lewis's dialogue",

	"config.MarnieDialogue.name": "Marnie",
	"config.MarnieDialogue.description": "Enable Marnie's dialogue",

	"config.MaruDialogue.name": "Maru",
	"config.MaruDialogue.description": "Enable Maru's dialogue",

	"config.PennyDialogue.name": "Penny",
	"config.PennyDialogue.description": "Enable Penny's dialogue",

	"config.PierreDialogue.name": "Peirre",
	"config.PierreDialogue.description": "Enable Pierre's dialogue",

	"config.RobinDialogue.name": "Robin",
	"config.RobinDialogue.description": "Enable Robin's dialogue",

	"config.SamDialogue.name": "Sam",
	"config.SamDialogue.description": "Enable Sam's dialogue",

	"config.SebastianDialogue.name": "Sebastian",
	"config.SebastianDialogue.description": "Enable Sebastian's dialogue",

	"config.ShaneDialogue.name": "Shane",
	"config.ShaneDialogue.description": "Enable Shane's dialogue",

	"config.SophiaDialogue.name": "Sophia",
	"config.SophiaDialogue.description": "Enable Sophia's dialogue",

	"config.VictorDialogue.name": "Victor",
	"config.VictorDialogue.description": "Enable Victor's dialogue",

	"config.VincentDialogue.name": "Vincent",
	"config.VincentDialogue.description": "Enable Vincent's dialogue",

	"config.WillyDialogue.name": "Willy",
	"config.WillyDialogue.description": "Enable Willy's dialogue",

	"config.section.BonusContent.name": "Bonus Content",
	"config.section.BonusContent.description": "Select to enable or disable bonus sprites and other content.",

	"config.EventEdits.name": "Enable Vanilla event edits",
	"config.EventEdits.description": "Enable minor edits to some vanilla events including Maru's 2-Heart, Penny's 2-Heart, Robin's deluxe bed, Demetrius' 6-Heart",

	"config.AlexCustomPortraits.name": "Alex Vanilla portrait edit",
	"config.AlexCustomPortraits.description": "Enable a minor change in Alex's vanilla portraits related to friendship level. Uncheck if you have a portrait mod installed.",

	"config.AlexCustomSprites.name": "Alex fluffy hair sprites",
	"config.AlexCustomSprites.description": "Enable slightly modified vanilla sprites for Alex with hair that better matches his portrait. Uncheck if you have another sprite mod installed.",

	"config.SebRoomSprites.name": "Sebastian room edits",
	"config.SebRoomSprites.description": "Add slippers and a bowl of saltwater taffy to Sebastian's room, replace the vase with the radio if SVE is installed.",

//ABIGAIL
		"abigail.special.Introduction": "Oh hey, you're the new farmer, right? Funny, I imagined an old, grizzled cowboy type, haha!#$b#I hope you like it here, that old farm is really cool, I like exploring those overgrown fields.#$b#Tell me if you need anything, my dad owns the general store and I usually know what he has in stock.",
		"abigail.daily.Mon": "Oh, hey. Taking a break from work? I bet it's overwhelming. If you see me at the store, be sure to say 'hi', it can get kind of dull around here.",
		"abigail.daily.Mon2": "Oh, hi! Have you visited the cemetery? It's a peaceful place to spend some time alone.#$b#Most people think it's creepy at night, but it's actually really nice.",
		"abigail.daily.Mon4": "What's up? Are you off to the mines? I'd love to come with you, but Mom would freak out since she's sure a void spirit will eat me.",
		"abigail.daily.Tue": "Ugh... I had a sucky morning and I'm not in a good mood right now.$s#$e#I don't want to talk about it, I'll catch you later.$s",
		"abigail.daily.Tue2": "*sighs*...$s#$b#Sometimes I wonder if my parents were ever young. I mean, of course they were, but I bet they were all stuffy even back then.#$e#I know they mean well, but sometimes they just cannot understand my point of view.",
		"abigail.daily.Tue4": "Hi, I'm glad to see you. Are you starting to feel more at home here?$h#$e#You know you're part of our gang now, right? Me, you, Seb and Sam. We make quite an ecclectic band!$h",
		"abigail.daily.Wed": "Hey. Sorry, I'm really out of it today, stayed up 'til the middle of the night doing homework. Why do I do this to myself?$s",
		"abigail.daily.Wed2": "Oh, hi @. Taking a break from your work? Me too. Oh! Nothing physical... just some online classes I'm taking.#$e#I'm working on my degree so I can get a decent job, or maybe start my own business.",
		"abigail.daily.Wed4": "I'm glad I can take online classes, I don't really want to live at the university. I mean, the college life sounds crazy and fun, but I'd really miss my friends here.#$e#Plus I'd worry about David falling in with the wrong crowd, haha!$h",
		"abigail.daily.Thu4": "I think I'll be able to finish my degree in about a year, I'm going to have a massive party when I'm finally done!$h#$e#Oh yeah, maybe I never mentioned it, but I'm getting an international business degree. It seemed like it would be useful for a lot of different jobs.",
		"abigail.daily.Fri": "Wow, I just realized it's Friday.$u#$b#If you're free, come join us at the saloon. Sam, Seb and I hang out on Friday nights. Sam and Seb play pool and I usually just watch or mess around on my phone.#$e#Huh, that really sounds boring now that I said it out loud, maybe you can help spice things up?",
		"abigail.daily.Fri2": "Come join us for our Friday traditional sit around and eat junk food night, okay?#$e#It's more fun when you're there, you haven't heard all my stories or Sam's dumb jokes.$h",
		"abigail.daily.Fri4": "Hmm pool night again, you're coming, right? Maybe we could play Prairie King or something. The guys hog the pool table and there's not much else to do.#$e#Unless you want to dance, haha! That could be pretty fun, maybe we can drag Sam and Seb over and start a dance party.$h",
		"abigail.daily.Fri6": "About time to head over to the saloon and watch the boys play pool... I pretend I'm messing with my phone, but I'm really watching them.#$e#They're so weird, it's endlessly entertaining! Plus, Sam has a pretty cute rear from all that skating he does.$h#$b#DON'T TELL HIM I SAID THAT! He'd never let me live it down!$7",
		"abigail.daily.Sat": "The fresh mountain air is nice on a day like this.$h#$e#I wonder if the frogs will make an appearance soon. Has Seb told you how much he loves frogs? It's a little... odd, but whatever.",
		"abigail.daily.Sat4": "Ah, the weekend. It used to be the best days of the week, but how it's just homework time. Oh well, I'll survive.#$e#You can come visit me anyway, I need to take breaks or I can't focus and just start daydreaming.",
		"abigail.daily.Sat6": "Hi @! Have you been to the mines recently? Any good adventure stories like close encounters, giant mutant frogs, living skeletons...?$h#$e#I'll come with you sometime, I think I can convince my mom it's okay as long as you're there with me.$h",
		"abigail.daily.Sun": "Oh man... I've been pushing off my homework all weekend. Looks like I'll be pulling another all-nighter...$s#$e#I know better, but I still procrastinate anyway.",
		"abigail.daily.Sun4": "Urgh, I forgot some of my homework, so annoying. Guess it's time for a triple espresso and candy!#$e#Want to keep me company? Just kidding! I wouldn't get anything done if you were over anyway, I have too much fun talking with you.",
		"abigail.daily.summer_Mon": "My pet guinea pig, David, just hates this hot weather. He's fussy.#$e#This morning he was being all dramatic and moping in the corner until I took him out to get some fresh air, hehe!$h",
		"abigail.daily.summer_Mon4": "You should come visit David sometime! He loves fresh greens, be sure to bring healthy ones from Gus or Leah. Plain lettuce isn't very nutritious.#$e#If you want, I'll take him out and let him run around a bit, he's really funny to watch and he makes adorable little grunting sounds.$h",
		"abigail.daily.summer_Mon6": "David sure loves the treats you bring him! He makes cute little grunting noises when he hears you coming, heehee!$h#$e#I have classes today, but later let's plan to meet up and take a walk or watch a movie at my place.",
		"abigail.daily.summer_Mon8": "I used to think Pelican Town was kinda drab and boring, but things have really improved around here lately.$h#$e#Maybe we should get together and invest in housing, you know, like build an apartment building and rent out the units.#$b#Not some crappy city building, but something nice... I know a few people around here would love to get their own place, and I would too.#$b#If we owned the building, it would be like investing in the future, right?$h",
		"abigail.daily.summer_Tue": "The air is so thick with honey and nectar all summer, it's almost suffocating.$u#$b#And it's too hot to wear my favorite clothes, ugh.$s",
		"abigail.daily.summer_Tue4": "You know, you're really interesting! There's always something new going on at the farm and you're fun to hang out with.$h#$e#Thanks for stopping to chat!$h",
		"abigail.daily.summer_Tue6": "I've been thinking of ways we could improve our town lately. Maybe all the work you've done on the farm has inspired me, haha!$h#$e#We could definitely use a skatepark and some community gardens, maybe a place for people to show off their arts and crafts.",
		"abigail.daily.summer_Wed": "Have you decorated your house at all? That's one thing I'm really looking forward to when I get my own place.#$e#I could paint the walls whatever color I want, hang as many pictures as I like, and have shade trees.#$b#Lots and lots of shade trees!$h",
		"abigail.daily.summer_Wed4": "I saw some great new furniture in Robin's catalog last time I was there, want me to help you pick some stuff out? Not to actually buy, just window shopping.#$e#It sounds like so much fun decorating a house just the way you want it. If you do buy anything, I'll help you set it up, it gets boring just hanging out around the store.",
		"abigail.daily.summer_Wed6": "You know, with my business degree and your practical knowledge, it would be fun to invest in something together, like a small business or maybe real estate...#$e#Hmm I'll have to think about that... right now, I think we need a water park where we can all cool off. I bet everyone would love that.",
		"abigail.daily.summer_Thu4": "It's so nasty and hot out here, I hope I don't get burned. Hate that!$s#$b#Or get a tan. I guess a tan is better than being fried, but I really don't like that look on myself.$s#$e#You look fine with a tan though, I suppose it's unavoidable when you need to be outside all day. Be sure to take care of your skin!",
		"abigail.daily.summer_Thu6": "Be sure to use that sunscreen I gave you, your tan looks great but you need to be careful not to damage your skin too much.#$e#Oh, yikes I sound like my mom! I just want you to take care of yourself.",
		"abigail.daily.summer_Fri": "I kind of wish I had a cat. Unfortunately, my Dad is allergic to pretty much everything.#$e#Oh! Don't tell David I said that, he'd be devastated!$h",
		"abigail.daily.summer_Fri4": "Urgh, I hate when it's so hot all night here in the summer, it's so nasty and I can't sleep! Oh well, at least it's saloon night.#$e#How about we make a game out of choosing each other's snacks? We can take turns every other week.$h",
		"abigail.daily.summer_Sat4": "You know, this summer hasn't been too bad! I think there's been more to do with you here and everyone being more interested in doing things as a group.$h#$e#It's funny how quickly one's outlook can change.",
		"abigail.daily.fall_Mon": "I need to stretch my legs and get some fresh air today, I spent way too much time staring at my computer and playing games over the weekend.",
		"abigail.daily.fall_Mon6": "I don't know how Seb can just sit there and stare at his computer all day. Every day. Doesn't he get stir crazy? I can't sit still that long for sure.#$e#I guess he does walk around the lake sometimes but still.",
		"abigail.daily.fall_Mon8": "You know, I can see why you wanted to become a farmer, I'm inspired to start my own business when I'm done with college.#$e#You'll help me out, right?",
		"abigail.daily.fall_Tue4": "I may fight with my parents a lot, but I know they're just looking out for me. They're doing what they think is best.$s#$e#Don't tell anyone I said that, especially not Seb or Sam. They'd tease me about it for ages!",
		"abigail.daily.fall_Tue6": "Guess what!! I agreed to guinea pig sit for a friend of mine from Zuzu City a while back, it was pretty fun having two guinea pigs for a while.#$e#BUT I just discovered David... isn't actually a boy! Now I have five little tiny guinea pigs and David! Maybe I should change her name... nah.#$b#The babies are soooo cute, just miniature guinea pigs with all their fur and everything, not like naked mouse babies.#$b#Of course, I have to find homes for them now. You... want a guinea pig?",
		"abigail.daily.fall_Wed2": "Are you growing pumpkins on your farm this year?#$b#Save me a really big, fat one! I have a great idea for carving it and need a lot of surface area, heh!$h",
		"abigail.daily.fall_Wed4": "Someday when I have my own place, I'm going to plant a huge pumpkin patch.#$e#You'll help me with that, right? I actually don't know much about growing things.",
		"abigail.daily.fall_Thu6": "I wish this season lasted a little longer. When the wind really picks up, I almost feel like a kid again.#$e#Hey, want to walk along the cliffs? The wind coming up from the water feels amazing!$h",
		"abigail.daily.fall_Thu8": "Oh, it's such a nice day with a good breeze... hey, let's have a little fun. We can pull our jackets up like sails and let the wind blow us around the square!$h#$e#Then we can find Sam and bother him for a while. Oh, maybe we can get pizza together!",
		"abigail.daily.fall_Sat6": "Hi, @! Your hair looks cool today... did you do something different?$h#$e#I keep thinking I should change mine, but I can never settle on a style so just keep going back to the same old thing.",
		"abigail.daily.winter_Mon8": "Are you building a snowgoon army on your farm?#$b#Be sure to come get me when you want to get going on that, I love building snowgoons and yours are definitely the wonkiest! Ha!$h#$e#Dad has some past-date produce we can use for noses and stuff, and I bet Emily has fabric scraps for scarves.",
		"abigail.daily.winter_Tue4": "It's so cold, I wish we had a hot cup of cocoa to share.$h#$e#You know, Sam makes excellent hot cocoa, want to go bother him? I bet he'll make us some.$h",
		"abigail.daily.winter_Wed6": "It must be nice not having crops to worry about this time of year, and that means you can hang out with me more often!$h#$e#Are you up for a movie night? The whole snack food and hot chocolate binge with a good scary movie thing?$h",
		"abigail.daily.winter_Fri": "One thing I've learned living here... everyone stares at you if you look different. I guess that's not unique to Pelican Town, but it's more obvious in a small town.",
		"abigail.daily.winter_Fri8": "It's always nice and cozy warm in the saloon, come sit with me and I'll show you some fun mobile games I found.#$e#And we can make fun of Sam and Seb as always, heehee!",
		"abigail.daily.winter_Sat": "It's the weekend! Time to play video games and ignore reality for a while, have you played the games at the saloon?$h",
		"abigail.daily.winter_Sat4": "Time to play video games and see if I can beat the next level in Prairie King...#$e#Sam likes to remind me he's way better at it, one of these days I'm going to beat that guy.",
		"abigail.daily.winter_Sun6": "What's up? If you're not too busy, want to play some games with me?#$e#*whispers* Don't tell Sam, but if you're any good, I could use some tips.$h",
		"abigail.daily.spring_5": "Hey, how are you settling in on that farm? The old house sure is run down, do you have plans to fix it up?#$b#I think it would be kinda cool to live alone on a creepy old farm... you gotta tell me about it, okay?$h",
		"abigail.daily.spring_12": "I'm definitely going to enter the egg hunt tomorrow. Are you? You might think it sounds like a kid's game but I take it VERY seriously.#$b#I have my strategy for domination all planned out, hehe!$h",
		"abigail.daily.spring_17": "What's up? Have you been talking with Seb or Sam much?#$b#We've been friends for as long as I can remember. We're like a gang or something.#$b#Oh, we definitely could use another member, you in?$h",
		"abigail.daily.spring_23": "Eh, the Flower Dance is tomorrow... the guys really hate it but it's not too bad. I do have to wear a dumb white dress though.#$b#Hey, if you ask Seb to dance, I won't have to put the dang thing on! Buuut only ask him if you really want to, no pressure!$h",
		"abigail.daily.spring_26": "Hi @! You looked great at the dance yesterday, did you have fun?#$b#... Nice! It was actually more fun than usual, I guess having you there changed things up a bit.$h",
		"abigail.daily.summer_4": "@! You busy? Seb is at his doctor appointment, I'm sure you heard him whining about that. Such a baby!#$b#Anyway, I'm bored so you wanna hang out? We can go harass Sam, he pretends to be annoyed but he really loves the attention!$h",
		"abigail.daily.summer_13": "Did you have fun at the luau yesterday? I saw you running around, talking to everyone.$h#$b#Did you hear any good town gossip? You'd tell me if you did, right?",
		"abigail.daily.summer_19.1": "Blah blah blah your clothes are weird... blah blah blah why don't you go back to your natural hair color... blah blah blah...$s",
		"abigail.daily.summer_19.2": "My parents keep harassing me about my clothes and hair. I'm over 21, why can't they just leave me alone?",
		"abigail.daily.summer_19.3": "I think you look good, they'll come around eventually.",
		"abigail.daily.summer_19.4": "Thanks, really. I dunno, it's been a couple years... *sighs* I'll be done with college soon, then things should get better.$s",
		"abigail.daily.summer_19.5": "Maybe you should listen to them, at least until you move out.",
		"abigail.daily.summer_19.6": "Ugh, you don't get it. You have your own place and your parents aren't even in the same town. Never mind, see ya.$a",
		"abigail.daily.summer_24": "If you ever go on any cave or forest exploration trips, let me know, okay? If I'm not doing homework, I'd love to come!#$b#I mean, it's more fun to go with someone than doing everything alone, right?#$b#We can bring the guys too if you want but I'd love to have an adventure with just the two of us.$h",
		"abigail.daily.summer_28": "Hey, don't forget the Moonlight Jellies tonight! Be sure to say 'hey', I'll be on the docks in the darkest corner I can find to get the best view.$h",
		"abigail.daily.fall_1": "Man, I'm glad summer's over! I really hate the heat. So does David, he's perking up now and running around his enclosure.$h#$b#Be sure to come visit him, he loves when you're over. Probably because you give him treats, but whatever works!$h#$b#Oh yeah, you're growing pumpkins this season, right? Be sure to save a really good one for me!$h",
		"abigail.daily.fall_13": "*leans close* Today's my birthday, did you remember? Hehe!$h#$b#Oh I'm not begging for presents, I'll take a good compliment though, or just an offer to hang out.$h#$b#Sometimes Seb and Sam get me something, but they forget entirely just as often. Oh well, I torture them plenty so I don't worry about it.",
		"abigail.daily.fall_16": "My dad is going nuts getting ready for the grange competition tomorrow, driving me and Mom crazy.#$b#I honestly don't care at all, but carving pumpkins is fun so maybe I'll just do that.#$b#The games are a total ripoff, no way to win the good prizes without spending way more than they're worth.#$b#Wait, if you're good at the games, maybe you'll win me something? There's this really cute stuffed bat I'd love to get.$h",
		"abigail.daily.fall_20": "I bet you're looking forward to winter after all the craziness of fall!$h#$b#Let's plan to meet up more often in the winter, it gets kind of boring since it's freezing outside and there's only so much to do inside.#$b#I bet we can come up with some great pranks to play on the guys, heehee!$h",
		"abigail.daily.fall_27": "Spirit's Eve is tonight! I'm so excited, the maze is always so much fun! I hope there's no spiders this year though, I really hate those.#$b#Are you wearing a costume? Seb and I usually dress up but nobody else does. Maybe we can convince Sam...#$b#Ooooh! We could do a group thing! Nothing too crazy or Seb will back out, but it would be great fun!",
		"abigail.daily.winter_7": "The guys have been going on and on about the snowball war tomorrow, they're so into it... if they weren't so annoying, it would be cute.#$b#I can't believe Sam still goes up against Seb, he gets totally demolished every year!#$b#Oh well, I guess if they're having fun... They each tried to recruit me to their side but I declined.#$b#I think I'll just be drinking hot cider and watching from a distance, you're welcome to join me.#$b#Getting a stray snowball in the face is never a good time!$s",
		"abigail.daily.winter_12": "Is it pretty quiet on the farm?#$b#Great! That means you can hang with me and do something fun.$h#$b#We can play Prairie King and stuff our faces with junk food, or maybe have a movie night with Seb and Sam.",
		"abigail.daily.winter_19": "What do you say to building a snowgoon army? Seb mentioned it and sounds great to me!$h#$b#I bet there's a ton of room on your farm since you can't grow crops outside.#$b#After that, we can all hang out at your place and play games or watch movies, whatever sounds good.",
		"abigail.reaction.dating_Sebastian": "I can't believe Seb is actually dating someone! Ha!$h#$b#I mean, I knew you'd get together someday but it's still funny to see him so head over heels for you.$h#$b#Take good care of him, I know you will... and he better do the same for you, if not, he'll definitely regret it!$h",
		"abigail.reaction.dating_Sebastian_memory_oneday": "Sooooo... how did our Seb react when you two finally made it official?$h#$b#I bet he was completely tongue-tied and adorable. Not that I'd EVER make fun of him for that, haha!$h",
		"abigail.reaction.married_Sebastian": "Oooh come here and give me a hug, I'm so happy for you and Seb!#$b#The wedding was amazing, and I'm so glad Seb will be staying here with the rest of us. You know me, I like having my friends together.$h",
		"abigail.special.Sat_inlaw_Sebastian": "It's funny how life turns out so differently from what you expect...$s#$b#Who would have thought Seb would be married before me?! Haha!$h",
		"abigail.special.Sat8_inlaw_Sebastian": "To be honest, I was pretty envious of what you and Seb have together...$s#$b#But maybe we've all grown up a bit since you came here.#$b#You've inspired me to work on myself first, then I'll be ready when the right person for me comes along.$h",
		"abigail.special.Fri4_inlaw_Sebastian": "Will you be coming to the saloon tonight?#$b#I like catching up with you while the guys play pool... maybe we could kick them off the table and play a round!$h",
		"abigail.reaction.dating_Sam": "I can't believe Sam is actually dating someone! Ha!$h#$b#I mean, I knew you'd get together someday but it's still funny to see him so head over heels for you.$h#$b#Take good care of that goofus, I know you will... and he better do the same for you, if not, he'll definitely regret it!$h",
		"abigail.reaction.dating_Sam_memory_oneday": "Sooooo... how is hyper lover boy? He's pretty adorable around you, I can tell he's totally devoted.$h#$b#I guess he's not so bad for being such a cheeseball!$h",
		"abigail.reaction.married_Sam": "Oooh come here and give me a hug, I'm so happy for you and Sam!#$b#The wedding was amazing, and I'm really glad you and Sam ended up together. You know me, I love my friend group.$h",
		"abigail.daily.Sat_inlaw_Sam": "It's funny how life turns out so differently from what you expect...$s#$e#Who would have thought Sam would be in a committed relationship before me?! Haha!$h",
		"abigail.daily.Sat8_inlaw_Sam": "To be honest, I was pretty envious of what you and Sam have together...$s#$e#But maybe we've all grown up a bit since you came here. Some of us more than others, haha!$h#$b#You've inspired me to work on myself first, then I'll be ready when the right guy for me comes along.",
		"abigail.daily.Fri4_inlaw_Sam": "Will you be coming to the saloon tonight?#$e#I like catching up with you while the guys play pool... maybe we could kick them off the table and play a round!$h",
		"abigail.reaction.dating_Alex": "I'm glad you and Alex finally got together, he sure took his sweet time getting around to asking you!$h#$b#He's much more fun to be around now that he's not so obsessed with gridball. You're definitely a good influence on him.",
		"abigail.reaction.married_Alex": "Your wedding was amazing, you and Alex looked great up there, it's really sweet how he looks at you.$h#$b#I just hope I find someone who adores me like that someday.",

//ALEX
		"alex.special.Introduction": "Oh, hey. So you're the new farmer, huh? Cool. I think we're going to get along great. I'm Alex.#$b#I'll see you around.",
		"alex.daily.Mon8": "You know, I used to want fame and fortune, but lately I've been thinking that's really not how I want to live my life.#$e#Don't get me wrong, I still love gridball, but making that my entire life seems hollow somehow.",
		"alex.daily.Tue": "The beach is a cool place to hang out and soak up some rays.#$b#You gotta spend some time in the sun or else you'll get all pale.#$e#You should join me down at the beach, it gets kind of boring seeing the same people all the time.",
		"alex.daily.Tue6": "Man, I love hanging out with friends at the beach when it's hot out, playing volleyball, running around in the waves, cooking over a campfire, it's the best!$h",
		"alex.daily.Fri4": "Hey, @. I'm glad you stopped by.#$b#Grandma's cooking is awesome, I really love her! She made cookies earlier, maybe she'll give you the recipe sometime.#$e#Now Grandpa, on the other hand...#$b#Just kidding. He's pretty great actually, tells the best stories.$h",
		"alex.daily.Fri8": "Hey, Seb made me this awesome omelette, he said it was for always helping him at the gym.#$b#I gotta get the recipe next time I see him.",
		"alex.daily.Sun": "Hey.#$b#What, you wanna talk to me? I've got stuff I need to get done but I'll be free later if you're around.",
		"alex.daily.Sun2": "Hey, @.#$b#That's right, I remembered your name, heh! Uh, how are things going at that farm?",
		"alex.daily.Sun4": "Hey, @.#$b#How's your day going? I bet you have all kinds of stories about the farm, when you're not busy you can hang out and tell me some.#$e#I know my grandparents like when you visit too.$h",
		"alex.daily.spring_Fri2": "I bet if I tried to play catch with that guy Sebastian, he'd just duck and cover when I threw the ball at him.$h#$e#...#$b#Sorry, yeah, I guess that was kind a jerk thing to say.$s",
		"alex.daily.spring_Fri8": "Hey @, think fast!#$b#%Alex tosses a gridball to you, then grins when you catch it.#$e#Remember when I first tossed you a ball and it totally bounced out of your hands? Haha!$h#$b#You're definitely getting better at catching, I hope I'm improving too... you know, in my social skills.",
		"alex.daily.spring_Sat": "This town is pretty strange, some weird people live here.#$e#... Have you met that emo guy? Why does he wear black all the time and stare at the ground instead of talking to people?#$e#And there's Haley's sister Emily, she's... well, you've seen her hair. And Abby, also part of the loud hair color club.",
		"alex.daily.spring_Sat8": "I have to say I really admire your dedication to your work and friends.#$e#I want to be like that, not too obsessed with my own goals and putting my personal relationships first instead.",
		"alex.daily.summer_Mon4": "Hi @, how's it going? Summer is the best time to exercise outside, you can get a really great sweat going.#$e#Did you know Clint and Shane used to play gridball? Man... Shane... he really is drinking himself to an early grave...$s",
		"alex.daily.summer_Mon8": "I've noticed Shane is looking better, he's really cut back on drinking and he seems much happier.#$e#He even tossed the gridball with me for a while the other day.$h",
		"alex.daily.summer_Wed4": "Hey, have you talked to Haley much? She really loves the beach and is getting a great tan.#$e#... She's been pretty rude to you? Oh... well, she can be like that when she feels like she has competition for the spotlight.",
		"alex.daily.summer_Wed8": "Haley's been saying some nice things about you lately, she's really grown past her jealous phase, hehe.$h#$e#I like to think we've both grown a lot over the past year.#$b#I've been spending more time with my friends doing things they like, and it's really great just hanging out with them.$h",
		"alex.daily.summer_Thu4": "I was walking by your farm the other day, looks like you've done a lot of work there.#$e#You have chickens, right? Eggs are great for your health, I can make a mean omelette if you're ever hungry.$h",
		"alex.daily.summer_Thu8": "How are the chickens doing on your farm? I've gotten some really great eggs from Pierre's that came from your hens.$h#$e#Keep those ladies happy, they work hard and it shows!$h",
		"alex.daily.summer_Sun4": "Oh wow...your shoes are a little dirty... but that makes sense, working on a farm and all.#$e#Not sure I'd like being dirty all the time but... Oh, uh, I didn't mean that you're dirty all the time! You actually look pretty great right now.",
		"alex.daily.fall_Mon4": "Hey, hey! It's gridball season! It's tough to keep up my nutrition routine when I'm watching the games, but I'm determined to stay on track.#$e#You want to catch a game sometime? Haley gets bored so I need more friends to hang with.$h",
		"alex.daily.fall_Wed6": "I finally took the plunge... I've decided to stop putting gel in my hair.#$e#I wouldn't want to be friends with someone who only liked me because I have trendy hair.",
		"alex.daily.fall_Wed8": "I bet you're crazy busy at the farm, but if you have pumpkins, could I stop by and pick up a few?#$e#What do you think about having a pumpkin carving party? We could compete to see who can make the scariest or coolest jack-o'-lantern.$h",
		"alex.daily.fall_Thu2": "What's up, @? I'm going to watch some game replays and see if I can pick up any new strategies.",
		"alex.daily.fall_Fri6": "I'm going to do a ton of sit-ups tonight.#$e#It's a lot of work to maintain fitness at higher levels. Definitely not for everyone, you've gotta love the work.",
		"alex.daily.winter_Mon8": "What do you think, should I ask Shane to join my training sessions?#$e#The guy really needs some friends and something to do that doesn't involve the saloon or beer.#$b#Lately I've really wanted to reach out and help people, you know? Huh, you must be rubbing off on me, haha!$h",
		"alex.daily.winter_Tue": "Hey, if you happen to see Haley, tell her I said 'hi', I usually see her before now but I was busy with other stuff today.",
		"alex.daily.winter_Tue4": "Hey, @. Could you do me a favor?#$e#If you see Haley and she asks about me, tell her I'm busy. She keeps bugging me about some photography thing and I'm really not feeling it today.",
		"alex.daily.winter_Tue8": "@, you know how people say high school is the best years of your life?#$b#I don't think that's true... I'm happier now than I was in high school, especially now that I'm not entirely focused on gridball.#$e#I was missing out on great things like helping Haley with her photography and teaching proper lifting techniques at the gym.$h",
		"alex.daily.winter_Wed8": "You know, Seb recommended a book to me, and I was so bored I actually started reading it.#$e#It's really good and interesting! I think I might even finish it.$h",
		"alex.daily.winter_Thu6": "I wish I could control the weather, I hate when I want to do something outside and it's raining or snowing out.#$e#Well, I guess I could do winter sports, I just don't like being cold.#$b#You're building a snowgoon army at your farm? Huh, that sounds kind of fun, maybe I'll come by and help later.$h",
		"alex.daily.winter_Fri4": "You came all the way through the snow to see me?#$b#Thanks, that's nice of you. I like when you visit, you're fun to talk to.$h",
		"alex.daily.winter_Fri6": "I've been thinking, I worked so hard to get in shape and reach my goals, it might be a good idea to share that experience.#$e#Like, I could help somebody else in my situation to improve their life through better health.#$b#I dunno, just a thought...",
		"alex.daily.winter_Fri8": "If we add some overhead presses to the upper body workout... oh hey, I was just thinking out loud.#$e#I've been creating workout plans I can use as a base, then customize them to different people's goals.#$b#I never thought I had the attention span to keep track and record stuff like that, I figured it would be boring.#$b#But turns out since fitness is something I'm passionate about, it's actually fun!$h",
		"alex.daily.winter_Sat4": "Have you been up to the bathhouse gym? It's a great place to workout when it's cold.#$e#It gets kind of lonely though, I'm hoping to recruit some friends to join me there.",
		"alex.daily.winter_Sat8": "I'm starting to think about the future more... you know, more than just my gridball goal.#$e#Whether or not that works out, I want to be a dependable, stable guy for someone to want to spend their life with.",
		"alex.daily.spring_25": "I saw you at the dance yesterday, you looked really good. I mean, I was there with Haley, but I still notice other people.$h#$b#I've seen you talking with Sam and Sebastian sometimes, Sam I get but Sebastian... maybe I'll try talking to him if you think he's cool.",
		"alex.daily.summer_8": "Hi @, heading to the beach today? Sure is great weather for it!$h#$b#Haley's not too big on sports, what do you think about starting a two-on-two volleyball tournament?#$b#I'm hoping we can get enough people to make a decent competition out of it. Think Sam, Abigail, and Seb would join?",
		"alex.daily.fall_3": "You know, I was talking to Harvey at my last annual checkup and he mentioned a couple of careers related to fitness and health.#$b#It made me think for a minute, if things don't work out with my gridball goal, there are other options.#$b#I'm not giving up on gridball yet, but I might start looking into a couple of those jobs just to see what's out there.",
		"alex.daily.fall_12": "@, how's it going at the farm? It's your busy season, right?#$b#Let me know if you need any help, it would be good training to chop wood or haul some hay bales.$h",
		"alex.daily.fall_23": "Seb was over at my place earlier, he mentioned wanting to start a workout routine... of course he thought of me, heh!$h#$b#I told him I'd meet him at the bathhouse gym and give him a few exercises that he can start with.#$b#Seb mentioned he was trying to quit smoking, I'm really glad to hear that. Smoking can really mess up your cardio.",
		"alex.daily.winter_3": "Boy, I am not a fan of this weather, at least the bathhouse gym is nice and warm.$h#$b#It's only been like a week, but Seb is still showing up for our workouts, honestly I like having the company. It's hard to stay accountable by yourself.#$b#You could join us sometime, I know you get a lot of physical exercise at the farm, but there's still a few exercises you could do for flexibility.",
		"alex.daily.winter_19": "Hey @, has Seb told you about our workout sessions? I'm having fun coming up with routines for him.$h#$b#He's making good progress. Of course it'll take a while to reach his goals, but he's really putting in the work.#$b#I think I'll write down the plan I came up with in case I can use it again.",
		"alex.daily.summer_10_2": "Ready for the Luau tomorrow? I'm looking forward to it, it's never a bad day to be on the beach soaking up the sun!$h",
		"alex.daily.winter_24_2": "Oh man, it's the festival of great food tomorrow... I've been staying on track this year so binging once will be fine.#$b#I still really miss my mom on Winter Star, but I want to honor her by making good memories with my grandparents and friends.",
		"alex.reaction.dating_Sebastian": "@! Seb told me you guys are officially exclusive, ha!$h#$b#It's about time, pretty much the entire town assumed you were already dating, considering how inseparable you two are.$h",
		"alex.reaction.married_Sebastian": "Congrats on the wedding and all, Haley is still talking about it and how amazing you looked.$h#$b#I mean, you look amazing pretty much all the time, but you were so happy I even thought about... oh, um, forget that, heh!$l",
		"alex.reaction.dating_Sam": "@! Sam told me you guys are officially exclusive, ha!$h#$b#It's about time, pretty much the entire town thought you were already dating, considering how inseparable you two are.$h#$b#I pretty much assumed you'd end up with either Sam or Seb, I hope that dingus knows how lucky he is!",
		"alex.reaction.married_Sam": "Congrats on the wedding and all, Haley is still talking about it and how amazing you looked.$h#$b#I mean, you look amazing pretty much all the time, but you were so happy I even thought about... oh, um, forget that, heh!$l",
		//ALEX SVE
		"alex.schedule.Town_53_69.1.lowhearts": "Hey there. Came to pet Dusty? He's a friendly ol' boy.",
		"alex.schedule.Town_53_69.2.lowhearts": "Dusty loves scratches behind his ears, look at him all happy!$h",
		"alex.schedule.Town_53_69.3.lowhearts": "This big baby loves attention, he'll be so happy if you stop and pet him whenever you come by.",
		"alex.schedule.Town_53_69.1.medhearts": "Hi! Dusty sure is glad to see you, he loves your ear scratches.$h",
		"alex.schedule.Town_53_69.2.medhearts": "Come visit Dusty with me, he just loves all the attention.$h",
		"alex.schedule.Town_53_69.3.medhearts": "Did you bring some treats for Dusty? No wonder he's always looking for you, heh!$h",
		"alex.schedule.Town_53_69.1.highhearts": "Hi! did you stop to chill with Dusty? Can't blame you, he's a great dog.$h",
		"alex.schedule.Town_53_69.2.highhearts": "Dusty's all excited you stopped to see him. Oh, you stopped to see me too? Heh, cool.$h",
		"alex.schedule.Town_53_69.3.highhearts": "I was hoping you'd come by, want to hang out with me and Dusty?$h",
		"alex.schedule.JoshHouse_10_19.1": "Haley and I are hanging out since we haven't done that in a while.",
		"alex.schedule.JoshHouse_10_19.2": "What's up? We were just heading out to visit Dusty and see if there's anything interesting going on.$h",
		"alex.schedule.JoshHouse_10_19.3": "There's not a lot to do around here, but we're just wandering around today.",
		"alex.schedule.JoshHouse_10_19.4": "Hi @, want to join us? We're just wandering around today. Sometimes, it's nice to take a day off and basically do nothing.$h",
		"alex.schedule.JoshHouse_10_19.5": "Make sure you take break days to relax and recharge, we're just going to visit Dusty and play some arcade games.$h",
		"alex.schedule.JoshHouse_10_19.6": "Today's the day to chill, you're welcome to join us, even though it's not super exciting.",
		"alex.schedule.Saloon_34_18.1": "Woo hoo!! I'm just about to beat Sam's high score!$h",
		"alex.schedule.Saloon_34_18.2": "Urgh, I nearly beat the level... now I need more coins.$s",
		"alex.schedule.Saloon_34_18.3": "C'mon, c'mon, oh man! Dude, why'd you just fall off the cliff??$s",
		"alex.schedule.Saloon_34_18.4": "*muttering* Sam, you must be a monster! How do you keep raising the high score?$a",
		"alex.schedule.Saloon_34_18.5": "Oh hey, I'm nearly at the top level, watch me totally beat this thing!$h",
		"alex.schedule.Saloon_34_18.6": "I really should quit this game, but I'm so close! Just one more round.",
		//ALEX RAIN
		"alex.rain.1.lowhearts": "It's kind of a bummer when it's raining, too wet to go out and toss the ball or anything so I'm stuck inside.$s",
		"alex.rain.2.lowhearts": "The only good thing about rain is not having to water the plants. Maybe I should try fishing...",
		"alex.rain.3.lowhearts": "You don't let the rain stop you, huh? Maybe I should learn from your example... but I did just clean these shoes.",
		"alex.rain.1.medhearts": "It's really coming down out there, you should take a break. There's fresh cookies in the kitchen, and at least it's warm and dry in here!$h",
		"alex.rain.2.medhearts": "Want to watch some game replays since it's pouring out there? Oh yeah, I forgot you like to go mining in this weather. I guess that makes sense.",
		"alex.rain.3.medhearts": "Hey, you should wear a warmer jacket in the rain, being strong doesn't mean you can't catch cold, heh!",
		"alex.rain.1.highhearts": "Oh man, you're soaked! Come in and dry off, we have lots of towels and you're welcome to use one.#$e#Want to hang out and watch a movie or some game replays?$h",
		"alex.rain.2.highhearts": "I guess it's a good time to go mining or fishing in the rain, but maybe you could take a break?#$e#I don't have anything going on so we could hang out.$h",
		"alex.rain.3.highhearts": "You look frozen! Get in here and warm up, I'll make some coffee or tea and a snack for us.#$e#Seb was bugging me about trying Solarion Chronicles, seems like this might be a good day for it.$h",
		//ALEX SCHEDULE
		"alex.animation.weights.1.lowhearts": "Unghh... Just ten more reps. Can't talk.$6",
		"alex.animation.weights.2.lowhearts": "Lemme finish this set, then you can tell me what's up.$6",
		"alex.animation.weights.3.lowhearts": "Can you come back in a few? Gotta finish this routine.$6",
		"alex.animation.weights.1.medhearts": "Just a sec, I'm nearly done.$6#$b#%Oh, I don't mind waiting, I sort of came to watch, heehee!",
		"alex.animation.weights.2.medhearts": "Man, this new routine is a little tough, sorry I can't really talk.$6",
		"alex.animation.weights.3.medhearts": "Did you... need something? I can help you... in just a few.$6",
		"alex.animation.weights.1.highhearts": "Admit it, you just come to watch, right? Heh! Don't worry, it doesn't bother me.$6#$e#You should see the look on your face, I was just joking.$6",
		"alex.animation.weights.2.highhearts": "Hey! I was getting kind of bored, tell me what's going on at the farm while I finish this set.$6",
		"alex.animation.weights.3.highhearts": "There's some weights over there if you want to join me, heh! Just kidding, I'll be done soon if you want to hang out.$6",
		"alex.schedule.Sun.000": "Hey, @, did you come to watch the game with us? Here, I'll scoot over and make room, it'll be cozy but that's okay.$h",
		"alex.schedule.Sun.000_married": "Hey, @! You can watch the game with us if you want, but no pressure if you're busy. My lap is open, heehee!$h#$b#Just kidding. Well, not really but I think I'm supposed to say that since Shane is giving me dirty looks.#$b#Anyway, I'll catch you up on the game if you want to stay.$h",
		"alex.schedule.checkup.summer_16.000": "Good thing my checkup is today, I turned my ankle and it's starting to swell. I'm sure it's nothing, but I'll let Harvey check it out since I'll be there anyway.#$b#I kind of overdid it with the lunges yesterday and lost my balance. Rookie mistake.$s",
		"alex.schedule.checkup.summer_16.001": "Oh, hi @, you're not hurt are you? If you need to see the doc, I can wait. I'm just getting my ankle taped.",
		"alex.schedule.nightmarket.winter_17.000.lowhearts": "Have you seen the mermaid show? The music is kind of enchanting...#$b#Anyway, you should check it out, I've heard there's some kind of prize you can get.",
		"alex.schedule.nightmarket.winter_17.000.medhearts": "Have you seen the mermaid show? The music is kind of enchanting... oh, that came off kind of weird, really the music just sounds cool.#$b#Anyway, you should check it out, I've heard there's some kind of prize you can get.",
		"alex.schedule.nightmarket.winter_17.000.highhearts": "Have you seen the mermaid show? The music is kind of enchanting... oh, that came off kind of weird, really the music just sounds cool.#$b#I'm not just going to look at the mermaids... ugh, that's not helping. Anyway, you should check it out, I've heard there's some kind of prize you can get.#$b#I'm going to browse the vendor stalls and try to forget this conversation, heh.$s",
		//FESTIVAL DIALOGUE
		"alex.eggfestival.spring13.y1": "Hey @, you showed up. Look at all this protein! I try to eat at least three eggs every day, it helps with maintaining muscle.#$b#It might seem like I eat a lot, but I have to since muscle burns so many calories.",
		"alex.eggfestival.spring13.y2": "Are you doing the egg hunt? Maybe I'll go with you, it looks pretty fun and we'd get a good run out of it even if we don't win.$h",
		"alex.flowerdance.spring24.lowhearts": "I'm just hanging out and taking in the view, you look great by the way. Oh, ah, don't tell Haley I said that.$h#$b#Well, my grandma designed and set up all the decorations, she really worked hard on it all week.$h#$b#I helped her out with moving the planters around, I don't mind doing that kind of thing.",
		"alex.flowerdance.spring24.medhearts": "Hey, @, you look great! Oh, ah, don't tell Haley I said that.$h#$b#Well, my grandma designed and set up all the decorations, she really worked hard on it all week.$h#$b#I helped her out with moving the planters around, I don't mind doing that kind of thing.",
		"alex.flowerdance.spring24.highhearts": "Hey, you look amazing. Don't worry if you can't remember the steps, just go out with confidence and nobody will be the wiser.$h#$b#My Grandma did an amazing job with the flowers, she really outdid herself this year. I tried to help out, but it seemed like I was more in the way than anything.$h#$b#At least she still lets me move the planters and set up the dance floor.",
		"alex.luau.summer11.lowhearts": "Perfect weather for a beach party, huh? It's nice just soaking up the sun. Have you tried the soup yet? I'm... not sure I trust it this year.#$b#Nothing to do with you, I just have a feeling someone is planning something.$9#$b#Anyway, I won't be dancing since Haley hates to break a sweat. Are you planning to hit the dance floor?",
		"alex.luau.summer11.medhearts": "Perfect weather for a beach party, huh? It's nice just soaking up the sun. Have you tried the soup yet? I'm... not sure I trust it this year.#$b#Nothing to do with you, I just have a feeling someone is planning something.$9#$b#Are you planning to hit the dance floor? Haley doesn't like to dance in the heat, but I might be persuaded to give it a try.$h",
		"alex.luau.summer11.highhearts": "Perfect weather for a beach party, huh? It's nice just soaking up the sun. Have you tried the soup yet? I'm... not sure I trust it this year.#$b#Nothing to do with you, I just have a feeling someone is planning something.$9#$b#You look really great in that outfit, are you planning to hit the dance floor? I might be persuaded to give it a try if you want.$h",
		"alex.luau.summer11.y2": "Do you think if I went in the water, other people would follow? I don't want to be the only one swimming, but it sure would feel good in this heat!#$b#Want to join me? We could do some shallow diving and see what we can find down there.$h",
		"alex.jellies.summer28.lowhearts": "The jellies are really cool, but it's sad that summer's over... I feel like it just started.$s#$b#At least it was a fun season this year, you definitely made it more interesting, heh!$h#$b#Haley mentioned trying to get some photos, so I better help her out.",
		"alex.jellies.summer28.medhearts": "The jellies are really cool, but it's sad that summer's over... I feel like it just started.$s#$b#At least it was a fun season this year, you definitely made it more interesting, heh!$h#$b#Haley's playing with her new camera lens, just don't be surprised if you end up in a few photos.$h",
		"alex.jellies.summer28.highhearts": "The jellies are really cool, but it's sad that summer's over... I feel like it just started.$s#$b#At least it was a fun season this year, you definitely made it more interesting, heh!$h#$b#Haley's playing with her new camera lens, I bet she'd take some photos of us if we ask her, heh.$h",
		"alex.jellies.summer28.y2": "It's kind of chilly at night by the water even though it's still summer, at least for a few more hours.#$b#I wish summer lasted longer, it's really been a great year.",
		"alex.fair.fall16.lowhearts": "Ooof! I beat my high score on the strength game, but dang... I'll be paying for that tomorrow, heh!$s#$b#Haley went to see the fortune teller, she says it's all fake, but she still talks to her every year. Me? I dunno, it just seems like a distraction.",
		"alex.fair.fall16.medhearts": "Ooof! I beat my high score on the strength game, but dang... I'll be paying for that tomorrow, heh!$s#$b#Haley went to see the fortune teller, she says it's all fake, but she still talks to her every year.#$b#... Me? Hmm... I haven't really thought about it much, maybe I'll give it a shot just for fun.",
		"alex.fair.fall16.highhearts": "Ooof! I beat my high score on the strength game, but dang... I'll be paying for that tomorrow, heh!$s#$b#Haley wanted to know if you've visited the fortune teller, I told her she should just ask you, heh!$h#$b#... Me? I uh... haven't gotten there yet, but I'll see what she has to say. Just for fun.$h",
		"alex.fair.fall16.y2": "I wonder if I can beat my high score on the strength game again... hmmm... those rubber arms last year were definitely no fun.#$b#I can help you with your grange display, just show me where you want everything.#$b#Oh, you like that stuffed dragon? I'll win it for you, no problem!$h#$b#%That will keep Alex busy for a while, heh!",
		"alex.spiritseve.fall27.lowhearts": "There's something weird over there. But how do I get to it? There's gotta be a secret passage somewhere around here.#$b#Hey, @, do you see the way out of here? This maze is crazy!",
		"alex.spiritseve.fall27.medhearts": "There's something weird over there. But how do I get to it? There's gotta be a secret passage somewhere around here.#$b#Hey, @, do you see the way out of here? This maze is crazy! Maybe be can figure it out together.$h",
		"alex.spiritseve.fall27.highhearts": "@! You made it in this far, do you see any secret passages around here? There's gotta be a way through.#$b#I saw Sam earlier, but I bet he's completely lost by now, heh! Want to team up? I bet we can figure it out together.$h",
		"alex.spiritseve.fall27.y2": "I keep hearing weird voices in the maze, like people calling for help... it's creeping me out. *shivers*#$b#%Aww, poor Alex, he tries to put on a brave face, but I'm pretty sure he's not a fan of eerie Spirit's Eve stuff.#$b#*whispers* Let's get out of this place and find some good snacks.$s",
		"alex.icefestival.winter8.lowhearts": "Snowmen are okay, I guess. But mostly I'm looking forward to the spring. I guess I'm just not big on cold and wet.$s",
		"alex.icefestival.winter8.medhearts": "Are you building a snowman? I'll give you a hand getting the body stacked up there.$h#$b#So far, I've successfully avoided the snow war, but I'm definitely keeping an eye out for stray snowballs.#$b#All I can say is if one of those chuckleheads nails me, they'll regret it.$a#$b#%I certainly wouldn't want to be on the receiving end of an Alex snowball, but I bet we could build an awesome snowman!",
		"alex.icefestival.winter8.highhearts": "Are you building a snowman? I'll give you a hand getting the body stacked up there.$h#$b#So far, I've successfully avoided the snow war, but I'm definitely keeping an eye out for stray snowballs.#$b#All I can say is if one of those chuckleheads nails me, they'll regret it.$a#$b#After we finish this snowman, let's get some hot drinks and hang out by the fire.$h",
		"alex.icefestival.winter8.y2": "You think anyone would mind if I took a dip in the frozen lake after the festival? I've heard ice baths are good for the muscles.#$b#... Pfftt... Yeah, you're right, no way I want to freeze myself like that, I can barely handle being outside in winter let alone jump in a frozen lake, haha!$h",
		"alex.winterstar.winter25.y1": "Merry Winter Star @! Come join us at our table.$h#$b#I want you to know... this has been the best year of my life. So much has changed for the better and I have you to thank for that.",

//CAROLINE
		"caroline.reaction.dating_Sebastian": "Hello @, Abigail mentioned you and Sebastian are dating now. She seems quite pleased about it.$h#$b#Before you moved here, Abby seemed interested in Sebastian, but she was a bit too young for him. I'm glad they stayed friends instead.",
		"caroline.reaction.married_Sebastian": "@, how are you and Sebastian settling in at the farm?$h#$b#You should relax for a while, at least keep the work light for a few days and spend time together.",
		"caroline.reaction.dating_Sam": "Hello @, Abigail mentioned you and Sam are dating now. She seems quite pleased about it.$h#$b#Before you moved here, Abby was kind of lonely. She's friends with Sebastian and Sam, but I think she felt like a third wheel.#$b#Now that you're here, she seems much happier.$h",
		"caroline.reaction.married_Sam": "@, how are you and Sam settling in at the farm?$h#$b#You should relax for a while, at least keep the work light for a few days and spend time together.",
		"caroline.reaction.married_Alex": "@, how are you and Alex settling in at the farm?$h#$b#You should relax for a while, at least keep the work light for a few days and spend time together.",

//CLINT
		"clint.reaction.dating_Sebastian": "I've heard you're dating someone now, that young computer hacker, Sebastian.#$b#Huh, I never thought young guys his age would find someone before I did, maybe it's time to really commit to some changes in my life.",
		"clint.reaction.married_Sebastian": "Ah, @, the wedding was very nice. Be sure to stop by if you need supplies to expand your house or other buildings.$h#$b#If you ever want a lesson in forging, don't hesitate to ask!",
		"clint.reaction.dating_Sam": "I've heard you're dating someone now, that young skater boy Sam.#$b#Huh, I never thought young guys his age would find someone before I did, maybe it's time to really commit to some changes in my life.",
		"clint.reaction.married_Sam": "Ah, @, the wedding was very nice. Be sure to stop by if you need supplies to expand your house or other buildings.$h#$b#If you ever want a lesson in forging, don't hesitate to ask!",
		"clint.reaction.dating_Alex": "I've heard you're dating Alex now. He's a decent guy, he always takes time to talk gridball with me.#$b#Huh, I never thought young guys his age would find someone before I did, maybe it's time to really commit to some changes in my life.",
		"clint.reaction.married_Alex": "Ah, @, the wedding was very nice. Be sure to stop by if you need supplies to expand your house or other buildings.$h#$b#If you ever want a lesson in forging, don't hesitate to ask!",

//DEMETRIUS
		"demetrius.special.Introduction": "Greetings! I'm Demetrius, local scientist and father. Thanks for introducing yourself!#$b#I'm studying the local plants and animals from my home laboratory.#$b#Have you met my daughter Maru? She's interested in meeting you.#$b#I also have a step-son, Sebastian. He's usually in his room downstairs, he might be a little less excited to meet someone new.",
		"demetrius.daily.Mon": "Maru helps me out in the lab sometimes... She's a good kid. I started teaching her how to use lab equipment before she started elementary school.",
		"demetrius.daily.Mon4": "Ah, Maru was asking about you earlier, I think she's working on a project and would like your input.#$b#It's good to see her making close friends.$h",
		"demetrius.daily.Mon6": "I know I sound like a stuffy academic sometimes, Robin has pointed that out on occasion.#$e#Thank you for coming by to check on me at my lab, I do appreciate the company.",
		"demetrius.daily.Tue": "This valley has a very vibrant and diverse ecosystem. That's one reason I was excited to move here.#$e#Robin also loves the valley, she grew up here and it's her home.",
		"demetrius.daily.Tue4": "I'm off to gather some samples at the lake, I've been mapping out the ecosystem and all the species supporting the lake environment. It's fascinating work.#$e#If you happen to catch any fish you don't need, let me know. I might be able to use them, or they could become dinner, haha!",
		"demetrius.daily.Wed": "You're probably growing a lot of interesting plants on your farm, huh?#$e#Maybe I'll stop by your place some day and check it out. If you need any advice on the optimal conditions for a specific species, feel free to ask.$h",
		"demetrius.daily.Wed4": "How are your crops growing? I hope all is well.#$e#Have you built a greenhouse? Those are very handy in winter, or for growing any plants you want to harvest year-round.",
		"demetrius.daily.Wed6": "Hi @! How are you doing today?#$b#I wish I could make your farming job easier somehow. Be sure to let me and Maru know if there's anything we can do to help improve your farm.",
		"demetrius.daily.Thu4": "How are you today? I've had some minor breakthroughs in my lastest project so it's been a productive day so far.",
		"demetrius.daily.Fri": "I have noticed you chatting with Maru and Sebastian, they seem to enjoy your company.#$e#Sebastian works on his computer most of the day. Maybe you can encourage him to expand his interests.$u",
		"demetrius.daily.Fri4": "Hello @, it's good to see you. Be sure to talk with Robin if you haven't already, she enjoys your company.$h",
		"demetrius.daily.Sat2": "I do wish Sebastian would come out of his room more often, he's wasting his life locked in that basement. Robin is too soft on him sometimes.",
		"demetrius.daily.Sun4": "Maru mentioned Sebastian had helped her with some coding, I hope the two of them start working together more. Their skills compliment one another.",
		"demetrius.daily.spring_Mon8": "It seems appropriate that Sebastian's knowledge of computers became the bridge between us, though I wish I had discovered how to reach him earlier.#$e#Well, there is nothing to gain by living in regret. I do hope I can build a solid relationship with him, it will take time and effort on both our parts, but I am determined to try.",
		"demetrius.daily.spring_Tue8": "Hmm... where did that beaker go? I was sure I left it... Oh, hi @!#$b#If you happen to notice unusually high concentrations of algae in the lake, don't worry, it will dissipate in the sun... I misplaced a beaker, you see.",
		"demetrius.daily.summer_Mon4": "Maru's current investigations are very promising, she's close to a breakthrough in solving the mysteries of a robotic neural net.",
		"demetrius.daily.summer_Mon6": "I became a scientist because I wanted to contribute to the progression of the human race.#$b#Of course, none of this would be possible without farmers such as yourself, you're the backbone of our community.$h",
		"demetrius.daily.summer_Tue2": "Since Sebastian works in computer science, I thought we would find some common interests.#$b#Unfortunately the science fields we study are quite different. Not unlike Sebastian and myself.",
		"demetrius.daily.summer_Tue4": "Did you know there are about 13,000 species of legumes? They can be used for many things from food to dyes. I can't hope to study them all.",
		"demetrius.daily.summer_Tue6": "There was a bit of a close call in the lab earlier today, I only turned my back for a moment but my experiment literally went up in a ball of fire, as they say, heh!#$b#Nothing was damaged, other than my pride of course.",
		"demetrius.daily.summer_Wed": "Maru and I already have much in common, so I've been attempting to find ways to bridge the gap between Sebastian and myself.#$e#It's challenging since he can be very emotional and difficult to understand.#$b#If you become friends, maybe you could offer some suggestions?",
		"demetrius.daily.summer_Wed4": "Hmm I've been working through some data from a previous study that relates to my current project, it's difficult to compare to the current data on my computer.#$b#It would be nice if I could have both datasets open side by side for comparison.",
		"demetrius.daily.summer_Wed6": "I mentioned the difficulty I was having with comparing my project data to Sebastian, he seemed intrigued by the problem and mumbled something about software coding.#$e#Sometimes I wonder what he's thinking about.",
		"demetrius.daily.summer_Wed8": "Sebastian installed a new program on my computer that he wrote to assist in my scientific data analysis.#$b#It's very useful, I can now easily compare the data from various studies and the program will filter and flag unique or similar entries.#$e#It has saved significant time and effort in my work. I mentioned it to some colleagues and they requested copies of the software.#$b#I'm proud to see my son's name as the program developer.$h",
		"demetrius.daily.summer_Thu4": "Robin has a hot temper. It's better to stay on her good side.#$b#...now if I could only quantify her mood levels, perhaps I could model the fluctuations using a sinusoidal curve...$u",
		"demetrius.daily.fall_Mon6": "Did I tell you about the time I misplaced one of my sample vials?#$b#I came back the next day to a blanket of fungi growing on the countertop. Robin wasn't quite as amused as I was.",
		"demetrius.daily.fall_Mon8": "I met one of Maru's little robots today, it wandered into the lab while I was running some tests and ran into my foot. *chuckles*",
		"demetrius.daily.fall_Wed6": "Hi @. I'm always glad when you come for a visit, it's nice to have some company after all this lonely labwork.#$e#Sebastian has asked me about a few of my projects recently, he's making an effort. I hope he's honestly interested, I do like telling him about my work.",
		"demetrius.daily.fall_Wed8": "How are your crops growing this year? If you like, there are several tests I could run to map the various soil qualities to determine the optimum locations for each crop type.",
		"demetrius.daily.fall_Thu4": "Sebastian is very talented in the field of mechanics, he does well with hands-on work, similar to Robin.#$e#I do see some of her in him. Possibly I could find a project involving mechanics we could work on together.",
		"demetrius.daily.fall_Thu6": "When I was returning with samples from the lake, Sebastian was working on his motorcycle. I stopped to speak with him about the mechanics of the motorcycle engine.#$e#We had a pleasant conversation about some enhancements he'd like to make to the bike, I rather enjoyed it.",
		"demetrius.daily.fall_Thu8": "I want to help Sebastian with his motorcycle, do you think he would like to receive some engine parts for his birthday?#$e#Ah, yes, I will make sure they are the exact parts he wants for upgrading the bike, some of the things he mentioned are not purely focused on practical function.",
		"demetrius.daily.fall_Sun": "Hello, @, have you visited Sebastian today?#$b#I wonder if he had more friends, would his outlook improve? Hmm.",
		"demetrius.daily.winter_Mon4": "I might not seem like the romantic type, but I understand the importance of having someone by your side in life.#$e#I hope Maru and Sebastian always have life companions, whether that is close friendship or a romantic relationship.",
		"demetrius.daily.winter_Mon6": "@, do you have any recommendations for a romantic evening? I'd like to do something for Robin but I'm not confident I can plan an appropriate date.#$b#A nice dinner at the saloon in the private room with flowers? Hmm I think that could be successful, I'll let you know the results.$h",
		"demetrius.daily.winter_Mon8": "Thank you for your advice for an evening out with Robin, she greatly appreciated not needing to cook and she enjoyed the flowers.#$e#Maybe I will take her to see the algae growth I discovered recently.#$b#Oh? You doubt she would enjoy that? Hmm... you could be right, she might not appreciate the aesthetics of algae.",
		"demetrius.daily.winter_Wed6": "Sebastian insisted on making a 'snowgoon' by our house, it was so lopsided, I just don't understand why he does that. I asked him to take it down.",
		"demetrius.daily.winter_Wed8": "Why does Sebastian insist on building 'snowgoons'? They're asymetrical, it doesn't make sense. What's wrong with a snowman with perfectly aligned sections?#$e#*sighs* Oh well. I suppose that falls under the design aesthetic Robin always refers to.",
		"demetrius.daily.winter_Thu4": "Humph... Maru built a nice snowman and I told her how well it was designed. Sebastian rolled his eyes and built a 'snowgoon'. What is that boy thinking?",
		"demetrius.daily.winter_Thu6": "Sebastian asked about one of my experiments today, he seemed genuinely interested.#$b#It seems his friends been a good influence on him.",
		"demetrius.daily.winter_Thu8": "I've been working through some of the data from a lake ecology study.#$e#Sebastian was genuinely interested and helped me organize it in a software program he designed for my work.$h",
		"demetrius.daily.summer_10": "Today is Maru's birthday, Robin and I are treating her to a special dinner.#$e#Sebastian is invited of course, but it's unlikely he will want to come.",
		"demetrius.reaction.dating_Sebastian": "I hear you and Sebastian are formally dating. To be honest, I'm glad he found you.#$b#I was becoming concerned that his lack of social skills would make it difficult for him to find a life partner.#$b#However, as Robin fondly reminded me, I was able to find someone so maybe I shouldn't have doubted him.$h",
		"demetrius.special.Tue_inlaw_Sebastian": "How's Sebastian doing on the farm?#$b#I hope he's helping but it's hard to imagine him working outside all day.#$b#However, he might be able to design you some software for farm management.$h",
		"demetrius.reaction.married_Alex": "How are things going on the farm? I hope Alex is helping, it's good that he enjoys working outside all day.#$b#Both Maru and Sebastian have been very excited about your marriage, I'm glad they have friends like you.$h",
		"demetrius.Event_Lab_Silence": "Well, we'd better titrate this solution before it crystallizes on us, this experiment is a little less forgiving than the kid ones.",
		"demetrius.Event_Lab_Rat": "*chuckles* Thanks for listening.",
		"demetrius.Event.cs.1018": "I hope I didn't embarrass Maru too much, I'm just very proud of her.$h",

//ELLIOTT
		"elliott.reaction.married_Sebastian": "Ah @, your wedding belonged in a fairytale, I'm using it as inspiration for a new chapter in my book.$h#$b#You and Sebastian looked so happy, it was wonderful to see.",
		"elliott.reaction.married_Sam": "Ah @, your wedding belonged in a fairytale, I'm using it as inspiration for a new chapter in my book.$h#$b#You and Sam looked so happy, it was wonderful to see.",
		"elliott.reaction.married_Alex": "Ah @, your wedding belonged in a fairytale, I'm using it as inspiration for a new chapter in my book.$h#$b#You and Alex looked so happy, it was wonderful to see.",

//EMILY
		"emily.reaction.dating_Sam": "Your aura is so light and joyful today! It must be that your and Sam's spirits have found alignment.$h#$b#Your happiness is so refreshing, tell me all about it!$h",
		"emily.reaction.dating_Sebastian": "Your aura is so light and joyful today! It must be that your and Sebastian's spirits have found alignment.$h#$b#Your happiness is so refreshing, tell me all about it!$h",
		"emily.reaction.dating_Alex": "Your aura is so light and joyful today! It must be that your and Alex's spirits have found alignment.$h#$b#Your happiness is so refreshing, tell me all about it!$h",

//EVELYN
		"evelyn.reaction.dating_Sebastian": "Oh I saw you and that nice young man, Sebastian, holding hands down by the docks.#$b#That boy is so sweet, bringing George leeks and other things he's gathered from the mountain.#$b#George complains about Sebastian's hair but he is quite fond of the boy. He's a good match for you, you compliment each other so well!$h",
		"evelyn.reaction.married_Sebastian": "Hello dear, what a lovely wedding you had, it's so heartwarming to see young couples starting a life together.#$b#Don't forget to come by and visit, George will miss you both if you don't, and I'll be sure to have freshly baked cookies for you!$h",
		"evelyn.reaction.dating_Sam": "Oh I saw you and that nice young man, Sam, holding hands down at the beach.#$b#That boy is so sweet, always happy and smiling. He likes to stop and chat when I'm tending the flowers even though he starts sneezing sometimes.#$b#George complains about Sam's skateboard but he is quite fond of the boy. He's a good match for you, you compliment each other so well!$h",
		"evelyn.reaction.married_Sam": "Hello dear, what a lovely wedding you had, it's so heartwarming to see young couples starting a life together.#$b#Don't forget to come by and visit, George will miss you both if you don't, and I'll be sure to have freshly baked cookies for you!$h",
		"evelyn.reaction.dating_Alex": "Alex told me the news, he was grinning and blushing so much, he looked like one of my flowers, haha! *hugs*$h#$b#You've been so patient with him, letting him find his way. You're very special, @, remember that.$h",
		"evelyn.reaction.married_Alex": "Oh my, you and Alex looked so happy up there under the wedding arch, it was such a lovely moment. *hugs*#$b#I'm so glad Alex found someone like you, he's such a wonderful boy and you are the perfect match for him.$h#$b#Be sure to come by often to visit, I know you will. *whispers* George is so excited, don't let his grumbling fool you!$h",

//GEORGE
		"george.reaction.dating_Sebastian": "So you're dating Robin's boy, Sebastian, huh? Can't say as I thought much of him at first with his long hair and tight pants, hmph.#$b#He keeps stopping by and dropping off leeks he finds walking down from the mountain, so I guess he's an okay kid.#$b#He doesn't talk much which is nice, makes him a good listener. Respects his elders.$h#$b#You could definitely do worse than a boy like him. Just try to get him to cut his hair, it's always in his eyes.",
		"george.reaction.married_Sebastian": "It's good to see young people getting married, we need to keep the traditions alive.#$b#Tell Sebastian I still expect him to bring me leeks from the mountain once in a while, I have some stories I haven't told him yet.#$b#You're both good kids, I'm glad you found each other. If you decide to have kids yourselves, bring them by as long as they're well-behaved.#$b#Maybe you'll get to be like me and Evelyn someday, a couple of old fogeys talkin' about the good old days. Hmmph.$h",
		"george.reaction.dating_Sam": "So you're dating Jodi's boy, Sam, huh? Can't say as I thought much of him at first with his skateboard and loud music, hmph.#$b#He stops by with Robin's boy, Sebastian, to bring me leeks from the mountain, so I guess he's an okay kid.#$b#He never stops talking, he could learn a thing or two if he would listen more.#$b#Sam is very kind though, you could definitely do worse than a boy like him. Just try to get him to cut his hair, it's always sticking up everywhere.",
		"george.reaction.married_Sam": "It's good to see young people getting married, we need to keep the traditions alive.#$b#Tell Sam I still expect him to come and visit with Sebastian once in a while, I have some stories I haven't told them yet.#$b#You're both good kids, I'm glad you found each other. If you decide to have kids yourselves, bring them by as long as they're well-behaved.#$b#Maybe you'll get to be like me and Evelyn someday, a couple of old fogeys talkin' about the good old days. Hmmph.$h",
		"george.reaction.dating_Alex": "So Alex finally grew a spine and asked you out, huh. Well, he's been talking about you non-stop since you moved here so it was just a matter of time.#$b#... Hmmm... he could certainly do worse. You're a good one, @, Alex is lucky to have you.",
		"george.reaction.married_Alex": "*sniff* No, no, I don't need a tissue. Hmph. Well, thank you.#$b#I can tell you and Alex are going to be very happy together, like me and Evelyn. Don't be like me though, tell Alex how you feel.#$b#That boy practically worships you, and I know you'll treat him right. Don't forget about us old fogeys, our door is always open for you.$h",

//GUS
		"gus.reaction.dating_Sebastian": "It's good to see you, @. Has Sebastian cooked for you yet? He's a great student, very motivated.$h#$b#Before you moved here, I couldn't get more than a grunt out of that young man, I thought I was hearing things when he asked me to teach him to cook.#$b#Since then, he's started talking more and is very excited to show you what he's learned.$h",
		"gus.reaction.married_Sebastian": "Congrats, @! I have a drink on the house waiting for you and Sebastian.$h#$b#I hope Seb continues his cooking lessons, I enjoy seeing him every week.",
		"gus.reaction.dating_Sam": "Well hello there, @, I trust the day is treating you well.#$b#I heard the chatter from the usual Friday night gang, you and Sam are finally officially dating, hehe!$h#$b#Since I see you all nearly every Friday night, it was no surprise to me.#$b#That boy has never been able to be quiet and it's been quite entertaining to watch your relationship evolve from behind the counter.$h",
		"gus.reaction.married_Sam": "Congrats, @! I have a drink on the house waiting for you and Sam.$h#$b#Tell Sam I can give him some cooking lessons if he's interested! The boy can't just live on pancakes alone!$h",
		"gus.reaction.dating_Alex": "It's good to see you, @. I heard the news about you and Alex, that boy couldn't have found a better partner.#$b#He shared an omelet recipe with me, keep an eye out, it'll be on the menu soon!$h",
		"gus.reaction.married_Alex": "Congrats, @! I have a drink on the house waiting for you and Alex.#$b#I hope Alex continues his omelet cooking adventures, he showed me the website, he's quite a creative chef!$h",

//HALEY
		"haley.daily.Mon2": "Okay so I walked to the fountain, watched the water and some butterflies for a while, then walked back. Now I'm bored. What else is there to do? *sighs*",
		"haley.daily.Mon4": "What do you do when you're not working? I know you hang out with some people around here, everyone seems to like you.#$e#No, I'm not asking for advice making friends, you just never seem to get bored.",
		"haley.daily.Mon6": "I used to complain about this town being so small, but now I kind of like it.#$e#Since I don't have a lot of friends, I think I'm closer with the ones I have.$h#$b#And it is beautiful around here, there are always good places to take photos.",
		"haley.daily.Tue2": "I wonder if any nice shells washed up on the beach this morning?#$e#This isn't the best time of year for shells, though. In the summer you can find some really great ones.",
		"haley.daily.Tue8": "I can't wait for summer, then I can stroll on the beach and feel the sand in my toes.#$e#Do you have any plans for this summer? Be sure to take breaks and hang out at the beach, we can chat about whatever and drink fancy tropical smoothies.$h",
		"haley.daily.Wed": "The only thing I like about this town is the beach.$u#$b#I wish there was more to do here, or more people to talk to.",
		"haley.daily.Wed2": "Emily has her job at the saloon, and Alex is always busy practicing. I guess I need a hobby.#$b#Does shopping count as a hobby?",
		"haley.daily.Wed4": "I've decided that shopping does not count as a hobby. Maybe I'll do more photography. I guess your farm is pretty scenic in some places, mind if I take some pictures?#$b#Don't worry, I'll make sure you're not in them unless you want to be.$h",
		"haley.daily.Wed8": "I've gotten some great photos lately around the valley, I think I'll submit some to this photography magazine I subscribe to. That would be so amazing if I got published!$h",
		"haley.daily.Thu4": "I'm glad that the flowers are starting to bloom, those pink ones smell so good.$h#$e#Hmmm if I got a new lens for my camera, I could take some really close shots of the flower petals.",
		"haley.daily.Thu6": "I cooked dinner last night. It actually turned out okay!#$e#But I did make a huge mess in the kitchen... well, at least I cleaned it up and we had a decent meal. That's an accomplishment, right?",
		"haley.daily.Fri": "Don't you get tired of running around on that farm all day, or whatever it is you do?#$e#I couldn't stand getting all dirty like that.#$e#You probably get a nice tan, though.",
		"haley.daily.Fri2": "So what exactly do you DO on the farm? Driving tractors and feeding animals? Hmm... that sounds really noisy and dirty. Do you at least grow flowers?",
		"haley.daily.Fri6": "You play the nini-harp, right? Maybe you could give me a few lessons? I need some hobbies besides clothes and makeup.#$e#I have my photography of course, but I think learning an instrument would be nice.$h",
		"haley.daily.Sat2": "Next time I go shopping, you can come if you want. You'll need to wear clean clothes though. You really should expand your wardrobe.",
		"haley.daily.Sat4": "Next time I go shopping, you can come if you want. I'll help you find some nice clothes to wear when you're not working.",
		"haley.daily.Sun4": "Do you have any siblings? Hmm... I'm not sure if it's better to have them or to be an only child, Emily and I don't have much in common so we really don't do anything together.",
		"haley.daily.Sun8": "I showed Emily a skirt I saw in a catalog, and she made it for me, she even customized it to the perfect fit!$h#$b#It's actually much better than the retail version. Maybe I'll have her make some more things for me, she could start a boutique.",
		"haley.daily.summer_Mon4": "I'm going to the beach and start working on my tan, there should be some nice shells washing up this season too.$11",
		"haley.daily.summer_Mon8": "I found some books on photography, I've learned a lot about lighting tricks and composition.$11#$e#Well, yes, there are also a lot of pictures, haha!$h.",
		"haley.daily.summer_Tue2": "Do you wear those clothes every day? I guess you're working all the time. Don't you ever take a day off?",
		"haley.daily.summer_Tue4": "$p 47#Hey I found this new tool to open jars with. So you won't need to help me anymore.$h|There's not a cloud in the sky today. I think I'll spend some time at the beach and take some photos.$h",
		"haley.daily.summer_Tue8": "I actually enjoy living in the country now, I'd really miss the flowers, trees, and waterfalls if I lived in the city.$h#$e#And living here makes trips to the city feel like fun adventures! @, I think I've been hanging out with you too much.$h",
		"haley.daily.summer_Wed4": "It's so hot today!#$e#I wish I had some ice cream.$s#$b#Are you going to the stand? If Alex isn't there, we'll have to go tomorrow.",
		"haley.daily.summer_Thu4": "If you stay in the sun a lot it'll make your hair lighter.#$e#It's a good thing to know! Be sure to use conditioner though, or the ends will dry out.",
		"haley.daily.summer_Thu6": "If you stay in the sun a lot it will give your hair natural highlights... But you don't want to get sunburnt, either.#$e#I'm cutting back on my sun exposure and using sunscreen. Everything in moderation, right?",
		"haley.daily.summer_Fri4": "I spent 3 hours practicing my signature today.#$e#I guess that's pretty silly, huh? I just want it to look nice when I sign my photo prints.",
		"haley.daily.summer_Sun4": "I'm trying to do some of the work around the house, it's just so boring and I hate ruining my nails. I guess I could try cooking more, do you know any good recipes?",
		"haley.daily.summer_Sat6": "It seems like a good day to go swimming. Are you heading to the beach? I bet you have nice swimming spots in the rivers near your farm too.",
		"haley.daily.fall_Mon6": "The fall leaves are really pretty in the trees, but they sure do make a mess. Sometimes Sam rakes our yard when he does his, it's nice of him to help.",
		"haley.daily.fall_Tue4": "Something smells earthy...#$b#Oh, right. You work on a farm. I guess it's not a terrible smell, better than the tide pool water anyway.",
		"haley.daily.fall_Tue8": "I'm starting to like the smell of dirt. Isn't that weird? I think it's because you're around all the time.#$e#If you're growing flowers, maybe I'll stop by so you can show me, and we can go on a picnic or something.$h",
		"haley.daily.fall_Wed4": "If you're ever bored, come say hi. There's not much going on here, but I can show you my latest photos and maybe look through some magazines.",
		"haley.daily.fall_Wed6": "The light was shining through the fall leaves on the trees by our house this morning and I got some really great pictures.#$e#Maybe I'll show Gunther at the museum if they come out nice. He likes photos.",
		"haley.daily.fall_Thu4": "I feel the urge to go shopping. *sigh*#$e#When the seasons change, I really want to do something new, or at least have something new to wear.",
		"haley.daily.fall_Thu8": "Shopping just doesn't sound as fun as it used to.#$e#What's happening to me? Now things like walking in the forest or hanging out with friends sound much more fun.$h",
		"haley.daily.fall_Fri4": "Is that a grass stain on your knee?#$e#Sorry, I'm allergic to grass, it makes my eyes itch.",
		"haley.daily.fall_Fri6": "You look like you've been doing a lot of hard work.#$b#Why don't you take the rest of the day off? We could see what Sam and Abby are doing, maybe go to the saloon?$h",
		"haley.daily.fall_Sun6": "I've never been deep in the forest, just the edges by the river. It's muddy and I could get a blister on my foot.#$e#I'd have to get forest-exploring clothes and boots. I wonder if they make cute hiking boots?",
		"haley.daily.fall_Sun8": "It might be fun to explore deep in the forest, I found some cute hiking boots and want to try them out.#$e#Do you want to come with me? We could bring a picnic.$h",
		"haley.daily.winter_Mon6": "I'd like to go somewhere warmer for a long vacation.#$e#Maybe when I become a famous photographer, I can spend months visiting tropical locations, taking travel photos.$h",
		"haley.daily.winter_Mon8": "I wish it were warmer here in Stardew Valley, I like living here but the winters aren't fun when it's so cold.#$e#I suppose I could learn to knit and make cute scarves... hmmm...",
		"haley.daily.winter_Tue6": "So. Not much to do on the farm in winter, right? Are you going mining or something?#$e#It sounds scary, but it's kind of cool that you can fight off monsters.",
		"haley.daily.winter_Tue8": "Hi @, are you keeping busy? If you go to the mines, be sure to tell me any exciting stories about fighting monsters!",
		"haley.daily.winter_Wed6": "I wish there was good peppermint coffee around here.$s#$e#I've only gotten good coffee at Zuzu City. If you ever figure out how to make coffee drinks, maybe I'll try one.",
		"haley.daily.winter_Wed8": "I think I'm starting to realize there's a lot more to life than fashion and popularity.#$e#I still like expressing myself with clothes, but spending time with friends is much more fun than shopping alone.",
		"haley.daily.winter_Thu8": "I'm going to start writing a list of all the clothes I'd like to get for next spring.#$e#I don't just buy everything though, I check what I have first and sometimes Emily makes some cute things for me.",
		"haley.daily.winter_Fri6": "Do you have a pony on your farm?$h#$e#You really should get one. Ponies are so cute, and you can style their mane and tail.$h",
		"haley.daily.winter_Fri8": "I'm usually not too excited about farm animals, but maybe I'd like to ride a horse someday. Or if you have bunnies, could I visit them?#$e#If I had a pet, I think it would be a bunny. They're so soft and cute!$h",
		"haley.daily.winter_Sat8": "I'm glad you have less work to do in the winter, it's fun getting together with everyone and just watching movies or playing games.#$e#It must be nice to have a break, huh?",
		"haley.daily.winter_Sun6": "I'm going to try getting winter waterfall pictures, sometimes it's hard to get good shots when the snow is so white, but it's so pretty I have to try.",
		"haley.daily.winter_Sun8": "I'm glad I have fluffy earmuffs and a scarf, it gets so cold! The snow is beautiful though.#$e#Especially when there are little animal tracks in it, like bunnies and squirrels. Have you seen any deer? Sometimes I see their tracks but I've never seen one.",
		"haley.daily.fall_1": "It's fall already?$s#$b#*sighs* I wish summer lasted longer, I'm always sad when it's gone.",
		"haley.daily.winter_9": "Hmm... What brand is your shirt?#$e#Well, I guess brands aren't that important. It's the cut and fit that really matters.",
		//Haley reactions
		"haley.reaction.dating_Sebastian": "You got together with that emo recluse guy, huh? I mean, he's kinda cute in the right light...#$b#Ok I'll admit, when I first met you, I was a tiny bit concerned I might have some competition for Alex, but luckily it didn't turn out like that.$h",
		"haley.reaction.married_Sebastian": "The wedding was fun, I got to wear a new dress and I think Alex noticed.$h#$b#Oh yeah, I hope you and Sebastian are really happy together. You looked great by the way.#$b#Oh, Abby helped do your makeup? She has skills, maybe I'll talk to her and get some ideas for a fresh look.",
		"haley.reaction.dating_Sam": "You got together with that skateboarding music nerd, huh? I mean, he's kinda cute in the right light...#$b#Ok I'll admit, when I first met you, I was a tiny bit concerned I might have some competition for Alex, but luckily it didn't turn out like that.$h",
		"haley.reaction.married_Sam": "The wedding was fun, I got to wear a new dress and I think Alex noticed.$h#$b#Oh yeah, I hope you and Sam are really happy together. You looked great by the way.#$b#Oh, Abby helped do your makeup? She has skills, maybe I'll talk to her and get some ideas for a fresh look.",
		"haley.reaction.dating_Alex": "@! Heehee! I gotta know the whole story, Alex told me he was finally going to ask you out, so what did he say?$h#$b#Oooooh! That's so cute! He really kept it together and pulled it off, I'm so proud of him!#$b#Okay, okay, so what happened after that? Don't leave out any juicy bits!$11",
		"haley.reaction.married_Alex": "Your wedding was GORGEOUS!! Oh my god, I was crying like a baby. Don't worry, I got all the pictures.$h#$b#Thanks for letting me do your hair and makeup, you looked awesome and the pictures will be perfect!$11",

//HARVEY
		"harvey.reaction.dating_Sebastian": "@, if you don't mind my saying, I'm really proud of Sebastian and happy for you both.$h#$b#I've known Sebastian for a long time and I've never seen him looking this healthy and happy. You are good for each other.$h",
		"harvey.reaction.married_Sebastian": "I'm glad to see how everything worked out for you and Sebastian, take care of each other, and remember I'm here if you ever need anything.",
		"harvey.reaction.dating_Sam": "@, if you don't mind my saying, I'm really proud of Sam and happy for you both.$h#$b#I've known Sam for a long time and I've never seen him looking this centered and happy. You are good for each other.$h#$b#I've seen how you take care of him whenever he needs to come to the clinic, it's very sweet if you don't mind my saying, heh!$h",
		"harvey.reaction.married_Sam": "I'm glad to see how everything worked out for you and Sam.$h#$b#Take care of each other, and remember I'm here if you ever need anything.#$b#I was thinking back on the time you brought Sam to the clinic for stitches.#$b#I could tell then that you two were destined to be together, I've never seen two people so connected as friends.$h",
		"harvey.reaction.dating_Alex": "@, if you don't mind my saying, I'm really proud of Alex and happy for you both.$h#$b#I've been helping Alex with some career paths, he's very talented and I sincerely hope he continues working toward a career in health.$h",
		"harvey.reaction.married_Alex": "Be sure to let Alex know I'm here for both of you, as an advisor and a friend. You can come to me any time, my door is always open for you.",

//JODI
		"jodi.special.introduction": "Oh! You aren't exactly how I imagined... but that's okay! I'm Jodi.#$b#Sam and Vincent are my two boys. You look to be about Sam's age, he'll appreciate having more young people around.#$b#This is a quiet little town, so it's very exciting when someone new moves in! Getting that old farm up and running could really change things.",
		"jodi.daily.Mon": "Maintaining a household is difficult work... but somebody has to do it.#$e#Yes? Is there anything you need? If you're looking for Sam, he's probably out with Sebastian or Penny.",
		"jodi.daily.Mon4": "I took a little time yesterday afternoon and spent a few minutes just standing by the river and listening to the sound.#$b#I might have some ideas for a few poetry verses.#$e#Oh nothing I'd want to share yet, I'd be too embarrassed! Maybe someday if I can really get my style back.",
		"jodi.daily.Mon6": "It's nice to have a family... but I'd be lying if I said I never miss the freedom of being young...$s#$b#I know it's one of those 'grass is greener' kinds of things, a lot of freedom can be lonely too.",
		"jodi.daily.Tue": "Exercise is important for staying healthy, I always make sure to set aside some time for it.#$b#You get plenty of exercise just doing your daily work, that's one less thing you have to worry about.#$e#As a parent, I don't have much time to devote to myself. So I try and make every minute count.",
		"jodi.daily.Wed": "What did you say? It's %time already? My goodness!#$e#I still have so much work to do!$s#$b#Hmm I wonder what it would be like to have one of those robot vacuums...",
		"jodi.daily.Wed2": "What do I do for fun? Hmm... That's a good question.#$e#I like sleeping.$s#$b#I did write poetry before the boys came along, I suppose that's where Sam gets his lyric-writing talent.",
		"jodi.daily.Wed4": "A while ago, you asked me what I do for fun and it got me thinking, maybe I should try writing poetry again.#$e#Sam is basically grown and Vince is in school so I do have a little time for myself in the early afternoons.#$b#*smiles* Thank you for the inspiration, @.",
		"jodi.daily.Wed6": "I've taken some of your advice and am going outside for breaks during the day. It's very nice!#$e#I do wish I could afford a dishwasher, but menial tasks like washing dishes aren't so bad.#$e#It gives me time to think about things. Then if I come up with anything interesting, I write it down.#$b#Sometimes I even think of poems, those are good days!$h",
		"jodi.daily.Thu": "How are things going on the farm? It must be interesting work.#$e#I've never met a farmer before, I'm rather surprised you'd leave the city to come here and start a new life.#$b#Maybe someday you can teach me how to grow vegetables.$h",
		"jodi.daily.Thu4": "Do you have any fun stories from the farm? It must be exciting with animals and everything.#$b#Sam has been talking about it quite a lot, he seems to suddenly be very interested in farm work, haha!$h",
		"jodi.daily.Thu6": "Where does all the time go? *sighs*#$e#I remember when Sam was a little baby wearing diapers. He was such a cute little kid.$s#$e#Don't tell him I said that, he'd be so embarrassed! Heehee!",
		"jodi.daily.Fri2": "Are you getting all your work done by yourself? It seems like it would be kind of lonely with only you on that big old farm.#$b#Though the peace and quiet would be nice, now that I'm thinking about it.",
		"jodi.daily.Sat": "Hi, @... how are you?#$e#Sam mentioned inviting you to join him and Sebastian for band practice. I'm glad you're making friends!#$e#Need something?",
		"jodi.daily.Sat2": "Did you come by for band practice? Sam and Sebastian have both mentioned you quite often lately.#$b#They seem very impressed that you can play the harp. I think they're hoping you'll help them with backup instruments.$h",
		"jodi.daily.Sat4": "I'm so glad you're trying to improve that old farm.#$e#Once you've got everything in order, it's going to add a lot to our community!$h#$e#It's going to be a lot of work for you, though.#$b#There are quite a few young people in town, maybe you could recruit some of them to help.",
		"jodi.daily.Sun": "I'm taking a break from house chores today.$h#$e#I really love getting fresh air once in a while, if I don't spend any time outside, I'll go crazy!#$b#There are a lot of beautiful places to walk around town, it's very relaxing.",
		"jodi.daily.Sun8": "I had a dream that I had complete freedom, no obligation to anyone but myself...#$b#...Then I woke up and realized I had a full day of house chores ahead of me... *sighs*$s#$e#Oh, don't misunderstand, I don't regret having a family, @... Sam and Vincent mean everything to me!#$b#Life would be very dull without them.",
		"jodi.daily.spring_Mon8": "Ah, spring always feels like a fresh start, everything is starting to grow again but the real work of summer and fall hasn't started yet.#$b#I think I'll take this chance to work on my poems a bit more.#$b#Sam says I should send some to a publisher, heehee!$h#$b#I don't know about that, but it's nice he likes them.",
		"jodi.daily.spring_Tue8": "Forgive my curiosity, but do you hope to have a big family?#$b#Raising kids on a farm would be challenging but also exciting I would think.$h",
		"jodi.daily.spring_Thu8": "Today feels like a good day for sipping tea and daydreaming, don't you think?#$b#There are chores to be done first of course, but I will definitely take a few minutes for contemplation today.",
		"jodi.daily.spring_Fri8": "Vince is so excited the weather is warmer and he can play without his hat and mittens.#$b#I'm happy about that too since I won't need to track down missing accessories... until summer, then it's the shoes and socks. *sighs*",
		"jodi.daily.spring_Sat8": "@! Oh, if you have a moment, would you help me track down my youngest? He's around here somewhere...#$e#%You see Vince's hair poking up from behind a bush and sneak around the back to scare him. He pops up laughing...#$b#Hmmm that child will send me to an early grave. Thanks for flushing him out, he'll do anything to avoid homework.",
		"jodi.daily.summer_Mon": "Summer is nice, but it can also get very busy.#$e#I like having a garden, so I spend time tending that along with the usual housework.#$b#I do appreciate the opportunity to work outside though!",
		"jodi.daily.summer_Mon4": "Oh dear, this summer heat can really get to you!#$b#Be sure you're drinking enough water and put on sunscreen, you don't want a nasty burn!#$b#OH! @, I'm sorry, I just started talking to you like I do my boys, hehe! Don't mind me, but do take care of yourself.",
		"jodi.daily.summer_Mon8": "What are you up to this summer? Any exciting new additions to the farm?#$b#Be sure to come by, Vince loves your stories about the farm.$h",
		"jodi.daily.summer_Tue": "Hello.#$e#It's a very busy day for me today, can we chat another time? Thanks and have a good day, @!",
		"jodi.daily.summer_Tue8": "It's nice to see you out on this beautiful sunny day! Are you heading to the beach?#$b#Thank you for taking Vince out to play in the sand the other day, he still hasn't stopped talking about the giant sand zoo you built together.$h",
		"jodi.daily.summer_Wed4": "Hmm ice cream sure sounds good right about now... of course, it would defeat all the exercise I've already done today.#$b#Well, I think I deserve a little treat.#$b#Have you been over to the ice cream stand? They have some new flavors that just came in.$h",
		"jodi.daily.summer_Thu": "Housework is frustrating because you're never finished, it's an endless cycle.#$e#The day after I sweep the floor, it's dirty again.#$b#Having two boys really adds to the dirt I think!",
		"jodi.daily.summer_Thu8": "Vince came home soaking wet, he said he got too close to the water and a wave caught him.#$b#That child, I suppose if Sam survived to adulthood, Vince will too but if I ever have another child, I pray they will be quiet and thoughtful!",
		"jodi.daily.summer_Sat4": "Do you have plans for the weekend, @? It seems that farm life and parenting are both round the clock jobs with no days off.#$b#Ah well, both lifestyles have their rewards too.#$b#If you happen to see my boys, remind them not to be late for dinner!",
		"jodi.daily.summer_Sat8": "Are you feeling confident about the fair next month? I'm sure your display will be wonderful.#$e#Mayor Lewis mentioned several people have approached him asking to have an art display at the fair.#$b#Then Leah could show some of her new projects and Elliott and I could share some of our writing.#$b#Others have also mentioned wanting to display their crafts.#$b#It sounds fun, but a little intimidating to be honest!",
		"jodi.daily.summer_Sun": "What in the world am I going to make for dinner?#$e#*sighs* Vince always complains about healthy food, but that's not surprising since he's a little boy.#$b#If he had his way, it would be cake for dinner every night, haha!$h#$b#Sam eats nearly anything, sometimes I wonder if he's ever full!",
		"jodi.daily.summer_Sun4": "Have you tried the Sunday services here? I'm sure it's similar to where you're from.#$b#Attending lets me focus on something outside my personal life so I can relax and feel refreshed for the coming week.#$b#It's similar to meditation that way.",
		"jodi.daily.fall_Mon4": "I should count my blessings more often, we have a good life here. There is so much beauty right out our front door.#$b#One of my favorite things is listening to the river at night, it's so peaceful. Like a lullaby singing me to sleep.$h",
		"jodi.daily.fall_Mon6": "Have you been listening to the boys' music lately? They seem to have found their focus.#$b#I do like hearing the new songs, especially when they play acoustic.",
		"jodi.daily.fall_Mon8": "Ah, I'm feeling sentimental today. Kent would take me out on fun dates when we were a young couple.$h#$b#I really want to get back to that life someday, maybe when Vince is older and there is less to do around the house.",
		"jodi.daily.fall_Wed6.1": "Phew, fall can get exhausting with all the work that needs to be done.",
		"jodi.daily.fall_Wed6.2": "How are you managing on the farm?",
		"jodi.daily.fall_Wed6.3": "Everything is under control, join me for a walk?",
		"jodi.daily.fall_Wed6.4": "Oh, I'd love to, thank you! Just getting out of the house and taking a quick turn around town is so nice, maybe you can tell me your secret!$h",
		"jodi.daily.fall_Wed6.5": "It's overwhelming, want to take a quick break?",
		"jodi.daily.fall_Wed6.6": "Oh, I'd love to! Let's go for a short walk and maybe get an iced tea from the saloon and you can tell me about it.",
		"jodi.daily.fall_Thu8": "The fall leaves are beautiful, but I'm really looking forward to the peace of winter.#$b#It's a nice break for you as well, isn't it?#$b#Feel free to stop by any time, I always have something you can help with, heehee!$h",
		"jodi.daily.fall_Fri8": "Are you meeting the group at the saloon tonight? I'm so glad Sam has such a good group of friends.#$b#I was concerned when we first moved here since there aren't a lot of people living in this area, but luckily there were several kids Sam's age.#$b#I do wish there were more younger ones for Vince to play with, Jas is wonderful but I'm sure they would both like more friends.",
		"jodi.daily.fall_Sat8": "Be sure to ask Sam if you need help around the farm this season.#$b#He has plenty of time to help you along with playing his music.#$b#Sharing the work makes things much easier I would think.",
		"jodi.daily.winter_Mon6": "Hi @, I'm glad to see you've made friends around town.$h#$b#Having a strong friend network is important, I wish I could spend more time with my friends when things get hectic around here.",
		"jodi.daily.winter_Mon8": "$d kent#I often wonder what Kent will do for work when he comes home. It worries me that he won't have anything to do and will want to move back to the city.|Do you need more help on the farm? I wonder if Kent would enjoy that kind of work.#$e#He likes having something to keep his hands busy and mind occupied, it helps when he's not feeling well.",
		"jodi.daily.winter_Tue6": "Sometimes when it's been a rough day, I wonder what it would be like to live alone without a family to look after. Is that horrible?$s#$e#I know it's just the exhaustion talking. I do appreciate you encouraging me to take time for myself. It does help.",
		"jodi.daily.winter_Wed6": "Sam has been so excited about creating music videos for the band.#$b#I watched some of the videos and they look very good! It's nice kids can show off their music for people to watch.",
		"jodi.daily.winter_Thu8": "Hmm I was just thinking back, Kent and I kind of rushed into our marriage, with Kent being a soldier and all...#$b#I hardly got a taste of youth and freedom, and now it's too late to ever go back.$s#$e#I'm sorry, I guess I'm feeling a little down today. Would you mind sitting and chatting with me for a while?#$b#I do enjoy your company. I'll make us some hot cider to stay warm.[223]",
		"jodi.daily.winter_Fri6": "Hello! Vince was just wondering where you were, I think he's hoping you'll help him build a snow palace or something like that.$h#$b#If you do take him out, make sure he comes home with both his mittens and his hat, I keep finding them strewn about town.",
		"jodi.daily.winter_Sat6": "Oh my, you look completely frozen! Come let me get you a hot tea.#$b#That's better, you should have a warmer jacket and a nice woolly hat, you don't want to get frostbite![614]",
		"jodi.daily.winter_Sat8": "Oh it's good to see you! I've been devoting an hour a day to my poetry.#$b#I'm starting to feel more confident, maybe I'll have a book printed someday for the family and anyone else who would like one.$h",
		"jodi.daily.winter_Sun6": "Sometimes I like to stand at the window and just watch the snow fall... Oh, where's my pen? I just had an idea for a short poem...$h#$b#I like to keep this notebook handy, you never know when inspiration will strike.",
		"jodi.daily.winter_Wed4_2": "Kent has been home for a while now, but he still seems uneasy.#$b#I knew it would be a difficult transition for him but I suppose I really had no idea how hard the war would be on his psyche.$s",
		"jodi.reaction.dating_Sam_memory_oneday": "I hope I don't sound too controlling about my son, he's just very important to me.#$b#I am glad to see him so happy, I do hope things work out between you.$h#$b#Kent and I were very young when we married and sometimes I feel that we missed out on things since we rushed. I don't want Sam to have regrets like that.",
		"jodi.reaction.married_Sam": "I'm so happy for you and Sam. You two compliment each other very well!#$e#I never thought I'd say it... but I'll miss all the noise from Sam's band practice and, well, his general high volume...#$b#The house will be very quiet without him there.$s",
		"jodi.daily.fallThu_inlaw_Sam": "Is Sam just bumming around the farm, or is he contributing?#$b#Oh, that's good to hear! I'm glad he's finding ways to help out.#$b#He loves the animals? That's good.#$b#Sam always wanted a pet, but I didn't want an animal in the house adding to the mess.",
		"jodi.daily.summerTue_inlaw_Sam": "How's my little Sammy doing on the old farm?$h#$b#I hope he's learning how to help out and not just play music all day!",
		"jodi.daily.winterThu_inlaw_Sam": "How's Sam doing? I have to admit, there's less cooking and cleaning to do since he moved out.#$b#Boys can be so much work to take care of!#$b#How are you doing with him...? Oh! He cooks breakfast and cleans up after himself? That's wonderful!",
		"jodi.reaction.dating_Sebastian": "Oh, I heard you're dating Sam's friend, Sebastian.$h#$b#He's always been a very quiet boy but he has a good heart. I wish only happiness for you both.",
		"jodi.reaction.married_Sebastian": "Hi @, it's nice to see you. The wedding was wonderful, I'm so pleased for you and Sebastian.$h#$b#Sam and Seb have been friends since they were little, I only hope Sam will find someone like you when he's ready.",
		"jodi.reaction.dating_Alex": "Oh, I heard you're dating Sammy's friend, Alex.$h#$b#He's a nice boy, always happy to deliver goodies from Evelyn. I wish only happiness for you both.",
		"jodi.reaction.married_Alex": "Hi @, it's nice to see you. The wedding was wonderful, I'm so pleased for you and Alex.$h#$b#Alex is a very lucky young man, I only hope Sam will find someone like you when he's ready.",
		"jodi.reaction.GreenRain": "Are you alright? We've never seen anything like this before...$s#$b#I wish my husband was here. It's at times like this I miss him the most.$s#$b#Not that I can't handle this myself, but I miss his companionship and strength.",
		"jodi.reaction.GreenRain_2": "Vincent got up early to go play in the rain. I just hope they're right about it being completely harmless!#$b#If you happen to see him, would you check that he's okay? Thanks so much!",
		"jodi.eventseen.94": "Thanks again for bringing that fish! It was some of the best we've had in a while.#$b#And thanks for joining us for dinner, it was nice having more people at the table. I hope you can join us more often in the future!",
		"jodi.eventseen.3910975": "*whispers* Did you hear about Shane? That's so terrible... I hope he's doing okay.$s#$b#When you see Sam, would you ask how he's doing? There was an incident a couple years ago...#$b#Oh, I'll let him tell you about that if he wants.$s",
		"jodi.reaction.pamHouseUpgrade": "Wow... I heard what you did for Pam... Boy, I wonder what she did to get in your good graces like that?$s#$e#...I wish I had that kind of money to-$s#$b#Oh, I'm sorry, that wasn't very nice. I'm not upset you did that for Pam, she has had a difficult life and she deserves a break.#$b#I'm just a little stressed about finances sometimes, I didn't mean to take it out on you.$s",
		"jodi.eventseen.101": "Poor Clint... they say he's head-over-heels for Emily, but I've heard she only thinks of him as a friend.#$b#He is a little old for her, I hope he can move on and maybe find someone who appreciates him for who he is.#$b#I know I sometimes complain a bit about my life, but I'm very happy I found Kent.",
		"jodi.eventseen.58": "I've been doing aerobics class with the ladies every week...#$b#Recently, someone new joined the class, but he made us all swear we wouldn't reveal his identity, heehee!$h#$b#It's made the class more interesting for sure!$h",

//KENT
		"kent.daily.Mon": "Hello, @.#$b#I feel like I know you at least a little already, Sam mentioned you quite often in his letters, with quite a bit of embellishment, I'm sure.",
		"kent.daily.Mon4": "I don't know if I'll ever get used to being back home.#$e#The peacefulness of the town feels like a mask. Hmm. I know it's just my impressions.#$b#If you need work done at the farm, let me know.#$b#I want to help, to feel useful again.",
		"kent.daily.Tue": "Things haven't changed much since I've been gone. This town is strange that way, it feels that in a few hundred years, this town will still be exactly the same.#$e#Different people, but the same.#$b#Thanks for listening.",
		"kent.daily.Tue2": "Things haven't changed much since I've been gone. This town is strange that way, it feels that in a few hundred years, this town will still be exactly the same.#$b#Different people, but the same.#$b#Thanks for listening, the younger people here give me hope.",
		"kent.daily.Tue6": "I feel like I'm settling back in pretty well. It's nice to have a friend in town.$h#$b#How are things? Vincent was going on and on about the last time you took him for a picnic, mind if I come along next time?#$b#I want to start making up for lost time with my little boy.",
		"kent.daily.Wed": "*sighs* Sorry, @, I won't be good company today. I had a rough night.#$b#I'll see you later.",
		"kent.daily.Wed4": "You've been here a while now, haven't you? Your farm looks like it's thriving.$h",
		"kent.daily.Wed8": "To be alive is a special gift, and it comes and goes in the blink of an eye... never lose sight of that.#$e#Hmm... you know, I used to be a lot like Sam when I was young, full of life and excitement.#$b#I'm sorry @, I still have good days and bad ones, and this seems to be the latter.#$b#Thanks for listening, even when I'm having a hard time seeing anything positive.$s",
		"kent.daily.Thu4": "Thank you for being patient with me and always stopping to chat.#$b#I know I'm not much fun to talk to right now, but seeing you gives me hope.",
		"kent.daily.Thu8": "Seeing the young people all growing up reminds me of when Jodi and I were young, the excitement and passion.$h#$e#Hang on to that @, it can easily fade. Yeah, it takes work to maintain, but it's worth the effort, believe me!",
		"kent.daily.Fri": "It looks like a decent day for fishing, doesn't it?#$b#If you don't mind, I'd like to join you sometime. It's nice to just sit quietly and listen to nature.#$e#And you could catch me up on what's happened around town over the past year.",
		"kent.daily.Fri4": "When you have time, would you mind showing me some of the work you do around the farm?#$b#Keeping busy is helpful, and I want to contribute to the community.#$b#And my family as well, heh.",
		"kent.daily.Sat": "How do you like living in the valley? Jodi tells me you've really become a part of this community.#$e#I'm sure that wasn't easy... Ah, your friends helped you out? That's good to hear.#$b#My boy has always been very social, his friends are a big part of his life.$h",
		"kent.daily.Sat8": "I still have trouble sleeping, so please excuse me if I seem tired.#$e#I'm sure you can understand. I don't say it often enough, thank you for listening.#$b#It means a lot to know you will listen and not immediately attempt to be sympathetic.#$b#I know people mean well, but that kind of sympathy can come off as patronizing.",
		"kent.daily.Sun": "I don't know what to do with myself now that I'm back.#$b#I'm used to having more structure in my day.#$e#The farm routine sounds interesting, tell me more about that.",
		"kent.daily.Sun4": "You've got a good routine to keep you busy, it's good to have some structure to your day.#$e#I guess I'm the kind of person who likes knowing what I can do at any given time. Freedom is nice, but too much of it can be paralyzing.#$b#Too many possibilities, and it's difficult to make a choice.",
		"kent.daily.spring_Tue8": "Spring is a relaxing time of year in the valley...#$e#I do have some pretty good stories involving Sam sneeze attacks when he was a kid.$h#$b#Join me at the saloon sometime, I'll tell you the best ones.$h",
		"kent.daily.summer_Mon4": "I'd like to rebuild my relationship with Sam. We've talked some, but it's difficult for me to focus.#$b#I'm working on that, talking with him does seem to help me feel more positive.#$b#I know Sam is a little afraid to be open and honest with me, tell him I'm working on my recovery and I'd like to talk when he's ready.",
		"kent.daily.summer_Tue8": "I believe the Moonlight Jellies migration is coming up soon.#$b#I'm looking forward to that, the night is peaceful and calm, everyone is quiet and watching the water...$h#$b#Maybe I'll get away with stealing a kiss from Jodi, heh!$h",
		"kent.daily.summer_Wed4": "I do enjoy listening to Sam's band when they're playing outdoors.#$b#Something about being outside makes loud sounds less difficult for me.",
		"kent.daily.summer_Thu8": "I might have been seeing things, but did my youngest just go running barefoot across the town square?$h#$e#I better go catch that kid before Jodi does, if you happen to get there first, would you haul him home for me?#$b#Ah, I've spotted a shoe...$h",
		"kent.daily.summer_Sat4": "Today was rather interesting, Vince was out playing and apparently fell in a mud puddle.#$b#Then rolled in some grass to get the mud off. After that, he decided I needed a big hug...#$b#It feels like I'm being initiated back into the family dad life, heh.$h#$e#When I looked at that boy all covered in mud and grass, then looked down and saw I had a kid-shaped mud stain on my pants...#$b#I forgot about all the pain and only saw the joy in my son's face. It was an incredible moment.$h",
		"kent.daily.fall_Mon6": "Sam played his latest music set on the acoustic guitar for Jodi and me, it was very good.#$b#His music sound and lyrics have really become cohesive.$h",
		"kent.daily.fall_Mon8": "Jodi hinted about missing going out for fun like we used to.#$b#I think I'll work on that, she deserves fun outings and I do have a lot of lost time to make up for.",
		"kent.daily.fall_Tue6": "I'm learning to appreciate and enjoy my family again.#$b#For a long time, I felt guilty that I was able to come home to my family when so many people I fought alongside would never see theirs again.#$e#I know they wouldn't want me wasting the time I have in sorrow and regret. It's difficult, but I'm getting there.$h",
		"kent.daily.fall_Tue8": "Vince was complaining about being bored, that usually means he's trying to avoid homework.",
		"kent.daily.fall_Wed6": "Hello @, I'm sorry but today is not a good day to chat.#$b#I'm going to take a long walk to clear my head, and hopefully be refreshed enough to rest tonight.#$e#I'll see you soon.",
		"kent.daily.fall_Wed8": "Demetrius was in town today and we got to talking, he's a bit out there sometimes, but an interesting man.",
		"kent.daily.fall_Sat8": "Sam mentioned letting some friends borrow the tent for a camping trip.#$e#I told him that's fine if any of you want to use it, Jodi is not a fan of camping and I'd like to see it get some use.#$b#Maybe I'll take Sam and Vince for a weekend in the wild sometime.",
		"kent.daily.winter_Mon6": "I've been keeping a journal, just writing whatever comes to mind.#$b#Most of it is not pleasant, but someday I'll give it to Sam.#$e#Not that I expect him to read it, but he might want to keep it for future generations.",
		"kent.daily.winter_Mon8": "I spent some time looking back through my journal. It's still not a fun read, but I can see the change over time.#$e#Much of the fatalism has faded, I'm certainly not fully recovered, but seeing the improvements I have made is encouraging.",
		"kent.daily.winter_Tue6": "When I first got home, Jodi seemed very tired and overwhelmed, but she's been much happier and more relaxed lately.#$b#She even showed me some poems she's been writing.$h#$e#It's good to see she's back to writing again, I didn't realize how much I missed that.",
		"kent.daily.winter_Tue8": "Jodi is making her famous fish casserole today, she says she doubles the recipe when I'm home, heh!$h",
		"kent.daily.winter_Thu8": "I sat down with Sam and played a few chords on the guitar. I'm definitely rusty, but maybe I'll get back into it.#$e#Seems like a good way to relax and spend time with my son.",
		"kent.daily.winter_Fri8": "Hello, @, how are you on this frigid winter day?#$b#I will say it's beautiful out, though winter is not my favorite season.#$e#Well, Vince informed me my plans for today involve building a snow fort and snowmen to guard it, heh!$h#$b#Feel free to join us if you have time.$h",
		"kent.daily.winter_Sat8": "@, I have a quick word of advice. Take advantage of every moment with your family. It's impossible to get them back.#$b#And if you do realize you've taken loved ones for granted, make a point of enjoying the moments to come and don't live in regret.",
		"kent.daily.winter_Sun6": "Jodi has mentioned she wonders if she missed out on the fun of being young with no family to care for.#$b#I think she's looking through rose-colored glasses, but I would like to take on more of her responsibilities so she feels less pressure to do everything.#$e#If she mentions it, please encourage her to let some things go. I don't mind the work and I'll do my best.",
		"kent.reaction.dating_Sam": "So I take it Sam finally asked you out?#$b#Hm good. It can be hard for him to take big steps like that, he's afraid of messing up or not meeting expectations.#$b#Jodi and I have always supported and encouraged him, but it's in his nature I guess.#$b#You're good for him, I can already see that.",
		"kent.reaction.married_Sam": "It makes a father proud to see his boy become a man. And Sam couldn't have picked a better partner.$h#$b#He truly loves you, and I'm proud to have you in my family. You have my heartfelt blessing.$h#$b#I only wish I had been there to see my boy fall in love, the stories Jodi has told me are quite entertaining!$h#$b#She might seem overly strict, but I can read between the lines, she really is happy.",
		"kent.daily.winterTue_inlaw_Sam": "Hello! What would you and Sam think about me coming by the farm a few mornings a week and helping with the chores?#$b#I enjoy the work and the routine as well.#$e#... I'll see you in the morning, then.#$b#Don't worry, I won't come knocking too early, I don't want to interrupt the time you and Sam spend together to start the day.$h",
		"kent.daily.summerMon_inlaw_Sam": "I know I've complained about not liking loud noises before, but I do enjoy listening to Sam play his guitar.#$b#He's become quite skilled, I'm glad he has found ways to reach people and make an income using music.#$e#Heh, yeah, I'm a proud dad. I couldn't ask for a better son.$h",
		"kent.daily.Thu_inlaw_Sam": "Hey, @. Are you and Sam enjoying married life?#$e#Heh, at the risk of sounding nosy, I bet Sam loves being with you every night.#$b#He and I are a lot alike, and neither of us enjoys being alone.#$b#To be blunt, while I was gone, I missed Jodi more than I could ever express.#$b#Those lonely nights... I never want to go back to that again. We have a lot to work through, but we're making progress.",
		"kent.reaction.GreenRain_2": "Heh... The rain is a blessing. A reminder that there will always be forces greater than anything conceived of by man.#$b#That's actually a comfort, @.#$b#I heard that Sam was a little freaked out last time this happened, heh.",
		"kent.event.100_memory_oneday": "My apologies for the other day.#$b#I don't want any special treatment. I just want to be a normal person, like everyone else.#$b#@... I'm truly sorry. I don't want to hurt anyone. I know it's hard for Sam to see me like this.#$b#I've started a treatment plan with a therapist, I wanted to do it on my own but it seems that's not possible.#$b#Thank you for being there for Sam, if there's anything you can do to help, I'll let you know.",

//LEWIS
		"lewis.reaction.dating_Sebastian": "Hello, @, I heard about you and Sebastian, congratulations! It seems you're really fitting in here in Pelican Town.$h",
		"lewis.reaction.married_Sebastian": "What did you think of the wedding ceremony? Weddings are one of my favorite events as mayor.$h#$b#I'm proud that you and Sebastian are putting down roots here in the community. I hope you'll make a happy and peaceful life here together.",
		"lewis.reaction.dating_Sam": "Hello, @, I heard about you and Sam, congratulations! It seems you're really fitting in here in Pelican Town.$h",
		"lewis.reaction.married_Sam": "What did you think of the wedding ceremony? Weddings are one of my favorite events as mayor.$h#$b#I'm proud that you and Sam are putting down roots here in the community. I hope you'll make a happy and peaceful life here together.#$b#Maybe build him a skatepark on your farm? Heh...",
		"lewis.reaction.dating_Alex": "Hello, @, I heard about you and Alex, congratulations! It seems you're really fitting in here in Pelican Town.$h",
		"lewis.reaction.married_Alex": "What did you think of the wedding ceremony? Weddings are one of my favorite events as mayor.$h#$b#I'm proud that you and Alex are putting down roots here in the community. I hope you'll make a happy and peaceful life here together.",

//MARNIE
		"marnie.reaction.dating_Sebastian": "Hi @, I heard you and Sebastian are going out, that's great!$h#$b#Shane occasionally mentions Sebastian, but he doesn't know him very well. Sebastian seems to be a good kid, maybe a little withdrawn, but I can tell he cares a lot about his mom and her work.$h",
		"marnie.reaction.married_Sebastian": "Oh, your wedding was so pretty! Sebastian did a wonderful job with the personal touches.$h#$b#Will you be expanding the farm now that you have some help? I have plenty of animals in need of good homes!",
		"marnie.reaction.dating_Sam": "Hi @, I heard you and Sam are going out, that's great!$h#$b#Shane works with Sam, but I don't think they interact much. Sam is a good kid, maybe a little overly energetic, but very friendly and kind!$h",
		"marnie.reaction.married_Sam": "Oh, your wedding was so pretty! Sam did a wonderful job with the personal touches.$h#$b#Will you be expanding the farm now that you have some help? I have plenty of animals looking for good homes!",
		"marnie.reaction.dating_Alex": "Hi @, I heard you and Alex are going out, that's great!$h#$b#Shane and Alex hang out at the ranch sometimes, they like to toss the gridball and talk about the teams and games. It's good for Shane to have positive friends like Alex.$h",
		"marnie.reaction.married_Alex": "Oh, your wedding was so pretty! Alex did a wonderful job with the personal touches. It must be nice having a hard worker like him on the farm!$h#$b#Will you be expanding the farm now that you have some help? I have plenty of animals in need of good homes!",

//MARU
		"maru.special.Introduction": "Oh! Aren't you the one who just moved to that old farm?#$b#I'm Maru. I've been looking forward to meeting you! We don't get new people in town often.$h#$b#It'll be exciting to see how the community dynamic changes now that you're here.$h#$b#Oh, have you met my brother, Sebastian, yet? He might not say much but he'll be glad you introduced yourself.",
		"maru.daily.Mon": "Whenever I'm struggling with a technical problem, I like to take a walk.#$b#The lake has some beautiful walking trails, and the path through the woods to your farm is always nice. I often find forageables there!$h.",
		"maru.daily.Mon4": "Hi @! How are you enjoying having nature at your doorstep? I love living here, there are so many opportunities for research.#$e#... It doesn't seem like robotics and nature go together? Hehe! Yeah it might sound conflicting at first.#$b#I create inventions that help support our environment like irrigation systems that are not disruptive to the local wildlife.$h",
		"maru.daily.Mon6": "Sometimes I start thinking about too many things at once and I have to clear my head before I can do anything useful. Does that ever happen to you?#$b#Getting some fresh air and taking a moment to really absorb nature usually helps.",
		"maru.daily.Tue": "Have you met my mom, Robin? She's the town's carpenter and I'm sure you'll need her help fixing up the farm buildings.#$e#She also loves chatting with everyone so you can find out what's going on around town when you talk to her, heehee!$h",
		"maru.daily.Tue2": "Don't forget to check in with my mom when you're ready for building upgrades, she loves helping you out.$h#$e#I've noticed your farm is already looking better, I love how you're keeping nature and machines in balance.",
		"maru.daily.Tue4": "Hi @! How have you been? My latest experiment has been going very well.#$b#I've set up camera traps around the area to monitor how the wildlife is responding to my irrigation system, and all the results have been positive!$h",
		"maru.daily.Wed": "On Tuesdays and Thursdays I work at Harvey's clinic.#$b#He says he likes having me around in case his medical equipment goes haywire!$h#$e#Being a farmer must be very different from what I do, huh?",
		"maru.daily.Wed4": "You know, with all the machines on your farm, I bet you're becoming quite a mechanic, haha!$h#$b#Is everything running smoothly? Be sure to let me know if you want any help with machine upgrades.",
		"maru.daily.Wed6": "@, I wanted to say I'm glad you always talk to me when you come by, I really enjoy our conversations.#$e#Sebastian's other friends see me only has his little sister, but you took the time to be my friend. Thank you!$h#$b#I hope we all stay close.",
		"maru.daily.Wed8": "I'm glad to have a job at the clinic... I like contributing to the community and helping people.#$e#Dr. Harvey? He's nice, he can be kind of quiet at first but he's very interesting if you get him going on one of his favorite topics.",
		"maru.daily.Thu": "Have you seen the telescope by our house? I like to spend time looking at the stars at night.#$b#It's calming and peaceful, and the night sky is so incredible here.",
		"maru.daily.Thu4": "Sometimes, when I'm looking into space with my telescope, I get struck with this eerie feeling... Like what if someone is doing the same on another planet?#$e#We could be looking at the same star and never know it.$h",
		"maru.daily.Fri": "Hey, sorry if I seem a little out of sorts... I'm a little sore from work yesterday.#$c .5# I had to carry ten boxes of medical files to the attic! It was quite the leg workout.#$b#I had to sort patient records for four hours straight and my back has not forgiven me!",
		"maru.daily.Fri4": "Since our mom is a carpenter and my dad is a scientist, everyone expects me and Sebastian to be genius engineers or inventors.#$e#I guess my work in robotics fits in with that... Sebastian is extremely intelligent, sometimes eerily so, but he never was interested in attending university.#$b#Even though Seb's great at computer science, my dad has trouble connecting with him.",
		"maru.daily.Fri6": "The dynamic between my parents can be very entertaining, my Dad is logical, and my Mom is intuitive.#$e#Even though they often don't understand each other, they always work things out and they are very close.",
		"maru.daily.Sat": "Do you know my Dad, Demetrius? He's a scientist. I have a lot of fun helping him out in the laboratory.#$e#He's really friendly, but talks like an academic so a lot of people don't really understand him.",
		"maru.daily.Sat2": "Have you found any useful materials on your farm? It's really satisfying when you can repair something yourself, instead of just throwing it away.#$e#Resources can be hard to get here, especially anything that has to be shipped in so take advantage of anything you can find.",
		"maru.daily.Sat4": "Even though most things people consider to be magic can be explained by science, it doesn't make it any less magical.#$e#I find magnetism, atoms, and the principles of physics have their own kind of magic, they never cease to amaze me!$h",
		"maru.daily.Sat6": "Farming and science definitely have a lot in common, they compliment each other. My inventions can make farming more efficient and minimize any impact on the local environment.$h",
		"maru.daily.Sat8": "You know, I was thinking... even with all the technology in the world, nothing beats having a real human friend.#$e#Thanks for being such an amazing friend, @.",
		"maru.daily.Sun4": "Hi! How are you getting along with everyone in town? Some people are more easygoing than others, that's for sure.$h",
		"maru.daily.spring_Fri2": "Hi @! Are you interested in robotics? I think there could be a lot of applications for your farm.#$e#Let me know if there's anything you want me to research for you!$h",
		"maru.daily.summer_Mon4": "Hi! How are you? I have quite a few tests going for my current project. All are showing good results so far.#$e#Except for that little surveillance bot I still can't find... If you happen to see a little bot with a tiny camera, let me know!$h",
		"maru.daily.summer_Mon6": "Come visit me in my room if you ever want to tinker with my gadgets, my door is always open to you!$h#$b#Everyone in my family loves having you here.$h",
		"maru.daily.summer_Tue": "Sebastian is my half-brother, if you didn't know already.#$e#We look totally different, but I guess that makes sense. Do you know much about genetics? It might come in handy rasing animals, so let me know if you need any help.",
		"maru.daily.summer_Tue4": "Have you talked to my brother yet today? He was asking about you earlier.#$e#You know, I have a couple of good stories about him from when we were kids, want to hear them sometime?$h",
		"maru.daily.summer_Tue8": "@, you're looking sharp today, the farm life must be treating you well.$h#$e#If you have time, we could go take a farm tour, I like talking with you.$h",
		"maru.daily.summer_Wed4": "Penny and I have been doing a seasonal book club.#$b#It's just the two of us, but it's still fun to discuss what we're reading! Penny and I like similar genres so that helps too.",
		"maru.daily.summer_Wed6": "Hi @, can I borrow your hand? I have this new gadget I want to test on someone with different hands from mine.#$b#%Maru slips a leather glove on your hand, it has some wires and straps connected to it. ZAP!!#$b#Oh! Sorry about that, it's not enough electricity to be harmful but... heh, you're hair is all standing on end!",
		"maru.daily.summer_Thu4": "I'm starting to recognize your footsteps so I know right away when you're here.$h#$b#Thanks for stopping to chat when you come by.",
		"maru.daily.summer_Fri": "I worked at the clinic yesterday. We didn't have a single patient.#$b#I guess people get sick less during summer, certainly not a bad thing!",
		"maru.daily.summer_Fri2": "Hey, tell me a story about farming.#$b#That's really interesting! I wonder if I could rig up a misting system to help cool the animals while it's so hot...",
		"maru.daily.summer_Fri4": "You know, Sebastian has been talking to me more lately. He actually offered to help with one of my experiments!#$b#He thought of a few things to test that hadn't occurred to me, his suggestions definitely saved me time and effort.",
		"maru.daily.summer_Sun6": "Some day I'm going to be a world-class inventor. At least that's what my dad likes to say.$u#$b#It's kind of annoying sometimes, but I do appreciate his support.",
		"maru.daily.fall_Mon8": "You should come visit me at the clinic tomorrow. I work from 10 a.m. to 4 p.m., it can get pretty boring since there aren't a lot of patients.$h",
		"maru.daily.fall_Fri6": "Oh @! I have something I need to test. Would you lend me your arm?$h#$e#%Maru straps on something that looks like strange armor with pistons.#$b#Here, bend your elbow like this... hmmm... okay, if I tighten this here and add another strap, I think it will work...#$b#Thanks for your help!$h",
		"maru.daily.winter_Mon8": "Hi @!$h#$b#Hey, don't you think my snowman looks kind of like you? Haha!#$e#I heard Seb talking about a snowgoon army, I'm not sure if I'm any good at making snowgoons, but I'd love to help!$h",
		"maru.daily.winter_Thu4": "What are some repetitive tasks on your farm? I'm looking for robotics ideas that have practical applications.#$e#I'm sure a farm would have a lot of automation opportunities.$h",
		"maru.daily.winter_Thu6": "I've been working on some bots that could be useful for automating tasks on your farm.#$e#I can show you some when you have time, maybe you'll have some more ideas for how to use them.$h",
		"maru.daily.winter_Thu8": "I've been working on some bots that could be useful for automating tasks on your farm.#$e#I can show you some when you have time, maybe you'll have some more ideas for how to use them.#$b#It would be fun to build a Rube Goldberg machine together!$h",
		"maru.daily.winter_Fri6": "Hmmm... I think you're just the right size...#$b#Could I take a couple of measurements? just across your shoulders and down to your mid-back... Okay, that looks good.#$e#Oh, I'm not ready to show anyone yet, but if my idea works, you'll be the first to know!$h",
		"maru.daily.spring_4": "Oh hi... Has my brother come out of the basement to meet you yet? Well, he's technically my half-brother but it seems petty to always mention that.#$b#He doesn't talk much but he's a decent guy.",
		"maru.daily.spring_7": "Hey um... don't worry if Sebastian says something odd.#$b#He just sort of says what pops into his head sometimes, he doesn't really have a filter.$s",
		"maru.daily.spring_14": "Hey @! How is the farm coming along? I don't envy all the work you'll have to put into it!#$b#By the way, if you need any help with anything, be sure to let me know.$h",
		"maru.daily.spring_20": "Are you going to the flower dance in a few days?#$b#If you do, would you say 'hi' to Sebastian? He hates going and I think he'd feel better about it if someone talked to him.$h",
		"maru.daily.spring_3_2": "I can't believe it's already been a year since you moved here and took over the farm.#$b#I'm so glad to call you my friend, I think this year will be even better.$h",
		"maru.daily.summer_1": "This is going to be a great season for stargazing. I love just standing in the cool night air, looking at the stars.#$b#You're welcome to join me, I always appreciate the company.$h",
		"maru.daily.summer_3": "How are things at the farm? Remember to let me know if you need any automation research.#$b#If you're here to talk to Sebastian, he's probably in his room.",
		"maru.daily.summer_10": "Good to see you, @. The heat is miserable today!#$b#Did I tell you Sebastian got me a birthday present this year? It was so nice!$h#$b#He's pretty much ignored me the past few years, I hope this means he'll talk to me more often.$s",
		"maru.daily.winter_1": "Oh man, it's so cold... *shivers* If you go down to Seb's room, you'll want a coat, his heater is broken and it's like an icebox down there.$s",
		"maru.daily.winter_18": "Hey @, are you looking forward to the Feast of the Winter Star?#$b#I'm already getting gifts ready for my family and friends.$h",
		"maru.reaction.dating_Sebastian": "Sebastian said you and he are dating now! He was so excited he could barely get the words out!$h#$b#I'll be seeing more of you now, right? Mom and Dad are both really happy for Seb, especially Mom. She won't stop teasing him.$h#$b#Don't worry, I'll try to distract her so she doesn't drive him absolutely crazy.$h",
		"maru.reaction.married_Sebastian": "Hey, @! I'm glad that Seb found a way out of the basement... literally and figuratively, it sounds a little dramatic but you're definitely his knight in shining armor.$h#$b#Hmm... mechanical armor... that could absorb energy from impacts... Oh! Don't mind me, just thinking out loud.$h",
		"maru.special.Wed4_inlaw_Sebastian": "It might sound clich, but I'm glad my brother married someone I'm proud to have as part of my family.#$e#Someday I hope to find the person that makes me happy like you two obviously are, but no matter what happens, I love my life.$h",
		"maru.special.Sun_inlaw_Sebastian": "How is married life on the farm?#$b#Is my brother more of a help or a hinderance? Haha! Don't tell him I said that.$h",
		"maru.reaction.dating_Sam": "Sam has been telling everyone he sees that you two are dating, haha!$h#$b#He's so excited, it's really cute. Sam's a great guy, I think he'll make a fun boyfriend. Be sure to tell me all about it when you have time!$h",
		"maru.reaction.married_Sam": "The wedding was amazing! It's great to see two of my friends getting married.$h#$e#Seb is really happy about it too, I think he's glad you'll both be staying here.",
		"maru.daily.Wed4_inlaw_Sam": "How is Sam doing at the farm? I bet he's happy he can play his music as loud as he wants!$h#$e#I'm glad you keep coming by to visit me and Seb, it can get kind of lonely out here sometimes.",
		"maru.daily.Sun_inlaw_Sam": "How is married life on the farm?#$b#Is Sam more of a help or a hinderance? Haha! Don't tell him I said that.$h",
		"maru.reaction.dating_Alex": "Sebastian said you and Alex are dating now! That's so exciting! Between you and me, he sure is handsome, heehee!$h#$b#Don't be a stranger, Sebastian needs friends like you and I'm always in need of beta testers for my new machines.",
		"maru.reaction.married_Alex": "Hi @, the wedding was amazing! You two looked like celebrities up there.#$b#The only thing that could have made it better would be adding some smoke machines, maybe a few fireworks... Oh, never mind, maybe for my wedding someday, haha!$h",
		"maru.reaction.GreenRain": "I want to go collect samples with my dad, but my Mom is insisting we stay here...#$b#She's really worried about him.",
		"maru.reaction.GreenRain_2": "I'm gathering samples with Dad, this phenomenon doesn't have much to do with robotics, but if Dad can discover the makeup of the rain, maybe he can create an organic fertilizer.#$b#Then I can invent machines to help spread it!$h",
		"maru.schedule.Resort_Entering": "Willy mentioned that you helped fix the boat. Thanks for doing that!#$b#The ride over was so fun, I bet I could make some motors that would make the boat really fly across the water!$h",
		"maru.schedule.Resort_Leaving": "That was a nice getaway from my labwork! I love getting sun once in a while, then I feel refreshed and ready to start new projects.$h",
		"maru.schedule.Resort": "I've been noticing a few different starfish species. My favorite are the big purple ones, but they're all very interesting!#$b#Want to come check them out with me? I've heard quite a few frogs too! *winks*$h",
		"maru.schedule.Resort_Towel": "*gasp*... It's a solar eclipse!$3#$b#Oh... never mind. It's just your body blocking the sun.$h#$b#Step a little to the right... ah yes, the shade is just perfect! Just kidding, I actually enjoy the sun unlike my brother.$h",
		"maru.schedule.Resort_Towel_2": "We're so far removed from civilization out here.#$b#Imagine the stars you could see at night.#$b#Who knows, maybe we'd even see a flying saucer or two! Oh, I bet we could come up with a great alien conspiracy theory for Sam!$h",
		"maru.schedule.Resort_Bar": "Mmmm... Why are tropical fruits so good? Try the smoothies, they're amazing and so refreshing!$h",
		"maru.Event.cs.1020": "Thanks for helping out, that was fun having someone new in the lab.$h",

//PENNY
		"penny.reaction.dating_Sebastian": "Oh, hi @, I heard from Sam that you and Sebastian are dating. Sam is so excited!$h#$b#Even though we both grew up here, I really don't know Sebastian that well. He's quiet but seems nice, I wish you the best of luck.$h",
		"penny.reaction.married_Sebastian": "@, your wedding was so beautiful... Don't say anything but I looked over at Sam and he had tears in his eyes.$h#$b#He's so cute! Um... oh, never mind about that, he was just really happy for you and Sebastian.$h",
		"penny.reaction.dating_Sam": "Oh, hi @, I heard that you and Sam are dating. He is so excited!$h#$b#Sam and I pretty much grew up together, he's like a brother to me. I wish you both the best of luck!$h",
		"penny.reaction.married_Sam": "@, your wedding was so beautiful... Don't say anything but I looked over at Alex and he had tears in his eyes.$h#$b#He'd be so embarrassed if he knew anyone noticed!$h",
		"penny.reaction.dating_Alex": "Oh, hi @, I heard from Sam that you and Alex are dating. Sam is so excited!$h#$b#I really don't know Alex that well. He seems nice, and I bet he'll love living on the farm. I wish you the best of luck.$h",
		"penny.reaction.married_Alex": "@, your wedding was so beautiful... Don't say anything but I looked over at Sam and he had tears in his eyes.$h#$b#He's so cute! Um... oh, never mind about that, he was just really happy for you and Alex.$l",

//PIERRE
		"pierre.reaction.dating_Sebastian": "Hello there, @, need anything for the farm? Or a gift for a special someone?#$b#Abby mentioned you were dating Sebastian. Remember I do have plenty of sunscreen and saltwater taffy in stock! *winks*$h",
		"pierre.reaction.married_Sebastian": "The wedding went quite nicely, the decorations were... unique!$h#$b#If you're planning a honeymoon or another party, be sure to stop by the store.#$b#We have plenty of decor and travel supplies in stock along with the farming supplies.#$b#You'll be expanding the farm, right? Remember to stock up!",
		"pierre.reaction.dating_Sam": "Hello there, @, need anything for the farm? Or a gift for a special someone?#$b#Abby mentioned you were dating Sam. Remember I do have basic medical supplies and plenty of snacks in stock! -winks-$h",
		"pierre.reaction.married_Sam": "The wedding went quite nicely, the decorations were... unique!$h#$b#If you're planning a honeymoon or another party, be sure to stop by the store.#$b#We have plenty of decor and travel supplies in stock along with the farming supplies.#$b#You'll be expanding the farm, right? Remember to stock up!",
		"pierre.reaction.dating_Alex": "Hello there, @, need anything for the farm? Or a gift for a special someone?#$b#Abby mentioned you were dating Alex. Remember I do have plenty of eggs in stock! *winks*$h#$b#%Hmmm well, most of them are eggs from my own chickens... heh!",
		"pierre.reaction.married_Alex": "The wedding went quite nicely, the decorations were... unique!$h#$b#If you're planning a honeymoon or another party, be sure to stop by the store.#$b#We have plenty of decor and travel supplies in stock along with the farming supplies.#$b#You'll be expanding the farm, right? Remember to stock up!",

//ROBIN
		"robin.daily.Mon4": "I've been updating my catalog of blueprints, be sure to take a look. If you have any ideas for things I should add, let me know!$h",
		"robin.daily.Mon6": "Hi @! You should join us for exercise at Caroline's place, it's a lot of fun and a great chance to catch up on all the town gossip!",
		"robin.daily.Tue": "Hey, if you need any materials or blueprints, my shop is the place you're looking for!#$b#Plus, your business supports the local economy. It'll be such a boost to the valley when you have that farm up and running again.$h",
		"robin.daily.Tue4": "Maru was chatting about a new robotics project she's thinking about, something with arms and mechanical muscles? That might not be right, you'll have to ask her about it.",
		"robin.daily.Tue6": "Has Maru shown you her current projects? She wanted to test some out on me, but I made up an excuse. I've been zapped before! *grins*$h",
		"robin.daily.Wed": "Hey there, @.#$b#I was just daydreaming about some new carpentry projects. I'd like to try some detail carving, maybe a bedframe.#$b#Are you doing okay at your place? How's the woodwork in your cottage holding up?",
		"robin.daily.Wed4": "Have you seen Sebby's stone carvings? He's inspired me to try more detail work for the next fair display.#$b#I've never really thought of construction work as art, but I'd like to add some artistic flair to my work.",
		"robin.daily.Wed6": "Do you need any decor for your house? I've been thinking I should spruce up the decorations around here to show off what I can make for people.",
		"robin.daily.Thu": "You're always welcome to visit us, even if you aren't shopping, you know.$h#$b#It can get pretty lonely up here in the mountains. Have you heard any interesting chatter from town?",
		"robin.daily.Thu4": "Sometimes I start talking to my tools... maybe I need to catch up with my friends more often, heh!",
		"robin.daily.Thu6": "Hmm I've started naming my tools. Is that strange? Demetrius is beginning to think I'm eccentric.",
		"robin.daily.Fri": "You've met my son Sebastian, right? He lives downstairs.#$b#He's a little shy, but I'm sure he'll warm up to you if you talk to him. He's a good kid.",
		"robin.daily.Fri4": "Has Sebby ever taken you to the lake and shown you the frogs and tadpoles?#$e#He's been fascinated with them since we moved here, nothing compares to being this close to nature.$h",
		"robin.daily.Fri6": "I saw you walking with Maru the other day, how are you two getting along? It's good to see her making new friends.",
		"robin.daily.Sat4": "I do wish Demetrius and Sebby got along better, they used to fight quite a bit but now they just ignore each other.#$e#It's sad, I know they would get along if they just learned to listen.$s",
		"robin.daily.Sat6": "I've noticed Seb and Demetrius are making more of an effort to get along, at least they've talked a little in the lab.#$e#I don't want to say anything and possibly ruin any progress they've made.",
		"robin.daily.Sun4": "How are you liking the valley? I love it here so much, we have all kinds of natural resources and it's just beautiful here.$h",
		"robin.daily.Sun6": "Hi @! It's good to see you.#$b#Do you feel like a regular member of the community now?#$e#I know it takes some time to really fit in when you move to a small community like this, but I really appreciate the efforts you've made to befriend everyone.",
		"robin.daily.spring_Mon8": "It's great to see you, @! How are things going? I've got a full year of projects lined up already, I'll definitely be busy this year!$h",
		"robin.daily.spring_Sat8": "I'm so happy Demetrius and Seb are getting along better now, they're both growing up, heh!$h",
		"robin.daily.spring_Sun8": "The community has really grown since you've been here, I think you inspired everyone to start improving their property.#$e#Even Abby was chatting about building a cozy apartment building someday.",
		"robin.daily.summer_Mon4": "Hello @! Let me know if you have any new projects this summer! Oh and be sure to check in on Seb and Maru while you're here.$h",
		"robin.daily.summer_Mon6": "I need to keep busy or I go a little stir crazy, you know what I mean?#$b#Demetrius offers to let me help him in the lab, but I'd rather not, his experiments are very delicate and that's not my skillset, haha!$h",
		"robin.daily.summer_Tue4": "Are you raising animals at your farm? Marnie was asking about that when I saw her last. For some reason, she thought I would know, haha!$h",
		"robin.daily.summer_Tue6": "Did you know Sebby really likes void chickens? Or was it their eggs... Yeah that's it, those odd black eggs.",
		"robin.daily.summer_Tue8": "You should introduce Seb to the animals on your farm, he liked all kinds of creatures when he was a kid.#$b#It would be good for him to connect with nature. Life balance is so important!",
		"robin.daily.summer_Wed4": "Phew! It really is toasty out here! Be sure to take a lot of breaks and drink plenty of water... Oh, that's the mom in me talking, haha!$h",
		"robin.daily.summer_Wed6": "Make sure your buildings have good air flow during the summer. You don't want stagnant barn air, that's for sure.",
		"robin.daily.summer_Wed8": "How's the ventilation in your outbuildings? If you need any help with adding fans or vents, I'm happy to come by.",
		"robin.daily.summer_Thu8": "I'm thinking about trying out some new woodworking tools, I'd like to learn a few more techniques just to keep things interesting.",
		"robin.daily.summer_Fri": "We're pretty insulated from the rest of the world here in Stardew Valley.#$b#It has its pros and cons, but for me, the pros greatly outweigh any negatives.",
		"robin.daily.summer_Fri6": "Now that you've been here for a while, do you miss the city? The constant noise and rush can be invigorating, but I think the peaceful calm of the valley suites me best.",
		"robin.daily.summer_Fri8": "I'm glad you decided to make your home here, @. Even if you and Sebby hadn't hit it off, you're a great addition to our community.",
		"robin.daily.summer_Sat4": "If you ever want to know what's up around town, talk to Jodi. She always seems to know everything before anyone else, I'm not sure how she does it.",
		"robin.daily.summer_Sat6": "Be sure to tell me any good gossip you hear in town, I'm always extra busy in the summer so I don't have time to keep up on the latest news.",
		"robin.daily.summer_Sun4": "What do you think about a super deluxe chicken coop? Heated nests, musical ambiance, colorful paint... well, I can dream, can't I?$h",
		"robin.daily.summer_Sun6": "Building on the super deluxe chicken coop idea, what are your thoughts on a super deluxe barn? Cows and sheep should be treated like royalty, dont you think?$h",
		"robin.daily.summer_Sun8": "If you catch anything unusual at the lake, be sure to show Demetrius, he's always fascinated with rare specimens and will ramble on about every detail of the species.#$e#Sometimes it's interesting, but I really just like listening to his voice.$h",
		"robin.daily.fall_Mon8": "How did I know Demetrius was the one for me? Hmm... well, he's always there for me when I need someone to talk to.#$e#He supports me no matter what, even if it sounds like he's being argumentative... I love his passion for his work, and he's quite an attractive man!$h",
		"robin.daily.fall_Tue6": "Maru and Demetrius have been busy with some experiment or other, if you ask, I'm sure they'll tell you all about it.",
		"robin.daily.fall_Tue8": "Oh! Just the person I wanted to see.#$b#I have some new designs drawn up for furniture to match my deluxe bed and I want an opinion from someone who isn't completely hung up on practicality like Demetrius.",
		"robin.daily.fall_Wed4": "Sebby has been so content lately, he used to be such a grump sometimes, but that hasn't happened in a while.$h",
		"robin.daily.fall_Wed6": "I heard Seb singing by the lake the other day, I thought I was dreaming for a second!$h#$e#He does have a wonderful voice, but I'll admit I'm biased. I've only heard him sing for the band before, it was nice hearing him on his own.",
		"robin.daily.fall_Thu": "You're always welcome to visit us, even if you aren't in the market for a building upgrade!$h#$b#It can get pretty lonely up here in the mountains, to be honest, I really enjoy our chats.",
		"robin.daily.fall_Thu6": "It's nice to see you, @! If you have time, do you want to join me on a walk along the river?#$e#The sound of the water can be so relaxing and it's still warm enough to enjoy it.",
		"robin.daily.fall_Thu8": "Are you and the gang dressing up for Spirit's Eve? Seb has always loved wearing costumes.#$b#When he was just a little guy, I got him this adorable frog onesie costume.#$e#He loved it so much he refused to wear anything else for days! I had to sneak it into the wash when he was sleeping.#$b#Unfortunately, it didn't make it through the drying cycle before he woke up, he was so upset!#$b#But when he got to put the onesie on warm from the dryer, all was forgiven.$h",
		"robin.daily.fall_Fri6": "If you're ever headed to Zuzu City and want some company, be sure to let Sebby know, he likes to pick up supplies for his motorcycle and visit the comicbook store.",
		"robin.daily.fall_Sat6": "It's so funny how different my kids are, I mean, they're definitely both mine but you'd never know it, haha!$h#$b#It's fun seeing their little quirks as they get older, they're both such amazing people.",
		"robin.daily.winter_Mon": "Hey, it's a perfect time of year to gather wood.#$b#Maybe you can collect enough to upgrade your house! I promise, it'll be worth the effort!",
		"robin.daily.winter_Mon6": "Are you stocking up on resources? If you need any upgrades, be sure to let me know!",
		"robin.daily.winter_Mon8": "Check my catalog when you come by to see if there are any upgrades you'd like for the farm, it's a great time of year to gather resources.$h",
		"robin.daily.winter_Tue6": "Winter is a dangerous time at my house.#$b#Demetrius and Maru are cooped up inside working on their experiments, the risk of the house being blown sky high increases as the season goes on.",
		"robin.daily.winter_Wed6": "Have you been spending more time in the mine? Don't forget to be careful, and we're right here close by if you ever need anything.#$e#We keep the first aid kit stocked just in case.",
		"robin.daily.winter_Thu6": "How are you? Stay and chat for a while. I can put on a pot of tea and we can enjoy a nice slice of chocolate cake.$h",
		"robin.daily.winter_Fri": "My parents were bewildered when I told them I wanted to be a carpenter.#$b#They were pretty old-fashioned. I try not to do that with my kids, they each have their own dreams and I want them to be happy.",
		"robin.daily.winter_Fri6": "How did your parents feel about you giving up a corporate job to take on the farm? I bet that was an interesting conversation!",
		"robin.daily.winter_Fri8": "You're a good role model for young people just starting out, you knew what you wanted and took the necessary steps to get there.#$e#Too many people are worried about what others think or are afraid to fail so they never take that first step.",
		"robin.daily.winter_Sat6": "I overheard Demetrius asking Sebby his opinion on some science thing or other.#$e#I don't really pay too much attention to what they're talking about, but it's wonderful to see them interacting, even if it's just a few words here and there.$h",
		"robin.daily.spring_6": "Hello, @! How are things going at the farm? Need any help with your buildings yet?#$b#You've certainly been busy running around town since you got here.$h",
		"robin.reaction.dating_Sebastian_memory_oneday": "I finally heard that you and Sebby are dating now!$h#$b#I'll admit, I was annoyed that I found out through the grapevine, but I really wasn't surprised. I'm just glad you two are finally officially together.#$b#Demetrius is happy too, don't say anything but he was getting a little annoyed that Sebby didn't seem to be moving ahead in his life.#$b#Don't worry, I won't tease my baby too much, but I'm just so happy for him!$h",
		"robin.reaction.married_Sebastian": "*sniff* @! *sniff* Don't mind me, I'm just so thrilled!#$b#The wedding was beautiful and Sebby looked so happy, I know you have a wonderful future ahead of you!$h",
		"robin.special.Mon4_inlaw_Sebastian": "How is Sebby doing with the farm work?$h#$b#He's looking really great since you two got married, I think he's actually gaining some muscle!$h",
		"robin.special.Tue4_inlaw_Sebastian": "I'm so proud of you and Sebby, your farm is just beautiful.$h#$b#I've always loved the valley and I'm glad Seb has found joy here too.$h",
		"robin.special.Thu8_inlaw_Sebastian": "It makes me feel at peace seeing you and Sebby building your farm together.$h#$b#To be honest, I was afraid Sebby would move back to the city and I'd hardly see him.",
		"robin.special.Fri_inlaw_Sebastian": "Sometimes I really miss Sebby, remember to come by and see us when you're not too busy. Demetrius doesn't show it, but he loves when you both stop by.",
		"robin.special.Fri4_inlaw_Sebastian": "Do you have everything you need in your house? Remember I have all kinds of furniture in stock if the two of you need anything.#$b#And I can make custom orders too.$h",
		"robin.reaction.dating_Sam": "I heard from Sebby that you and Sam are dating now!$h#$b#That's great, you two are a really good match in my opinion, and Sam is obviously devoted to you.#$b#It's wonderful how you three hit it off so quickly, now you're pretty much inseparable, like the Three Musketeers! Haha!$h#$b#It's so nice to see Sebby with friends like you and Sam. You're both so fun to have around, even Demetrius enjoys your company.#$b#Oh don't mind me just prattling on, I'll let you go but be sure to stop by the kitchen, there's a piece of cake there for you.$h",
		"robin.reaction.dating_Alex": "So you and Alex are dating now? Sebastian mentioned it, he seems happy for you both. Thanks for being friends to him, he really needed that positivity in his life.$h",
		"robin.reaction.married_Alex": "The wedding was perfect! I had so much fun helping Evelyn with the arch and stage.$h#$b#I wish only the best for you and Alex, and don't forget to stop by and check the new building expansions I added in my catalog!",

//SAM
	//SAM DAILY
		"sam.special.Introduction": "Hey, you just moved to that old farm, right?#$b#Name's Sam. Man, you've really got your work cut out for you, nobody's lived there in years.#$b#My place is over by the river, I'll see you around!$h",
		"sam.daily.0.1": "%Sam is humming a few notes, then repeating them in a slightly different pattern.#$b#Huh, this bridge is really not cooperating... I can't get the rhythm right.$s",
		"sam.daily.0.2": "*mumbles* Hmmm gotta clean up my board and swap out the wheels again...#$b#Yo! Ah, just thinking I need to get my skateboard ready for the warmer weather so I can practice some new tricks.$h#$e#I almost have the kickflip down, sure wish there was a good place to skate here, I kinda miss the skatepark at Zuzu City.$s",
		"sam.daily.0.3": "If you're ever at the JojaMart on Monday or Wednesday, be sure to say 'hi'!$h#$b#It kinda sucks working there but it's extra cash and requires no brain cells.#$e#I'd love to find something better though, definitely want to move out on my own, y'know?",
		"sam.daily.0.4": "%Sam is absently picking at some threads on his jacket, it looks like it's been through some sort of natural disaster.#$e#Oh, hi @, how are you liking the country life?$h#$b#Hope it's going good, some people show up and realize the slower pace isn't for them and pack up and leave.#$b#We moved here from the city too so I remember what it was like.#$b#I'd miss seeing you around so I hope you stay!",
		"sam.daily.0.5": "It's Friday! Yeah! Time for hanging out at the saloon and playing pool. You should come too!$h#$b#Me, Seb, Abigail, and a few others are regulars on Friday nights, like a tradition or something. It would be great to have a new person join!$h",
		"sam.daily.0.6": "Hey @! Seb and I are trying out some new song ideas, changing up the sound.$h#$b#We'd love to get your opinion! Well, I would anyway, Seb takes a while to get comfortable with new people.",
		"sam.daily.0.7": "Gonna hang with my bro Seb today, don't worry about it if he doesn't talk much, he'll warm up to you eventually.",
		"sam.daily.2.1": "Hi @! Feel free to come in my room whenever you want, I don't mind at all!#$b#It's kinda messy, so you'll have to ignore the clothes and stuff.#$e#I try to clean it up, but for some reason it always gets messy again right away. *shrugs*$h",
		"sam.daily.2.2": "I've been working on learning some street magic tricks to show Vincent, can I practice on you?$h#$e#Cool! Okay, here goes. See, my hands are empty...#$b#%Sam sticks out his hands, flipping them over, then pretends to manifest a guitar pick.#$b#Look! A guitar pick! Haha! I actually did it without dropping the pick this time, I'm getting better at this!$h",
		"sam.daily.2.4.1": "I keep bugging Seb to play arcade or console games with me, but he isn't great at those kinds of games so he gets all sulky about it.",
		"sam.daily.2.4.2": "Do you like video games?",
		"sam.daily.2.4.3": "Sure! I like action games.",
		"sam.daily.2.4.4": "Awesome! Next time I'm headed to the saloon, you can join me and we'll play a few PvP rounds of Prairie King.$h",
		"sam.daily.2.4.5": "I'm not great at those either...",
		"sam.daily.2.4.6": "That's okay, if you want to try I can show you some tricks that make it easier!$h",
		"sam.daily.2.5": "*fist bump* @! Coming to the saloon tonight?$h#$e#I bet Seb would let you play a round of pool, have you played before?#$b#I could show you the ropes, or Seb could too, he's way better at it.#$b#Oh yeah, Abigail mentioned she liked talking with you, she gets kinda bored I think.",
		"sam.daily.2.6": "%Sam's hair is sticking up everywhere. It's impossible not to touch it.#$b#Hey! No, no, dont do that! My hair is like my personal brand!#$e#Pfft, just kidding, it just does that by itself, like a million cowlicks and I cant get it to lay down to save my life, haha!$h#$b#Plus it makes me look taller, not that I need help with that anymore. I kinda shot up a couple years ago.#$b#Oh that reminds me, I havent teased Seb about being shorter than me in a while, hmmm.",
		"sam.daily.2.7": "How's the mining going? Dude, that's a nasty cut on your hand... *gulps*#$e#Uh, I'm not great with blood and stuff, but Seb has a first aid kit so you should have him wrap that for you.#$e#He's actually really great at that kind of thing if you ever need a quick patching up and don't want to see Harvey.#$b#I guess it's useful living with a carpenter, plus being close to the mines!",
		"sam.daily.4.1": "%Sam is wearing his threadbare jacket, it seems to have a story.#$b#Oh this? Yeah, actually. It was my dad's jacket back when he was in school, he gave it to me when I was big enough to wear it.#$e#It's starting to really look like it's been through a lot, huh. I guess it really has, I'm kinda rough on clothes.#$b#Wearing it reminds me that he'll be back from the war someday, plus it's the most comfortable thing I own.#$b#Mom keeps bugging me to replace it, she says it looks like I can't afford a new one, but I'll never find another jacket like this.",
		"sam.daily.4.2": "Hey, I got an extra Joja cola from work, here ya go![167]$h#$b#Whats up today? Im working on some new tricks on the skateboard.#$e#Would be way easier if we had a skatepark, but I can make do with the planters and stuff around here.",
		"sam.daily.4.3": "Hmm... I need to get more guitar picks, I keep losing them.$s#$b#Wonder where they go? Probably the same place as my socks.#$e#Next time I go to the music supply store in Zuzu City, wanna come? Seb usually goes too so he can get oil and whatever for his bike.#$b#There's lots of cool stuff to look at even if you're not super into music, and I'll get you a coffee or whatever you like.$h",
		"sam.daily.4.4": "Think fast![384 386]$h#$b#Found this in the mine by Sebs. We were in there looking for frozen tears for some project or other he's working on.#$e#I thought you could use it since you go mining a lot... whats it like down there?#$b#I only go down a few levels with Seb, it gets pretty creepy and Im really not THAT into rocks!$s",
		"sam.daily.4.5": "Seb mentioned that sci-fi show he's been watching, so I tried a few episodes.#$b#It's good, actually! You should come by and watch it with us sometime.$h",
		"sam.daily.4.6": "Im getting pretty good at kickflips on my board, watch this!$h#$b#%Sam executes a perfect kickflip, nice! He really is great at skateboarding.#$e#There are plenty more tricks to learn, I think Ill try a heelflip or nollie next.",
		"sam.daily.4.7": "Watch me chug this Joja cola and belch the national anthem... alright, here goes!#$b#%Sam does exactly that, and makes it quite a ways through the song, surprisingly impressive!",
		"sam.daily.6.1": "Oh man, my fingers are sore! I've been trying out some new stuff on my guitar and my fingers aren't used to it yet.$s#$b#On the plus side, I have some new riffs to change up our songs!",
		"sam.daily.6.2.1": "%Sam is holding a Joja cola.#$b#How about another rendition of the national anthem? Or maybe some other song... hmm...",
		"sam.daily.6.2.2": "While hes thinking...",
		"sam.daily.6.2.3": "grab the cola and chug it...",
		"sam.daily.6.2.4": "Pfft!! I think your anthem belching skills are better than mine! Heh, awesome! **grins**$h",
		"sam.daily.6.2.5": "Raise my eyebrow at Sam and shake my head.",
		"sam.daily.6.2.6": "Okay, okay maybe anthem belching is kinda immature...$s",
		"sam.daily.6.3": "Those stories you tell about fighting monsters and finding treasure are really cool, but... just be safe, okay?#$b#Ive seen those adventurer gravestones... *shivers*",
		"sam.daily.Thu6_1": "I got a letter from my dad, he says he should be coming home in a year or so.#$e#It sounds like a long time, but at least it's better than having no idea when he'll be back.#$b#*sighs* I really miss him, @. I never knew how much I needed him until he was gone.$s",
		"sam.daily.6.5.1": "Hi @, are you coming to the saloon tonight?",
		"sam.daily.6.5.2": "Want to play a round of pool with me?",
		"sam.daily.6.5.3": "Sounds fun! I'm not great at it though.",
		"sam.daily.6.5.4": "Oh you're plenty good enough to play against me! Or Seb could show you some tricks, he knows some great ones.$h",
		"sam.daily.6.5.5": "Oh? You want to show off for me?",
		"sam.daily.6.5.6": "Pfft, it's only showing off if you're good, haha! Seb always trounces me so it would be nice just to play for fun.$h",
		"sam.daily.6.6": "%Sam is listening to music on his headphones, moving to the beat. Its the perfect opportunity to sneak up from behind and poke him in the ribs.#$e#GAAHH! @! No fair, haha!$h#$b#Hey, want to listen with me? Its this new band I discovered. Tell me what you think!$h",
		"sam.daily.6.7": "Yo! I was over at the docks yesterday with Vincent and Willy hooked this massive fish, I mean it looked like a Tuna it was so huge!#$e#%Sam throws his arms out to demonstrate.#$b#Oh man, sorry about that, sometimes I get a little carried away.",
		"sam.daily.6.8": "Oh hey! I was just texting Seb to ask if he's seen you.$h#$b#Heh, now that I said it out loud, that sounds kinda lame, hmmm maybe THAT'S why he was annoyed earlier? Oh well.#$e#Anyway, I was heading down to the beach with Vince if you want to come along? He loves when you come build sandcastles with us.$h",
		"sam.daily.8.1": "Hi! Want some coffee? I already had THREE CUPS today and Seb gave me another one.[253]$h#$e#I would drink it cuz he makes great coffee but Im already WAY too wired, HAHA! Oh, sorry! That was loud.$h#$b#I better go skateboarding or take a jog or something or Ill NEVER get to sleep tonight!",
		"sam.daily.8.2": "So what was your life like before you moved here?#$e#I really respect what you did, giving up a stable life and taking a huge risk for the chance at something better.#$b#I'm really glad you were so brave, our friend group is better with you in it.$h",
		"sam.daily.8.3": "%Sam is jamming out with his headphones on, air guitar and the works. Another perfect opportunity for a sneak attack.#$e#GAAHH!! WOAH HEY! @, you dingus, haha!$h#$b#Totally busted me looking like an idiot!$10#$e#Hey, come jam with me, you can be on the air drums!$h",
		"sam.daily.8.4": "I was thinking about a skatepark and drew up some designs, what do you think?$h#$e#A ramp here, and rails for grinding, if we can, a wall would be great over on this side...$h#$b#%Sam is so excited, pointing out every detail on his drawing. Its very good actually, it would be easy for Robin to build.#$e#Sorry, I kinda got carried away there, this is just a dream really, no way Id ever have enough money to build this thing!$s",
		"sam.daily.8.5": "Hey, hey, it's saloon night! Are you coming by?#$e#If you want join me and Seb, we could play Rotation or Cutthroat, then all three of us can play.$h#$b#It's great having you there, then it's not the same old game over and over.$h",
		"sam.daily.8.6": "Dude, I was grinding on my board and scraped my knuckles. Hate that!$s#$b#I can show you the trick I'm working on, let me grab my board!$h",
		"sam.daily.8.7": "@, are you happy here? You know my family moved here from the city before Dad left for the war.#$e#I used to think I'd probably move back there, maybe room with Seb until I could find a good job and get my own place.#$b#But I haven't wanted to do that for a while now. I'm really happy here, and Vince loves it too.#$e#Even Seb says he doesn't want to leave anymore. Abby is relieved, she always hated it when we talked about moving away.#$b#Even though she complains about her family, she's never wanted to leave the valley.",
		"sam.daily.spring2.1": "There was a spider on my ceiling last night, must be time for them to start coming out now that the weather is warming up.#$e#Huh, sure hope it didn't wander under the covers during the night...#$b#Or crawl in my mouth! Blech! Sure wish I hadn't thought of that.$s",
		"sam.daily.summer0.1": "Phew!! It gets pretty dang hot here in the summer, but at least my allergies have calmed down.#$e#Have you been down to the beach yet? The breeze off the ocean feels great and there's some tide pools if you can get to them.#$b#Vincent really loves those.$h",
		"sam.daily.fall4.2": "It's pumpkin season! Carving pumpkins is aways a good time!$h#$b#Mom won't let me do it in the house since it makes such a mess, but the weather is nice enough to carve outside.#$e#Or we can go to your place or Seb's.#$b#We should have a contest! Everyone can carve a pumpkin and Vince and Jas can be the judges.$h",
		"sam.daily.fall6.1": "You've got a leaf in your hair, heh! Looks very seasonal!$h#$e#Here, I'll get it for ya. Hey, it's a nice one!#$b#I think I'll give it to Vince. He likes collecting good leaves in the fall.$h",
		"sam.daily.fall_Thu6_1": "I heard from my dad, he's coming home next year. It's earlier than he thought, which is great! I hope nothing happened though.#$b#He sounded relieved in his letter but it's hard to tell with just reading words. I really want to make him feel welcome, y'know?",
		"sam.daily.winter4.1": "The lake is freezing over, almost time to ice skate!$h#$b#I'm pretty okay at it, probably from all the skateboarding.#$e#I'll show you some good moves, nothing fancy like that triple axel crap, but I can do a flip and usually don't wipe out!$h",
		"sam.daily.winter8.2": "It would be fun if we could go sledding, wouldn't it?#$b#I don't think there are any good hills nearby.$s#$e#Plus, I don't have a sled.#$b#So, how have you been doing lately?",
		"sam.daily.winter_Thu6_1": "I just got another letter from Dad, he confirmed he's coming back in spring.#$e#It's been three years since I saw him last. Huh, I've changed a lot since then... I hope he's not disappointed in me.$s#$b#... You really think that? Loyal, kind, and fun, huh? Okay those are all good! Um thanks, really.",
		"sam.daily.winter8.3": "You don't have a lot of farm work in the winter, huh? How about we go ice skating or build a snow fort?$h#$e#Gotta have fun while we can before it gets busy again! Let's bring Vince, he keeps saying he wants to play in the snow.",
		//SAM DATED
		"sam.daily.spring_4": "Hmm... I'll ask Sebastian if I can borrow another comic.#$b#Oh hey @! Have you talked to Seb yet?#$b#You know, the guy all in black with longish hair in his face?#$b#He can be kinda standoffish at first and doesn't talk much but he's actually a pretty nice guy once he gets used to you.",
		"sam.daily.spring_10": "Good to see you, @!#$e#Oh, today's my little brother's birthday, gotta get him something good.$h#$b#I'll probably take him over to the park later and run around with him, if you happen to be around, come say hi!",
		"sam.daily.spring_12": "*ACHOO!!* Oh jeez, I'm sorry... my allergies in spring are terrible.$s#$b#Tomorrow's the Egg Festival, I still like doing the egg hunt with Vince even though I'm dying and can't breathe. *SNORF!!*$s",
		"sam.daily.spring_21": "Oh... uh oh... here it comes... ACHOO!! *SNORF* Ugh, those spring petals that float around really get me sometimes.$s#$b#Summer is my favorite season, the pollen is gone and I can skate or play guitar outside.",
		"sam.daily.spring_22": "Hi @, you going to the Flower Dance in a couple days? Seb is sulking 'cause he hates going.#$b#It's not THAT bad, except I'm sneezing the whole time.",
		"sam.daily.summer_3": "Ugh... Seb's annual checkup is tomorrow and he always spends the entire day complaining...#$b#I mean, sure it's a pain and I have WAY better things to do than go to the doctor, but it IS only once a year.#$b#Of course, that's easy for me to say, my appointment isn't until fall.$h",
		"sam.daily.summer_7": "Hey @, how's it going?#$b#I've been texting Seb, but he's ignoring me. Guess I'll head over to his place and harass him in person.$a#$b#Bet he lost his phone... last time it was under his couch and he always keeps it on silent.",
		"sam.daily.summer_26": "The summer's nearly gone already. It does get really hot, but I miss hanging out at the beach the rest of the year.#$b#Gonna take Vince to build sandcastles. If youre free, I bet Vince would love it if you joined us.$h",
		"sam.daily.fall_7": "Man, my favorite skating shoes have holes in the sides, I had to order a new pair online.#$b#I guess I could have gone to Zuzu City and gotten them there, but it's not much fun going by myself.#$b#I found the same style so at least I know they'll fit right.$h",
		"sam.daily.fall_11": "Today's Mom's birthday, be sure to come by and visit, she'd really like that and I'll be stuck at the doctor's for a while.#$b#Whenever you visit, she talks about how much fun it was chatting with you.",
		"sam.daily.fall_13": "It's Abby's birthday today, did you get her anything?#$b#Confession... I kinda forgot.$s#$b#It's okay though, I'll find something for her. Oh, maybe a pumpkin! Or one of those purple rocks...#$b#Speaking of, Seb's mom makes a mean pumpkin soup. Has she shared her recipe with you?#$b#Pizza is always the best but soup is nice when it's cold out.",
		"sam.daily.fall_14": "Hi @, I was thinking, it would be nice to have something living in my room.#$b#Haha! No, the spider on my ceiling doesn't count, his name is Frank by the way.$h#$b#More like a plant. But I'm not sure I could keep one alive since I'll probably forget to water it.#$b#Hmm.. I wonder if I could grow a cactus in my room? They don't need much water, and maybe it would grow cactus fruit.",
		"sam.daily.fall_17": "I still haven't gotten those shoes I ordered, kind of a bummer since my old ones are in really bad shape.#$b#The soles are completely smooth and look! My little toe is sticking out the side!$s#$b#Hmm, maybe Seb's mom has some heavy duty tape.#$b#Wonder if they got lost on the way here? We really live in the middle of nowhere.$s",
		"sam.daily.fall_18.1": "Urgh, Mom keeps bugging me to get rid of this jacket. She thinks it looks bad, but it was Dad's and...",
		"sam.daily.fall_18.2": "What do you think?",
		"sam.daily.fall_18.3": "It means a lot to you, you should keep it.",
		"sam.daily.fall_18.4": "Yeah, it feels wrong to throw it out, I mean Dad wouldn't care but... thanks for understanding.$h",
		"sam.daily.fall_18.5": "Sometimes change is good, you don't need to get rid of it though.",
		"sam.daily.fall_18.6": "You think so? Hehe! Maybe I'll pull something else out once in a while, I do wear this jacket a lot.$10",
		"sam.daily.fall_23": "Check it out! My new shoes finally got here and they feel great!$h#$b#%Sam hops up and down a few times, then does a handstand, his shirt riding up showing his belly. He quickly hops back to his feet, yanking his shirt down.#$b#Oh dang, that's cold! Hehe, guess I shouldn't show off like that!$10#$b#Anyway, these shoes will take a few days to break in, I'll wear them this weekend in the haunted maze.$h",
		"sam.daily.winter_14.1": "Hey @, are you busy? If you're not, I have a plan...$h#$b#Seb is usually outside working on his bike on Sundays soooo... I've got a bunch of snowballs with his name on them.",
		"sam.daily.winter_14.2": "You in?",
		"sam.daily.winter_14.3": "Oh yeah, I'm up for a sneak attack!",
		"sam.daily.winter_14.4": "Yes! this is gonna be great, hehe!$h*%Hmmm... this isn't going to end well... for Sam.",
		"sam.daily.winter_14.5": "Ha! No way, I value my life.",
		"sam.daily.winter_14.6": "Awww... c'mon, at least walk up there with me... cool, let's go!$h*%Hmmm... this isn't going to end well... for Sam.",
		"sam.daily.winter_15": "Thanks for joining the Seb sneak attack even though I got totally obliterated.$s#$b#Seb must be some sort of ninja, he was there working on his bike one second, then he was gone and I was blasted with snowballs!$s#$b#His aim is amazing too! You barely got hit at all!#$b#Hey, want to go grab some hot chocolate? Maybe I won't plot revenge on Seb. Not today anyway!$h",
		"sam.daily.winter_18": "Seb's been talking about the workout routine Alex put together for him, it's pretty cool...#$b#Maybe I should ask Alex to make one for me, can't let Seb show me up!$h",
		"sam.daily.winter_27": "Hey, @, can we talk for a bit? Just... need to talk to someone and I think you'll understand.#$b#Um, Mom just got a message... my dad is coming home in a few days.#$b#Don't get me wrong, I'm really glad he's safe and on his way back. I'm just nervous I guess.#$b#He's been gone for a few years and I've changed a lot since then.#$b#I wonder if I've become the man he hoped I would or if he'll be disappointed in me.$s#$b#Maybe it doesn't make much sense, I dunno. Mom is going nuts cleaning every corner of the house and Vincent is bouncing off the walls, he's so excited.#$b#Normally, you'd think I would be all excited too, but...#$b#%With how well Sam's taken care of his little brother to help Jodi, his dad certainly won't be disappointed.#$b#Thanks. That means a lot, @... you're a great friend.",
		"sam.daily.Thu_2": "My dad got back yesterday, did he come by the farm? He said he probably would.#$b#He seems like he's okay, but I haven't had a chance to talk to him much yet.#$b#I dunno, it's kind of weird but I'm happy to let Vince monopolize his attention for while, gives me time to think I guess.#$b#It's been three years since Dad left, I have so much to tell him I don't know where to start.$s",
		"sam.daily.spring_12_2": "*AH... AHH... ... ...* phew... I think I'm good.#$b#Ready for tomo- *ACHOO!! ACHOO!! ACHOOOO!!* Holy... *SNORF* Yoba!$s#$b#Wow, sorry for totally exploding all over you, ugh.$s#$b#Anyway, ready for the Sneeze-a-Rama tomorrow?#$b#Vince abandoned me to team up with Jas this year so I'll be around if you want to hang out.",
		"sam.daily.summer_Thu6_2": "Dad was up pacing the hallway last night...$s#$b#I tried to talk to him, but didn't really know what to say. I heard him and Mom talking about counseling, maybe that will help... I hate seeing him like this.$s",
		"sam.daily.winter_Thu_2": "One thing that's nice about winter, there's no pollen in the air... oh, and all the mosquitos are gone.#$b#I guess that's two things, haha!$h#$b#And I can pelt Seb with snowballs... okay, fine, winter isn't so bad.",
		"sam.reaction.dating_Sebastian": "Hey @! My favorite half of the new couple!$h#$b#Yeah, I admit, I drug it out of Seb... I knew something big must've happened, he was walking around grinning like a dufus.$h#$b#Only one thing can make a man that deliriously happy and I had to get all the details.$h#$b#My bro better treat you right, you know where I am if he ever gets out of line.",
		"sam.reaction.dating_Sebastian_memory_oneday": "Wow, you and Seb finally got together... If it were me, I definitely wouldn't have waited this long, ha!$h#$b#I admit I kinda had a thing for you a while back, but I realized pretty quickly you only had eyes for Seb.$10#$b#I'm really happy for him, no hard feelings at all. I really hope you guys stay together, I'd hate to lose either of you from our gang.",
		"sam.reaction.married_Sebastian": "Y'know, I think I teared up for a sec at the wedding, don't tell Seb.$l#$b#You both looked amazing and the whole thing was perfect... I'm starting to think I might want to get married someday, don't quote me on that!$h#$b#Seb practically worships you, I know he'll treat you right.",
		"sam.special.Sat4_inlaw_Sebastian": "Seb and I played pool yesterday, he still won't cut me a break.#$b#He was going on about living on the farm and you, he's definitely found his home.$h#$b#I hope things will work out for me like that, I kinda envy you guys... huh, maybe I'm starting to really think about what I want in the future. About time, right? haha!$10",
		"sam.special.Fri4_inlaw_Sebastian": "You coming for pool night? Gotta keep the gang together!$h#$b#Maybe more people will join us, there's Alex, that guy Abby has been talking about lately, Penny, and Maru of course...$h",
		"sam.reaction.dating_Alex": "Hey @, so muscles finally asked you out? Good on him, he's been agonizing over it for days!$h#$b#But seriously, he better treat you right, let me know if you need me to mess him up.$a#$b#Pfftt!! Oh, alright, that would be like smacking a rock crab with a twig, but I could sure give him an earful!$10",
		"sam.reaction.married_Alex": "Wow, that was a great wedding as far as weddings go, time to party down with the gang!#$b#Let's get everyone together soon, pizza and video games, okay?$h",
		//SAM REACTIONS
		"sam.reaction.gift.373": "Seriously? Isn't this your prize from the maze?#$b#Oh man, I'm going to show Seb, he'll be so envious. Haha!$h#$b#Oh and I'll keep it on my desk so you can look at it whenever.",
		"sam.reaction.gift.279": "$c 0.5#Alright! Sugar rush, here we come! Um, we could share if you want...$h#Oh dang, this stuff is hard to get! It tastes amazing, thanks @!$h",
		"sam.reaction.gift.797": "$c 0.5#This looks ultra rare. Where'd you find it? If you don't mind, I'd like to get it set in a necklace for Mom.$h#I don't know what to say! These are so hard to find. I'll keep it safe for sure!$h",
		"sam.reaction.gift.446": "$c 0.5#Nice! I can hang this on my guitar case. It'll remind me of you, my real good luck charm!$h#Oh cool! Dang, it's so soft... weird how these things just show up sometimes, like magic! Maybe that's why they're good luck.$h",
		"sam.reaction.gift.90": "$c 0.5#Awesome! These are SO refreshing, just gotta watch for stray spines, haha!$h#Oh sweet! Have you tried one of these? Here, let me crack it open and we can share!$h",
		"sam.reaction.gift.731": "$c 0.5#Oh, those are so good! And you're giving me one? Dude, you rock! *fist bump*$h#Yummmm!! These are amazing, the best dessert ever! You made this? Wow, I'm in love! Haha!$10",
		"sam.reaction.gift.562": "$c 0.5#Woah, where did you find this? It's frickin' awesome looking, like the eye of the tiger... Pfft, sorry! Haha!$h#Look at that, it's kinda glowing! That's so cool, I'm usually not super into rocks, but this is great!$h",
		"sam.reaction.gift.206": "$c 0.5#Awww yeah... Pizza time! I'm starved too, thanks @, you're awesome!$h#Oh wow, did you make this yourself or get it from Gus? Either way, it smells delicious! Thanks!$h",
		"sam.reaction.gift.stardroptea": "Wow, I'm usually not much of a tea guy but this is amazing! Thank you, @!$h",
		"sam.resort.entering": "Wow, what a spot! Like the beach at home but all tropical and mysterious, like a pirate island.#$b#Oh, I wonder if there's treasure buried around here? I bet there is!",
		"sam.resort.leaving": "I definitely got my fill of vitamin D!$h#$b#Playing guitar on the beach is always fun but I guess it's time to head back.",
		"sam.resort": "I bet there's some cool stuff deeper on the island, I'm thinking golden idol shrines, hidden caverns, maybe booby traps, heehee!$h#$e#Willy said we have to stay here on the beach, though... some kind of liability issues or something.$s#$b#Hey, you can take me with you, right? C'mon, let's sneak away...$h",
		"sam.resort.shore": "Check out these gnarly waves... Guess what? I'm gonna save up for a surfboard.#$b#It's gotta be easy to learn since I already know how to skateboard...$h#$b#You'll fish me out if I totally biff it, right? I know you've always got my back!$h",
		"sam.resort.towel": "%Sam is playing a jazzy tune on his guitar. He looks up and grins, patting the sand next to him.#$b#I'm glad you're here! You look amazing, by the way.$h#$b#Seb's been around, complaining about possibly bursting into flame, heh!$h#$b#I'm working on some tunes with a tropical vibe. What do you think?$h",
		"sam.resort.towel2": "Maybe I should learn to play the ukulele.#$e#Seb and I can start a castaway band, 'The Pelicans of Paradise'.$h#$e#Pfft, haha! Yeah, no way Seb would hang out here long enough to play a set!$h#$b#Want to join me for a drink? We could take a walk along the water, or just relax in the shade.$h",
		"sam.resort.bar": "I'm just getting juiced up, then it's back to the beach. Gotta stay hydrated!$h#$b#What sounds good? I'll get you whatever you want.$h",
		"sam.reaction.birthdaygift.positive": "Hey thanks, @! You remembered! This is great, thank you!$h#$e#You're the best! Um, hehe... Sorry, sometimes I get a little overenthusiastic.$h",
		"sam.reaction.flowerdance.decline": "Oh man, I totally forgot, I already told Penny I'd be her partner. Next time for sure!",
		"sam.reaction.flowerdance.accept": "Oh yeah! Sure, I'll dance with you.$h#$b#At least I'm not sneezing anymore, heh!$h#$b#You look really great by the way.$l",
		"sam.reaction.fair.purpleshorts": "Yo @, what happened?? I saw Mayor Lewis inspecting the grange displays, then he suddenly turned red as a beet, stuffed something under his shirt, and shuffled you off...#$b#WHAT DID YOU DO? I thought I saw some wild purple shorts in your display, did someone pull a switch on you?$a#$b#THEY WERE THE MAYOR'S SHORTS AND YOU PUT THEM THERE??$8#$b#Oh man! There's an epic story here, you gotta tell me! C'mon, I'm your best friend, I gotta know!!$h",
		"sam.reaction.firstvisit.sewer": "Heheh... So you've been to the sewer, huh? It's pretty creepy down there... how could I tell? Hmm... let's just say... 'the nose knows'.$h#$b#Let me know next time you want to go and I'll come with you. Um, I can watch your back for any weird creatures.#$e#Any sign of a giant mutant frog? No? Huh, wonder where he went off to...$9",
		"sam.reaction.GreenRain": "Whaa! Is it acid? Will it burn through the roof and sizzle us alive?!$8#$b#Vince, don't you dare go outside!$7#$b#@!! Are you okay? What were you doing out there? You could totally have been melted or something!$s",
		"sam.reaction.GreenRain_2": "You notice how warm this rain is? It feels alive... Vince escaped and has been running around pretending to be a swamp monster, haha!$h#$b#I bet the trees and crops are really happy, Seb was saying the frogs loved it last year.#$b#I hope no more frogs grow to mutant size in the sewers... huh? Oh! Never mind, just thinking out loud, heh!$10",
		"sam.reaction.GreenRainFinished": "This rain is so weird, like it's some kind of super plant juice.#$b#I wonder if the animals will grow really big or gain strange abilities from drinking the water...$9#$b#Oh, never mind! I think I've been reading too many conspiracy articles lately, hehe!$10",
		//SAM TOPICS AND EVENTS
		"sam.event.384882": "'Sup! I saw you and Seb riding out on his bike, where'd you end up?#$b#... Nice! I haven't been out to that overlook in ages... Huh, that would be a good spot for a date.$h#$b#I won't bug you for details, I bet I can get it out of Seb anyway, hehe!$h",
		"sam.event.45": "I better lay low for a while. I'm already on Mayor Lewis' short list...$s#$b#But seriously, he's so obsessed with the town image! He forgets this town is made up of all kinds of people and we're not all like him.$s",
		"sam.event.45.memory.oneweek": "Wouldn't it be cool if the town had a skatepark, though?#$b#I bet I could draw up some plans for one. There's plenty of unused land around here that could make a great park.#$b#Now, how to convince Mayor Lewis...$s",
		"sam.event.4081148.memory.oneday": "Even with all the practice we did, I made a bunch of mistakes on stage... I hope no one noticed.$s#$b#It's kind of nerve-wracking to be in front of everyone!$h#$b#I'm really glad you came, and y'know, supported me and Seb.",
		"sam.event.733330.memory.oneday": "If... I mean when... my Dad gets back, I wonder if things will go back to the way they were...$s#$b#He's been gone so long, I kinda don't remember what it was like to see him every day.#$b#When we lived in Zuzu City, he worked as a garbage man.#$b#We didn't have much money and the city is really expensive, so we moved here and Dad joined the military.#$b#I wonder if he regrets that decision.$s",
		//SAM ANIMATION RAIN SCHEDULE
		"sam.animation.guitar.1": "Oh hey, since you're here, listen to this riff and tell me what you think.$h",
		"sam.animation.guitar.2": "Hi @! Yeah I practice pretty much every day, but it's not like boring practice. I love playing so it's just fun!$h",
		"sam.animation.guitar.3": "Seb's usually working during the week so I practice by myself. He's here on Saturdays though so you can hear both of us then.",
		"sam.animation.gameboy.1": "One sec... I gotta beat this level, so close...$7#$b#YES!! Finally! I've been working on that one for days!$h",
		"sam.animation.gameboy.2": "Look at these graphics! This game looks amazing, even on a tiny screen.$h#$b#I can connect this to my computer monitor if you want to watch later.",
		"sam.animation.gameboy.3": "Do you like these kinds of games? I have a bunch I could recommend and a bunch that are steaming garbage, ha!$h#$b#It's hard to tell which it will be until you play though.",
		"sam.animation.skateboarding.1": "@! Did you see that? A perfect kickflip! All my practice is really paying off!",
		"sam.animation.skateboarding.2": "Have you ever tried skateboarding? You need balance, but it's mostly just repeating the same thing until you get it right.",
		"sam.animation.skateboarding.3": "Yeah, if we ever get a skatepark, I'll be there like every day! It's a great way to burn off some energy.$h",
		"sam.animation.work.lowhearts.1": "Oh yeah, just mopping floors here at the JojaMart... really boring but at least I can listen to music on my headphones.",
		"sam.animation.work.lowhearts.2": "I got this job to earn some extra cash, pay's not great but it's something anyway.",
		"sam.animation.work.lowhearts.3": "Hey! I was really getting bored, come bug me whenever you're here!$h",
		"sam.animation.work.medhearts.1": "I just started wearing headphones and nobody said anything so it's all good!$h",
		"sam.animation.work.medhearts.2": "Ugh, I don't really like cleaning, but Shane doesn't have it any better. At least I don't have bathroom duty today!",
		"sam.animation.work.medhearts.3": "I'm really glad you come talk to me at work, it feels like such a waste of time even though I'm getting paid to be here.$s",
		"sam.animation.work.highhearts.1": "If you ever want to hire a farmhand, look no further! I'd way rather work for you than here, that's for sure!",
		"sam.animation.work.highhearts.2": "Shane doesn't really talk to me at work, just keeps his head down.#$b#We both hate it though, sure wish there were other jobs around here!",
		"sam.animation.work.highhearts.3": "If you're not busy when I get off work, let's go do something fun!$h#$b#Gotta end the day on a high note, y'know?",
		"sam.animation.saloon.Fri.1": "Seb tried showing me some tricks but it's a lot of visualizing and calculating, makes my brain hurt.",
		"sam.animation.saloon.Fri.2": "Man, Seb is like a pool ninja! He can get the ball to bounce off all the bumpers and still only hit the one he's aiming for.#$b#He says it's just angles and stuff. Nerd stuff, heh!$h",
		"sam.animation.saloon.Fri.3": "Wanna try a shot? You can just jump in and play for me, I don't mind since I'm getting clobbered anyway, haha!$h",
		"sam.animation.saloon.Fri.4": "Pool night is pretty fun even though I've never won a game. Just hanging out with friends is cool.#$b#I'll let Seb show off his shots for you, I definitely make him look good when it comes to pool.$h",
		"sam.animation.saloon.Fri.5": "I was about to go get a drink, what do you like? No worries, it's on me!$h#$b#We could play a PvP round of Prairie King, I'll take it easy on you!$h",
		"sam.rain.lowhearts": "It's really coming down out there! Bet you don't have to water your crops though.#$b#I'm s'posed to go find Vince, he escaped and is probably puddle jumping.$h",
		"sam.rain.medhearts": "It feels kinda badass walking through the rain with no umbrella, now I know why you always do that!#$b#Nothing can stop us! Urgh, my shoes are getting soaked... wanna go in and get some coffee?",
		"sam.rain.highhearts": "Hey @, where's your jacket? You're sopping wet!#$b#Let's go to the saloon and dry off, I'll get you a hot tea or something if you want.$h#$b#Maybe I'll try to beat my high score on Prairie King.",
		"sam.schedule.rain2.000.1": "Nothing like an ice cold Joja Cola on a sopping wet day, huh?#$b#Just kidding, what really sounds good is some coffee or maybe hot chocolate... mmmm...$h",
		"sam.schedule.rain2.000.2": "Not much to do when it's raining.$s#$b#Maybe fishing or exploring the mine, but I don't really like sitting around or going in the mines alone.#$b#Maybe I'll go bother Seb. You doing anything interesting today?$h",
		"sam.schedule.rain2.000.3": "Hey, running around in the rain today?#$b#Vince was splashing in all the puddles earlier, had to drag him back home before he was completely covered in mud, heh!$h",
		"sam.schedule.checkup.fall_11.000": "*sighs* I really don't like going to my doctor checkup, it's such a waste of time!$s#$b#I hope there're no needles this time. *shivers*$s",
		"sam.schedule.checkup.fall_11.001": "@! I'm so bored and this is taking forever... wanna hit the saloon later?",
		"sam.schedule.checkup.fall_11.002": "Oh yeah, Seb will tell you I'm a total coward when it comes to needles.#$b#You'd think with all the scrapes I've gotten skateboarding, it wouldn't be a big deal but who knows.",
		"sam.schedule.nightmarket.winter_17.000": "Do you see anything here you like, @?#$b#There's a lot of really interesting and weird stuff to look at! The submarine is pretty cool, want to take a ride into the deep?#$b#We can watch all those weird sea creatures swimming past the windows.$h#$b#Don't forget to grab a free coffee, it's really great!",
		//SAM FESTIVAL DIALOGUE
		"sam.festival.spring13.y1": "*ACHOO!!* Oh man, I'm dying...$s#$b#if I don't make it, please bury me with my guitar, okay?$s#$b#Maybe I'll live long enough to hunt some eggs... gotta keep Vince from wandering off.",
		"sam.festival.spring13.y2": "ACHOO!... AAAACHOO!!!...$8#$b#*groans* Ugh, every year I hope my allergies will get better but nope, the universe continues to conspire against me.$s",
		"sam.festival.spring24.y1": "Hey @! This dance thing is kinda lame, but maybe if you ask Seb to be your partner, he'll come back to life, ha!$h#$b#Hold on a sec... uh oh... *ACHOO!! ACHOO!! AAAACHOO!!*$8#$b#*SNORF* Oh man, so sorry...$s",
		"sam.festival.spring24.y2": "*SNORF* Ooof... Ugh, you have any tissues? Ah, thanks, you're the best!$h",
		"sam.festival.summer11.y1": "The Mayor told me to stay away from the soup pot. It's like he doesn't trust me or something!$h#$b#He even recruited Seb to keep me away... little does he know that Seb is actually on my side, hehe! You in?#$b#%Sam looks around, then pulls a bag out from under his shirt... How was he hiding that??#$b#I have this giant bag of gummy worms... cover for me, okay?$h",
		"sam.festival.summer11.y2": "After the epic failure of Mission Gummy Worm last year, I've come up with something easier to sneak in, hehe!$h#$b#This little bottle of Hellfire Incineration Sauce. Just a few drops is enough to fire up the entire pot!$h#$b#I got it from Shane, he lives for the heat. Now to wait for an opening...#$b#Oh hey, there's Seb, you two can create a distraction so I can sneak around the side...",
		"sam.festival.summer28.y1": "Hey @, join us on the 'cool' dock! I'm really tempted to sneak up and push Seb in the water, hehe!$h#$b#I'd feel bad if he got stung by a jelly though, so maybe not a great idea.#$b#%Sam looks away and back, suppressing a grin... he's definitely planning to ambush Seb.",
		"sam.festival.summer28.y2": "If you happen to see Vince too close to the edge would you grab him for me? I'm supposed to watch him but I need backup.#$b#Mom and Dad are totally distracted at the moment, heh! Being the designated babysitter is exhausting!#$b#Don't worry, I won't try to sneak up on Seb this year, he's too quick for me. Um... maybe you could distract him for a second? Heehee!",
		"sam.festival.fall16.y1": "Hey @! Wanna try some of the games? Seb says they're all rigged, but it's still fun to play.$h#$b#I'm gonna help Vince get some good prizes, come join us if you get bored!$h",
		"sam.festival.fall16.y2": "Have you gotten very many Star Tokens yet? I'm going for a big prize, like that giant stuffed dragon, Vince would LOVE that!$h#$b#Want some snacks? I'll grab some for all of us to share.",
		"sam.festival.fall27.y1": "Wow, @, you look amazing in that costume! Kinda wish I would have dressed up too.$h#$b#Want to try the maze? Don't worry, you can take out any monsters we might find.#$b#Uh, that sounded pretty lame, I mean I think it's really cool how you kick butt in the mines, hehe...",
		"sam.festival.fall27.y2": "@, great costume! Maybe we should take the maze on as a group, safety in numbers!$h#$b#Oh, and don't forget the snack stand, and check out those weird monsters. Seb's skeleton buddies are here again.$h",
		"sam.festival.winter8.y1": "Hey @! I have a huge stockpile of snowballs for the fight, wanna join me?$h#$b#I WILL have my revenge, Seb's never gonna see it coming!$h",
		"sam.festival.winter8.y2": "*gasping for breath* Did you see that shot?? It was amazing! I totally nailed Seb in the back of the neck!$h#$b#%*Seb's voice: SAM! When I catch you, you're a DEAD MAN!!*#$b#OH CRAP! Gotta go! I'll be back later... I hope!$8#$b#%After a bit, Sam returns, covered head to foot in snow.#$b#*breathless* Oh man, I sure paid for that one. Worth it to see the look on Seb's face though! *shivers*$h#$b#Oh Yoba, I'm freezing! I'll be at the bonfire drinking hot chocolate if you want to hang out.$h",
		"sam.festival.winter25.y1.lowhearts": "Happy Festival of Presents! Can't wait to dig into this food! You can hang out with us or make the rounds, whatever you like.$h",
		"sam.festival.winter25.y1.medhearts": "Happy Festival of Presents! Can't wait to dig into this food! I found something really great for Vince this year, he's super excited.$h#$b#You can hang out with us or make the rounds, whatever you like.",
		"sam.festival.winter25.y1.highhearts": "Happy Festival of Presents! I ah, got you something.$h#$b#It's not much but I hope you like it.#$b#%Sam pulls a chain out of his pocket, the pendant is one of his guitar picks.#$b#It's the guitar pick I was using when you first came over and I asked you what kind of music our band should play.#$b#It's just my way of saying thanks for being a friend and helping us out.$h",
		//SAM SVE
		"sam.SVE.ArchaeologyHouse_44_13.1": "Hey, @! This is so much better than working at the dumb JojaMart, it's great Gunther hired me here at the museum!$h",
		"sam.SVE.ArchaeologyHouse_44_13.2": "Some of this old stuff is really weird, like that ancient doll... sometimes I swear it's watching me. *shivers*",
		"sam.SVE.ArchaeologyHouse_44_13.3": "You found pretty much all of this stuff on display, right? I bet you have some good stories! C'mon, tell me one, it'll make the time go by faster.$h",
		"sam.SVE.ArchaeologyHouse_44_13.4": "I've been listening to Gunther talk about all this historical stuff, I think I'm learning quite a bit at this job.$h",
		"sam.SVE.ArchaeologyHouse_44_13.5": "There sure are a lot of books in here, it takes forever to dust them all but it's still better than mopping and cleaning bathrooms. I've read some of them, Gunther doesn't mind.$h",
		"sam.SVE.SamHouse_7_15": "Penny and I are getting a bite to eat at the saloon, wanna join?$0",

//SEBASTIAN DAILY
		"sebastian.special.introduction": "Oh, um hi... you must be the one who inherited that old farm, right?#$b#My mom mentioned someone was moving in there. Oh, Robin's my mom.#$b#And I-I'm... Sebastian. Sorry, I forgot you have no idea who I am.$s#$b#... Um, I'm sure you have a lot to do so... it was... n-nice to meet you.$s",
		"sebastian.daily.0.1": "How's it going, @? Um... I'm usually pretty busy with work, but sometimes you can catch me at the lake.",
		"sebastian.daily.0.2": "'Sup, @? Livin' the dream here in the basement.#$b#*sighs* Sorry about that, I get sarcastic sometimes... Demetrius hates it since he doesn't really get sarcasm.$s",
		"sebastian.daily.0.3": "...#$b#%Sebastian is staring off into space, he seems lost in thought.#$b#@!... Oh, sorry, I zoned out there, did you ask me something?$s",
		"sebastian.daily.0.4": "@... yeah I uh... not much going on over here, pretty normal. See you around.",
		"sebastian.daily.0.5": "Hey, do you play pool?#$b#If you come by the saloon, I'll kick Sam off the table and we can play a game.",
		"sebastian.daily.0.6": "Hi @, Sam and I practice for the band on Saturdays at his place. Nothing worth hanging out for, but whatever.",
		"sebastian.daily.0.7": "By the way, be careful in the mines, there's a lot of nasty crap down there. The carpenter's shop has a med kit if you ever need it.",
		"sebastian.daily.2.1": "Go ahead and flip through my comics when you're in my room, they're all for reading.#$e#I let Sam borrow them all the time. If you happen to be at his place and see one of my comics lying around, would you grab it for me? Thanks.$7",
		"sebastian.daily.2.2": "... I really need to stop smoking, I can't expect anyone to want to hang with me when I smell like smoke...$s#$b#Oh, hey @... just thinking out loud.#$b#My mom is always nagging me about my smoking habit which makes me not want to quit, but to be honest, she's right.",
		"sebastian.daily.2.3": "Sam is begging me to go play arcade games with him... *sighs*$s#$b#I kind of stink at those kinds of games, anything requiring quick reflexes is not my thing.#$b#I guess that's why I like pool, it's more of a strategy and thinking game.",
		"sebastian.daily.2.4": "If you come in and I'm wearing headphones, don't worry about interrupting me, I'm not in a meeting or anything.#$b#I'm just listening to music or working on a song.#$b#... Yeah I uh... sing for the band, Sam and Abby are backup. I've been told I'm a decent singer, but whatever.$h",
		"sebastian.daily.2.5": "@... want to join us at the saloon tonight? I can give you some pool lessons if you want.#$e#Abigail will probably be there just watching as usual. She really needs someone else to talk to.",
		"sebastian.daily.2.6": "Oh hey, @. You know you can come by any time to hang out, read my comics, play games or whatever.#$b#I dont mind since you're quiet and its nice to have a buffer for Sam when hes here.",
		"sebastian.daily.2.7": "I just got caught up watching that TV show you recommended. It's great so far.#$b#The next episode comes out in a couple days, you can come by if you want, Sam and Abby are usually here so we can all watch it together.$7",
		"sebastian.daily.4.1": "So... how are you liking living here?#$b#I used to hate it but I guess it's not completely terrible.",
		"sebastian.daily.4.2": "Hi again, @. You must really like the hike up here.#$b#Anyway, I don't mind talking with you so stop by whenever.$7",
		"sebastian.daily.4.3": "If you want, I can take you out for a ride on my motorcycle.#$b#Sam doesn't really like to ride, he complains about having to hang on to me, heh.#$e#... It doesn't bother me if you want to come along.",
		"sebastian.daily.4.4.1": "Have you had a chance to read the comic I lent you?",
		"sebastian.daily.4.4.2": "Cool, what did you think?",
		"sebastian.daily.4.4.3": "It's great, the world building is next level!",
		"sebastian.daily.4.4.4": "Yeah, it's wild but it works, right?$h",
		"sebastian.daily.4.4.5": "It's pretty good, kind of confusing though.",
		"sebastian.daily.4.4.6": "Fair, the author does tend to get lost in the details. I think I have another series you'd like better if you want to try it.",
		"sebastian.daily.4.5": "Y'know, @, I appreciate that I can text you stupid memes and you respond... I hope you really like them and aren't just being nice?$s#$b#... Oh good, I suddenly thought I might be annoying you with those... Thanks for listening to me, even my lame meme-chat.$h",
		"sebastian.daily.4.6": "I was thinking... I want to learn how to cook, just basic stuff.#$e#Maybe I'll ask Gus to help me, it could be interesting to do something different.$7",
		"sebastian.daily.4.7": "@, have you been mining a lot lately? You have some fresh scrapes on your arms.#$e#Is it okay if I clean those for you? You really don't want to get an infection from all the freaky crap that's down there.$s",
		"sebastian.daily.6.1": "You're almost inspiring me to hit the gym and start working out, you and Alex really make me look like a twig.#$b#Probably a good idea to at least attempt to be healthy.",
		"sebastian.daily.6.2": "Have you read the new Cave Saga X?#$b#You liked it? Cool... The writing for that series is so good.$h#$b#Its nice to know someone else who reads it, if you want we can talk about the story and come up with theories about where its going.$h",
		"sebastian.daily.6.3": "Do you ever feel like people can see through you, you know... like you're transparent... like a glass frog.#$b#Oh um, yeah, it's a real thing. I dunno, maybe it's just me, I always feel self-conscious around people.$s",
		"sebastian.daily.6.4": "If you could have any animal in the world as a pet, which would you choose?$7#$e#... Me? Well, gotta stick with the theme, right?#$b#There's this giant type of frog that's about the size of a small dog... Can you imagine taking a frog for a walk? Haha!$h#$b#Not sure how you'd keep a collar on him though... huh.",
		"sebastian.daily.6.5.1": "Hi @, I was hoping to run into you.",
		"sebastian.daily.6.5.2": "Ready to watch me destroy Sam at pool tonight?$h",
		"sebastian.daily.6.5.3": "For sure! I love watching you boys play.",
		"sebastian.daily.6.5.4": "Haha! Don't tell Sam that, he'll just show off for you... or maybe do, it could be entertaining!$h",
		"sebastian.daily.6.5.5": "*smile* Oh? You want to show off for me?",
		"sebastian.daily.6.5.6": "N-no, pfftt stop that... it's just fun hanging out with you and Sam.$h",
		"sebastian.daily.6.6": "I had a strange conversation with Demetrius today...#$e#He asked if I wanted to help him with some experiment he's working on. It actually sounded kinda interesting.#$b#... I guess I should give him a chance, he's never really tried to connect with me before.",
		"sebastian.daily.6.7": "I was just thinking, I haven't asked you much about what you did before you moved here.#$b#Want to hang out and tell me about it? I know you came from Zuzu City and worked in a stuffy office, but that's about it.$7",
		"sebastian.daily.8.1": "Remember to come by if you ever get scraped up in the mines, I don't mind patching you up and it keeps me in practice.#$e#Be careful down there though, you stay really late sometimes and I kind of get worried about you.#$b#I'd hate to have to drag you out of there myself.",
		"sebastian.daily.8.3": "Ugh... Abigail cornered me earlier, was going on and on about her little family drama...$a#$e#Sorry @, sometimes I don't have any patience for that, definitely in a slump today.$s#$b#If you have time, want to just hang out? I'll admit, sometimes I need the company.",
		"sebastian.daily.8.4": "How are things going on the farm? If you're looking for new projects, I have two words: frog sanctuary. Just sayin'$h#$e#Not that you have to build one, but if you did, I'd help you take care of the little guys.",
		"sebastian.daily.8.5": "It's saloon night yet again, are you coming by?#$e#Great! I'll spring for dinner so no need to worry about eating before you come.$h",
		"sebastian.daily.8.6": "You know Gus has been teaching me some basic cooking skills.#$b#Will you be my taste testing guinea pig? I promise it won't be horrible, I'll make sure whatever I give you is at least edible, heh!$h",
		"sebastian.daily.8.8": "Oh man, I'm regretting choosing to start working out... Alex worked me hard today and now I can barely move. Hey now, don't laugh, I'm suffering here...#$b#Sure, sure, no pain no gain or whatever.",
		"sebastian.daily.8.9": "Hey @. Come here for a sec, I want to show you something.#$b#I've started working on coding my own game, it's a life simulator thing. If I finish it, maybe I can make some money and not need to freelance as much.$h#$e#Here, tell me what you think of this character dialogue, I might need some help with the conversational writing.$7",
		//SEBASTIAN SEASONAL
		"sebastian.daily.summer4.1": "It's so stupid hot here in summer... Did you know there's a type of frog that actually freezes solid in the winter and thaws back to life in the spring?#$b#Kinda wish I could do that and skip summer... I'd need a really big freezer though.#$e#Fun frog facts, yeah I know... total nerd.$s",
		"sebastian.daily.summer4.2": "Do you like going to the beach, @?#$b#I try to avoid it in the summer when it's not raining, too crowded and hot.",
		"sebastian.daily.summer4.3": "What's up, @? Wanna grab some ice cream at the stand? It's on me. It's way too hot, but... sometimes it's worth it for the ice cream.#$e#Sam will probably be around there and we can bug Alex as a bonus.$7",
		"sebastian.daily.summer8.1": "Remember that thing I told you about the frog that can survive being frozen?#$b#I'm pretty envious of that dumb frog right now. Are you heading to the beach?#$e#I dunno, I really hate being in the sun and it takes forever to slather on that much sunscreen.",
		"sebastian.daily.summer8.2": "If you ever want to go fishing in the evening, I'll join you.#$b#It's nice just hanging out by the lake listening to the frogs and insects.#$e#We can talk about the latest Cave Saga X storyline and come up with theories about where the story is going.$h",
		"sebastian.daily.summer8.3": "This heat is insane, but if you want we can go grab an ice cream at the stand.#$b#If Sam's not there already, we can pick him up on the way over.#$b#He'd be really upset if we went for ice cream without him, heh!$h",
		"sebastian.daily.summer8.4": "It's pool night tomorrow... you know, it's too hot to even think about dancing, though Mom and Demetrius always dance anyway.$h#$b#How about I show you some new trick shots? I taught you the basics but there's a lot more I can show you.$h",
		"sebastian.daily.summer8.5": "Want to play a round of pool tonight? You're getting pretty good, might give me a run for my money someday, heh!$h#$b#I bet Sam is all pouty that you can beat him too. Of course, he can still thrash us both at video games so I guess it's all even.#$e#It does make sense when you think about it, you've seen the way he plays that guitar. His hands can really fly.",
		"sebastian.daily.summer8.6": "Oh yeah, Mom was asking if you need any upgrades to your house, I think she's hoping you'll need more room soon.#$b#Pfft... you should see the look on your face!$h",
		"sebastian.daily.summer8.7": "Hey, how are you handling the heat? I want to just hang out in Gus' walk-in fridge until it's over.#$b#... Nah, I usually keep my hoodie on anyway, no real reason, it's just comfortable and I feel weird without it.#$e#Sam is just the opposite, he'd go shirtless all summer if Lewis would let him, heh!$h",
		"sebastian.daily.fall4.1": "The cooler weather is perfect for movie watching parties.$7#$b#We can get the gang together and just hang out and eat junk food.",
		"sebastian.daily.fall4.2": "Hmm... @, are you growing pumpkins this year?#$e#It's pretty fun carving them for Spirit's Eve.",
		"sebastian.daily.fall6.1": "All these falling leaves are beautiful, aren't they?$7#$b#I guess I'm feeling sentimental, heh... Tell me what's up at the farm. Any good stories?",
		"sebastian.daily.fall8.1": "...#$b#Oh, sorry... I got distracted for a minute... not thinking about much, just... the future I guess. I get kind of introspective in the fall.#$e#I used to want to leave the valley when I had enough money, but my goals have changed.#$b#I think the valley is starting to feel like home.",
		"sebastian.daily.fall8.2": "Hey, you're shivering... the cooler weather can sneak up on you like that in the valley.#$e#That's why I have all these hoodies. Want to go warm up at the saloon?",
		"sebastian.daily.fall8.4": "Are you dressing up for Spirit's Eve? I usually do, just low-key since most people aren't into that.#$e#You are? Cool. Maybe I'll break out one of my better costumes this year, it's been a while since I was inspired to do anything like that.$h",
		"sebastian.daily.fall8.6": "I know farm work is light in winter and it's a great time to stock up on ores...#$b#But please don't stay too late in the mines, I'm always worried you're going to pass out from exhaustion down there.$s#$e#... Listen, I live really close and you know I always have a med kit handy, just... be careful. I don't want to see you hurt.",
		"sebastian.daily.winter2.1": "Hey, I'm just hanging out watching the snow fall...#$e#You can join me if you want, it's so nice and peaceful by the lake in the winter.$7",
		"sebastian.daily.winter4.1": "Hey, I'm just hanging out watching the snow fall...#$e#You can join me if you want, it's so nice and peaceful by the lake in the winter.$7#$b#Did you know every snowflake is different? It's really amazing to think about...",
		"sebastian.daily.winter6.1": "The bathhouse is really nice in the winter, I know it seems strange that I would go there, but at night it's empty and I can enjoy the quiet.",
		"sebastian.daily.winter8.2": "You've been mining a lot lately, I'm starting to feel like your personal nurse.#$e#... D-don't get the wrong idea, I really don't mind, I'm used to it living this close to the mines.",
		"sebastian.daily.winter8.3": "I'll be heading out on the bike later, it's freezing but there's something about the cold wind that's invigorating on winter rides.#$b#Yeah, I'll be careful, the roads aren't too bad today.",
		"sebastian.daily.winter8.4": "Be sure to bundle up in the winter, don't want to get frostbite or something. If you ever need to warm up, just stop by, I'll make coffee.$7",
		"sebastian.daily.winter8.5": "Oh, I was hoping to see you, I got a bunch of new Solarion Chronicles scenarios.#$b#Since everyone seems to have a little extra time in the winter, I thought we could all meet up and play through them.$h#$e#I actually really like our group games, I guess I'm getting used to being a little more social. Just a little, heh!$h",
		"sebastian.daily.winter8.6": "Do you want to join me, Sam, and Abby to build a snowgoon army sometime?$h#$e#Let's build it on your farm, okay? So Demetrius doesn't get annoyed.#$b#Not sure what he has against snowgoons, but there's some bad blood there, heh!",
		//SEBASTIAN DATED
		"sebastian.daily.spring_3": "Hey. Um... how's the farm thing going? Seems like a lot of work. I'm not much for outside labor.",
		"sebastian.daily.spring_5": "Hi @... Oh, my work is mostly computer stuff... there's not a lot to tell.",
		"sebastian.daily.spring_12": "Has Abigail talked your ear off about the egg hunt tomorrow?#$b#She really loves it, Sam always joins in too even though he's sneezing himself stupid the whole time with his allergies, heh.#$e#... Me? It gets really crowded in the town square and triggers my anxiety... ugh.$s#$e#I'll be there, in a quiet corner away from the crowd.",
		"sebastian.daily.spring_16": "Oh hey, @, I was about to head over to the lake and see how the tadpoles are growing...#$b#Hopefully there will be a lot of frogs this year, they help keep the flies in check during the summer.#$e#And listening to the frog song at night is really soothing. Living near a lake has it's advantages I guess...",
		"sebastian.daily.spring_23": "Ugh... Tomorrow is the worst event of the year by a mile, the annual humiliation-fest. Why does that thing even exist?#$b#I only go because my mom nags me until I give up. Just wait and see how stupid I look during the dance.$s#$b#Sam doesn't love it since he's sneezing his head off the whole time, but he might dance with you if you ask him.#$b#Alex? He and Haley are sort of a thing... I think... not really sure what's up with that actually.",
		"sebastian.daily.spring_28": "You haven't talked to Sam yet today, have you?#$b#If you see him, tell him he better bring my comic back or he's a dead man.$a#$b#He keeps borrowing my stuff then losing it, or returning books with the corners bent.$s",
		"sebastian.daily.summer_3": "Ugh... I hate going for a checkup every year, such a waste of time...#$b#Doc Harvey will just say the same things he always does, 'stop smoking, get more sleep and less screen time'.$s#$b#I mean, yeah he's right about the smoking and I'm already working on that, but I need the computer to work and live...",
		"sebastian.daily.summer_7": "Hey @, how's it going?#$b#I've been texting Sam, but he's ignoring me. It's kind of weird, I guess I'm usually the one that does the ghosting.$a",
		"sebastian.daily.summer_9": "Did you hear about the Luau coming up? Everyone chucks something into a giant pot and it somehow becomes edible soup.#$b#It's actually amazing no one's gotten incredibly sick from that, but whatever.#$b#It could be funny if someone put something really weird in there.#$b#I'm pretty sure it's hot enough to kill most germs anyway... food for thought, right? Heh... yeesh, forget I said that.$s",
		"sebastian.daily.summer_10": "Today's Maru's birthday... You guys seem to get along so she'd be happy if you got her a present.#$b#... I actually remembered to get her something this year, you must be a positive influence. It's only some strawberries, but she loves those.#$b#She seemed overly happy, kinda made me feel bad for usually forgetting to get her anything.",
		"sebastian.daily.summer_12": "You and Sam seem to get along really well, he's a decent guy if you can handle how loud he is.#$b#I guess Alex is okay if you can get him to stop talking gridball for more than five minutes.#$b#Abby's super into some weird occult crap, not sure what that's all about. Haley's... a cheerleader. That should tell you everything about her.#$b#Oh, yeah, I mean I do kind of know what's going on around here, not that I really care that much.",
		"sebastian.daily.summer_17": "Since it's Sam's birthday, I'll be heading over to his place with something for him.#$b#Ugh... to be honest, I... forgot to get him anything. If I don't give him a present he'll hound me about it for weeks.$s#$b#Wanna swing by the saloon with me? I'll grab him a pizza.",
		"sebastian.daily.summer_20": "Have you checked on the tadpoles at your farm?#$b#They should have their legs and lungs by now and be coming out of the water...#$e#It's amazing how quickly they change, I never get tired of watching them every year.$h#$e#If you come by the lake in the evening, the adults are really singing.",
		"sebastian.daily.summer_26": "*sighs* ... Sorry, it's just one of those days, you know... I hate that I bring you down like this sometimes.$s#$b#... Don't worry about it, it comes and goes. I'll probably just hole up and read or something later.",
		"sebastian.daily.summer_27": "You know, there's this frog that has no lungs, it breathes entirely through its skin.#$b#Too bad I can't do that, better start taking care of my lungs.$s#$b#Yeah, fun frog facts with Seb... heh...$s",
		"sebastian.daily.summer_28": "Oh hey, @, don't forget about the Moonlight Jellies tonight!$h#$b#The glow of the jellyfish and the water reflections under the dark sky are so... ethereal.$7",
		"sebastian.daily.fall_3": "On the back trail I picked up some wild plums and hazelnuts. I'll stop by George's house and drop them off.#$b#They aren't his favorites, but he still seems to be happy when I hang out and listen to his stories.$7",
		"sebastian.daily.fall_15": "Oh yeah, tomorrow is the Stardew Valley Fair...#$b#Mom designed some new wood-working pieces for her display, Sam and Abby like to play the games and hang out with friends they don't see much...#$b#I'll be around. *shrugs*",
		"sebastian.daily.fall_20": "Tomorrow's my mom's birthday and she's pretty excited, Maru and Demetrius are cooking her favorite spaghetti dinner.#$b#I hope she likes my gift anyway, the family drama seems to be better now at least.$7",
		"sebastian.daily.fall_26": "Yes!! Tomorrow is my favorite festival. My skeleton buddies are always there and the wizard guy does something to make the maze extra creepy.$h#$b#It really feels like you've been transported to another place.#$e#Plus, I have a real jump scare planned for Sam.$7",
		"sebastian.daily.winter_7": "You want to help build a barricade for the snowball fight tomorrow? Oh, I mean the Festival of Ice... Sam and I don't fish so we just turn it into an epic snowball battle.$h#$b#Just be careful you don't get a snowball in the back of the neck, you don't want that sliding down your back, I can tell you!#$b#And if you get cold, there's hot chocolate at the stand.$7",
		"sebastian.daily.winter_9": "You know it's my birthday tomorrow, right...?$s#$b#I really don't like being the focus of everyone's attention so please... no party...#$b#Sam and Abby threw me a surprise party once... 'once' being the operative word here, it never happened again.$a",
		"sebastian.daily.winter_10": "Oh hey, thanks for coming by on my birthday. Mom made a massive cake, not sure why really, but please take a slice or three.$h",
		"sebastian.daily.winter_15": "Hey @, has Sam recovered from his 'sneak attack'? Hehe... it's kind of cute how he thinks he can actually sneak up on me.$7#$b#I did totally bury him so I guess I'll get him a maple bar or something later.",
		"sebastian.daily.winter_20": "So, have you gotten something for your 'secret friend'?#$b#... I kinda wonder who pulled my name. Don't count on getting anything good, I've gotten some pretty lame stuff, like socks, a mug, once I got half a sandwich.$s",
		"sebastian.daily.winter_22": "You know how I've been training at the gym with Alex... it's been going pretty okay, even though I'm so sore I can barely move.$s#$b#I've realized I need to start taking care of myself, to be honest, exercise does seem to help.",
		"sebastian.daily.winter_26": "... Oh, um, yeah you're welcome, I'm glad you liked the figure.$7#$b#Just my way of saying thank you for spending time with me and being a good friend.",
		"sebastian.daily.winter_28": "Hey, @, Happy New Year and all that. It's really just another day, not sure why people make a big deal out of it.#$b#Anyway, it has been a pretty interesting year, I'm really glad you moved here.#$b#You're a great friend. I think... things are looking up, for all of us.$h",
		//SEBASTIAN DATED Y2
		"sebastian.daily.spring_1_2": "Ughhhh... I think I drank too much last night...$s#$b#Happy New Year... I'm going back to bed.#$b#You can come by later if you want, but no guarantees I'll be conscious.$s",
		"sebastian.daily.spring_12_2": "Tomorrow's the egg hunt bonanza, Abby's super excited as always.#$b#I keep thinking she'll get over it but she never does, it really brings out her competitive side.#$b#Oh well, I guess it's her thing like me and Spirit's Eve.#$e#I'll show up, someone's got to make fun of Sam and his sneezing fits, heh.$h#$e#I'll be somewhere away from the chaos as usual.",
		"sebastian.daily.spring_23_2": "Oh, don't even bring it up. I'm hoping if I ignore it, tomorrow won't happen. *sighs*#$b#Yeah, yeah, I'll be at the annual jackass parade, just don't expect me to be cheerful about it.$s",
		"sebastian.daily.summer_3_2": "Oh boy, back to see the doc again tomorrow... sorry, sarcasm came out there.#$b#At least he'll be happy I've cut back on smoking, gotta admit I do feel better when I smoke less.#$b#And going to the gym is helping with my horrible gamer posture, add that to the plus side.$7",
		"sebastian.daily.summer_7_2": "Get ready, here comes another fun frog fact with Seb! Haha!$h#$e#I ran out of clean underwear the other day and was thinking... frogs completely shed their skin about once a week.#$b#No laundry, right?? Then they eat the old skin, so bonus snack!$h#$b#Okay, that was kinda gross, but you gotta admit it's efficient.  *grins*$h",
		"sebastian.daily.summer_10_2": "Oh, don't forget Maru's birthday today, she really loves when you come by and visit.#$b#I've been working on being a better brother to her, I remembered to get her something good for her birthday this year and we're going out for dinner.$7",
		"sebastian.daily.summer_28_2": "Oh hey, @, don't forget about the Moonlight Jellies tonight!$h#$b#I actually prefer hanging with the gang for these festivals, it seems so long ago that I just wanted to be alone all the time.",
		"sebastian.daily.fall_15_2": "Mom has been spending all her time getting ready for the fair tomorrow, she's pretty excited about it this year.#$b#My offer stands to help you out with your display if you need anything.",
		"sebastian.daily.fall_26_2": "All ready for the festival tomorrow? I've pulled out my costumes but haven't decided which one I'll go with yet.$h#$b#Wonder what the maze will be like this year, I heard the wizard guy has been changing things up so that's cool.$h#$b#Are you dressing up...? Nice! I got Abby and Sam to go along this year too, let's all get drinks together afterward.",
		"sebastian.daily.winter_7_2": "Hehe, time to bury Sam at the snow war tomorrow, it's one time where being smaller is an advantage.$h",
		"sebastian.daily.winter_10_2": "Oh hey, thanks for coming by on my birthday. Mom has her usual giant cake so don't miss out on that.$h#$b#... Sure, a game and movie night sounds good, I'll be there.[220]$h",
		"sebastian.daily.winter_28_2": "Oh yeah, Happy New Year again. I'm glad we're all here and it really was a good year.$h#$b#Y'know, I've decided I'm happier here in the valley than I ever would be in the city.#$b#With the internet, it really doesn't matter where I live so staying here with friends is the obvious choice.$7#$b#%Seb smiles, not his usual half smile, but an actual smile.",
		"sebastian.daily.Sat4_inlaw_Sam": "How's it going with all Sam all the time? Hehe!$h#$b#Really though, he's definitely happy and actually calmer now that you're married.#$b#He's always been insecure about the future and being with you makes him feel safe.#$b#I'm glad for him, he's a great friend and deserves to be happy.",
		"sebastian.daily.Fri4_inlaw_Sam": "Are you and Captain Static Cling coming to pool night?#$e#I won't lie, I actually miss that dumb goof being in my room all the time.$s#$b#Feel free to come by whenever, you don't have to hang out all day, just say 'hey'.",
		//SEBASTIAN RAIN SCHEDULE EVENTS
		"sebastian.rain.lowhearts.1": "If youre lucky, you might see a frog in this weather.#$b#Um... yeah... I've kinda always liked frogs.",
		"sebastian.rain.lowhearts.2": "The sound of the rain is nice, I've always liked this kind of weather. Makes me feel more alive I guess.",
		"sebastian.rain.lowhearts.3": "I've heard from Willy that fishing is good in the rain, sometimes he talks to me out on the docks.",
		"sebastian.rain.medhearts.1": "It's nice looking out toward the horizon from the docks when it's raining like this.#$e#Maybe you could join me sometime, I wouldn't mind the company.$s",
		"sebastian.rain.medhearts.2": "Hey @, you could get sick running around in the rain like that... come hang out in my room until it lets up, Sam's usually there too.$7",
		"sebastian.rain.medhearts.3": "How did you get caught in the rain again with no jacket?#$b#Here, take this hoodie and warm up... don't worry about it, I have plenty more. At least I know where they are if I want them back.",
		"sebastian.rain.highhearts.1": "Oh man, you're soaked! You should get out of the rain for a while.#$b#We can play a round of Solarion Chronicles or I can show you some of the game code I've been working on.$h",
		"sebastian.rain.highhearts.2": "@, I know you want to get things done, but why not take a break when it's raining?#$b#Inside it's dry and I have a new song I can play for you, I wanted to see what you thought before I show Sam.$h",
		"sebastian.rain.highhearts.3": "It's way too chilly to be running around without a jacket, come on, I can make some coffee or hot chocolate.#$b#If you're not too busy, want to hang out and watch a movie?$h",
		"sebastian.reaction.dating_Sam": "Hey, I'm really glad you ended up with Sam and not somebody else like Shane or Alex.#$b#At least with Sam, I know you'll still hang out with me and I won't lose you as a friend.$s#$b#He better treat you right, I've punched him before and I'm not afraid to do it again.",
		"sebastian.reaction.dating_Sam_memory_oneday": "Sam is so ridiculously excited you agreed to go out with him, it's pretty entertaining.$h#$b#It still kind of surprises me you went for him, I mean he's not bad looking or anything, but he can be pretty annoying sometimes.#$b#Maybe being with you will mellow him out.",
		"sebastian.reaction.married_Sam": "Hey, um... now that you and Sam are married... don't be a stranger, okay?$7#$b#I'll miss you guys hanging out all the time, even though Sam is so annoying sometimes.$s#$b#Remember my door is always open for both of you.",
		"sebastian.reaction.dating_Alex": "Hey, uh... Alex mentioned he asked you out. Actually he sort of busted into my room and yelled it, heh.#$b#He's a good guy really. He talked to me some, we have a few things in common, oddly enough.#$b#You're good for him, he needs someone patient and stable in his life.",
		"sebastian.reaction.married_Alex": "Nice wedding, I just hung out at the back but it was good. Someone had to give Sam a wad of tissues so it all worked out.#$b#Come by for a round of Solarion Chronicles sometime, it's actually pretty fun having you and Alex there, he's good at the warrior role.$7",
		"sebastian.reaction.GreenRain": "Hey @! What's it like out there? Any sudden bursts of strength or speed? Hehe...#$b#Demetrius is outside in an encounter suit and my mom's totally freaked out, mainly because he won't listen to her.$7",
		"sebastian.reaction.GreenRain.2": "I was hoping this freaky green rain would happen again, too bad it doesn't actually give superpowers, heh!$h#$b#Let's go out and see what's up at the lake, last year the tadpoles grew a couple week's worth in one day!$7",
		"sebastian.reaction.birthdaygift.positive": "Hey thanks, @! You didn't have to get me anything, this is really cool though. Thank you!$h",
		"sebastian.reaction.firstvisit.railroad": "I'm glad the path to the railroad tracks is open again.#$b#I like going up there for a change of scenery.#$e#... When trains go by, sometimes stuff falls off the open cars. When we were kids, Sam and I would run up here and see what we could find.$h#$b#Oh, there's the bathhouse too. It's nice for relaxing in the evening when it's not busy.",
		"sebastian.reaction.fair.purpleshorts": "@!! I know you didn't win but... that was probably the funniest thing I've ever seen at any festival!$h#$b#The look on Mayor Lewis' face, it was pure gold, haha!$h#$b#I'm guessing those shorts were his...? They're his SPECIAL shorts?? He said that?!$h#$b#Where did you get them, c'mon spill it, I'm begging you!$h#$b#Sam is so going to flip when he finds out you pulled the prank of the year and didn't tell him!$h",
		"sebastian.gift.80": "$c 0.5#Hey thanks! I can definitely use this, did you know you can make cool stuff with quartz?$h#Oh nice, hold the stone up to the light and you can see the colors in the crystals. This one really glitters, like stars... thanks!$h",
		"sebastian.gift.74": "This is... incredible, just look at the colors and refraction. Are you sure you want to give this to me?#$b#Th-thank you! I could stare at this for hours... Er, well, minutes. I could stare at it for... awhile.$7",
		"sebastian.gift.84": "$c 0.5#This is so cool! Heh, um, yeah... that was terrible, but I do love this stone... Thanks @!$h#I wonder if there are any good legends about these stones... maybe I'll ask George, he knows a lot of those old stories.$h",
		"sebastian.gift.236": "$c 0.5#Thanks @, this is my favorite... mmmm so good! It reminds me of sitting by a warm fire in the fall.$h#Oh hey, did you make this yourself...? It tastes amazing, like Mom's but different... you made it your own.$h",
		"sebastian.gift.227": "$c 0.5#Oooh sashimi! This is amazing, you did a great job... you must have some real knife skills.$h#Mmmm sashimi is so addictive, something about the texture and simplicity of it is appealing to me. I can tell you spent a lot of time on this.$h",
		"sebastian.gift.267": "$c 0.5#Flounder is such a weird fish, I really like it... something about the eyes is so creepy cool.$h#Thanks! These fish have amazing camouflage... I kind of feel like them sometimes, just blending into the background.",
		"sebastian.gift.281": "$c 0.5#Oh thanks! I really needed a caffeine boost. Mmmm... this is great, you brewed it just right.$h#There's nothing like a good cup of black coffee... This is excellent, just the right balance of flavor.$7",
		"sebastian.gift.305": "$c 0.5#Woah... This egg speaks to me... heh, I'll keep it on my desk where I can see it while I work.$h#Hmm... I wonder, if I put this under my pillow, will it hatch? Hehe... only one way to find out.$h",
		"sebastian.gift.stardroptea": "Wow, this is a great brew... I'm usually more of a coffee guy but this tea is excellent. Thank you, @!$7",
		"sebastian.gift.373": "Oh wow, this is fantastic! You know I love fall and this reminds me of Spirit's Eve... and it's real gold, right? Thank you, I won't forget this!$h",
		"sebastian.gift.279": "Thanks! I love rock candy, ooooh so sweet... this'll keep me going for hours.$h#$b#I know this is kind of hard to get, thanks for thinking of me.",
		"sebastian.gift.797": "Wow, I don't know what to say. You're just giving this to me?$7#$b#These are so rare, thank you @... really, you're always giving me the best gifts...$7",
		"sebastian.special.flowerdance.decline": "I'm sorry, I already told Abby I'd dance with her... S-sorry.$s",
		"sebastian.special.flowerdance.accept": "Uh, sure, alright I guess... let's do this.#$b#Heh... maybe this festival isn't so bad after all.$7",
		"sebastian.strings.rain.dock.lowhearts.1": "@... Did you come out to fish? Don't mind me, I'm just thinking about random things so I won't bother you.",
		"sebastian.strings.rain.dock.lowhearts.2": "Hi... um... usually no one else is out here when it's raining. I just like the feeling of the rain and the fog over the water.",
		"sebastian.strings.rain.dock.lowhearts.3": "It's pretty cold out here, you should hang out somewhere less gloomy... y'know, like the saloon.",
		"sebastian.strings.rain.dock.medhearts.1": "Oh, hey @... Usually there's no one else out here in the rain...#$b#I'm used to being alone, but now that you're here it's nice to have company... I'm glad you came.$7",
		"sebastian.strings.rain.dock.medhearts.2": "@... Did you come out to fish? Don't mind me, I'm just thinking about random things so I won't bother you.#$b#If you do want to talk though, I'm happy to listen.$7",
		"sebastian.strings.rain.dock.medhearts.3": "The sound of the rain on the docks and the metal shack roof is nice, don't you think?#$b#I like to hang out here and just listen. Usually I'm alone, but... I think I prefer it when you're here too.$7",
		"sebastian.strings.rain.dock.highhearts.1": "Oh, hey @... I'm glad you're here, come hang out with me...#$b#I really... don't like being alone all the time anymore.$7",
		"sebastian.strings.rain.dock.highhearts.2": "@... Did you come out to fish? I'll keep you company.#$b#Do you... have any new stories about the farm?#$b#I like listening to you talk out here in the rain. The sound of your voice and the rain is comforting.$7",
		"sebastian.strings.rain.dock.highhearts.3": "Oh hey, it's been a day for sure. I'm glad it's raining, then I can just hang out here and think.#$b#You're welcome to stay, you know that, right?$7",
		"sebastian.strings.saloon.Fri.1": "I tried to teach Sam some shots but he said it was too complicated and he wanted to just 'feel the vibe' or something like that.$7",
		"sebastian.strings.saloon.Fri.2": "I've been practicing some trick shots, watch this jump shot over that ball, hit the rail, and pocket the solid 4 ball...$7",
		"sebastian.strings.saloon.Fri.3": "We've invited Abigail to play, but she says she likes watching even though she spends most of the time on her phone.",
		"sebastian.strings.saloon.Fri.4": "I'm sure there are more exciting things to do on a Friday night, but it's sort of a tradition playing pool and hanging out.#$b#It's good having you here, changes things up.",
		"sebastian.strings.saloon.Fri.5": "Do you want a drink? I'll get you one, whatever you like.#$e#If you want, I'll show you some shots... we can play 3-Ball or Cutthroat, then the three of us can play.$7",
		"sebastian.strings.checkup.summer_4.000": "Ugh, I hate going to the doctor's office...$s#$b#Such a waste of time, I only go to make Mom happy.#$e#I guess it's good to get it over with anyway.",
		"sebastian.strings.checkup.summer_4.001": "@! What are you doing in here?#$b#... Pfft, Harvey has a pretty funny look on his face...$7#$b#... Good thing I wasn't naked, right? Uh... now you have a funny look on your face, hehe...$l",
		"sebastian.strings.16.DesertFestival": "Hey... it's so flippin' hot... I'm gonna melt.$s#$b#Sam is super excited about his new cactus friend, heh!$7#$b#Maybe I'll try betting on the races, that looks kinda fun. If you're looking for random yard sale stuff, check the booths.",
		"sebastian.strings.nightmarket.winter_16.000": "Do you see anything here you like, @?#$b#I was hoping to get one of those frog statues but apparently they only bring them on the first day. Oh well, next time I guess.$s#$b#Don't forget to grab a free coffee, it's really good!$h",
		"sebastian.schedule.mountain_47_23": "I like the peace and quiet up here, I can hear the frogs and insects when it's warm and feel the stillness in winter.$h#$b#... I guess... this is one thing you can't find in the city.$7",
		"sebastian.schedule.resort.entering": "Hi @, the boat ride over was fun, luckily I don't get seasick.$h#$b#Next time come join me at the rail, we can lean over and watch the waves rush by.",
		"sebastian.schedule.resort.leaving": "I'm ready to get back home, had more than enough sun and heat for one day. You heading out too?",
		"sebastian.schedule.resort": "The beach is okay, but I don't love the crowds.$s#$b#It would be nicer if nobody else was here, just the gang, then we'd have the place to ourselves and it would be way more fun.",
		"sebastian.schedule.resort.shore": "Hmm what do you think, build a sandgoon army? Or maybe bury myself in the sand so I don't get lobsterized... yeesh.#$b#... I'll definitely set up an umbrella if I'm going to hang out here, feel free to join me in the shade.$7",
		"sebastian.schedule.resort.wander": "... Now, if I were a tropical frog, where would I hide...$7#$b#Oh hey, @! Want to join the frog hunt? We could grab some snacks later and have a picnic.",
		"sebastian.schedule.resort.wander2": "I bet this place looks pretty cool in the rain.#$b#It would be nice to hang out here on a rainy day, don't you think?$7",
		"sebastian.schedule.resort.towel": "It's good to get away from the computer and see the real world sometimes.#$b#I forget how nice it can be... though it would be even better if it wasn't so hot.$7#$b#I came prepared with sunscreen and like fifteen water bottles, come help yourself if you get thirsty.",
		"sebastian.schedule.resort.bar": "My usual clothes don't cut it in this heat... so here I am, looking like a weeb in a t-shirt.$s#$b#I guess it's good to try something different once in a while... join me for a drink?",
		//SEBASTIAN FESTIVALS
		"sebastian.festival.spring13.y1": "Hey uh... thanks for coming over.#$b#I'll be here away from the crowd if you want to talk later...$7",
		"sebastian.festival.spring13.y2": "Good luck! Abby has won this thing more times than I can count, someone really needs to give her a challenge.$7#$b#Hope somebody brought a lot of tissues for Sam, he always forgets, heh!$h",
		"sebastian.festival.spring24.y1": "If only I had the power to disappear... this festival is so ridiculous.$s#$e#If you want to dance, maybe try Sam or Abby... that would be great if Abby said yes, then I'd be off the hook!$7",
		"sebastian.festival.spring24.y2": "*sighs* Every year I hope this festival will suddenly disappear, or at least have some decent music but no luck so far.$s",
		"sebastian.festival.summer11.y1": "The Mayor asked me to keep Sam away from the soup pot, haha! He's put some crazy things in there the past few years.$h#$b#If you want to get away from the crowd for a bit, I'll be over here in this tiny patch of shade.$7",
		"sebastian.festival.summer11.y2": "I still think this community soup pot thing is kinda weird...#$b#Does Sam have any crazy plots? I haven't heard anything, maybe he got over the soup prank phase.$7",
		"sebastian.festival.summer28.y1": "Wouldn't it be kinda cool if some giant sea creature rose up from under the jellies? Well... maybe not with all these people on the docks.#$b#Anyway, I'll be over here at least an arm's reach away from Sam. Yeah I heard him talking, heh!",
		"sebastian.festival.summer28.y2": "It would be nice if there weren't so many people here making noise, I can't focus on the sounds of the water under the pier.#$b#It's okay though. I don't mind hanging with the group for these things.",
		"sebastian.festival.fall16.y1": "Have you gone to the fortune teller's booth yet? She's always entertaining. I saw Abby and Haley over there earlier.$7#$b#I think I'll hit a few of the games, maybe get enough star tokens for something decent at the prize booth.",
		"sebastian.festival.fall16.y2": "Have you tried the games? They're all rigged of course, but sometimes you get lucky.#$b#I'm helping Mom out with her display this year, she sure went all out on the wood carving, Leah might be a little jealous.",
		"sebastian.festival.fall27.y1": "Hey, @. Have you tried the maze? I know ninjutsu, I'll protect you from anything that's in there!$7#$b#C'mon, don't laugh, how do you know it's not true?$s#$b#Last I saw Sam and Abby, they were getting a snack then hitting the maze. Maybe they got lost in there.$h",
		"sebastian.festival.fall27.y2": "Hey it's my skelebros, this is Papyrus, and over there is Reed. Reed's lost a lot of weight recently, best not to mention it.$h",
		"sebastian.festival.winter8.y1": "I've built up a snowball arsenal and am planning strategies for the snowball war.$7#$b#Sam's definitely got it coming!$a#$b#Maybe I'll see you by the snack stand later.$7",
		"sebastian.festival.winter8.y2": "Keep an eye out for any sneak snowball attacks, Sam still thinks he can ambush me.$7#$b#%A snowball is streaking straight for Sebastian's back...#$b#*SPLAT* GAAH!! What the- Ohhh, that man's going DOWN! Better say your goodbyes, Sam's definitely not making it to tomorrow!$a#$b#%Seb is off like a shot, seems like a neutral position in this war is the most reasonable choice.",
		"sebastian.festival.winter25.y1.lowhearts": "Merry Winter Star or whatever, gotta do the family thing and stand around eating a bunch of food. Anyway, hope you enjoy it.$7",
		"sebastian.festival.winter25.y1.medhearts": "Merry Winter Star @! Feel free to hang at our table. The food's really great and I wouldn't mind some company.$7",
		"sebastian.festival.winter25.y1.highhearts": "Merry Winter Star @! I, uh, got you something, here you go.$7#$b#%Inside a box wrapped in what looks like a page torn from a comic book is an obsidian carving.#$b#It's no big deal, I use the quartz and obsidian you give me to make these Solarion Chronicles game figures, I sell them online for some extra cash.#$b#That's the character you made when you started playing with our group... Thanks, it's no big deal. Just wanted you to know I appreciate our friendship.$7",
		"sebastian.festival.winter25.y2": "Hey @, the food looks amazing this year, even Mom kicked her pumpkin soup up a notch.$h",

//SHANE DIALOGUE
		"shane.reaction.dating_Sam": "Hey, uh, so you and the rock star wannabe...#$b#Sam is a decent guy, he's definitely dedicated to his music, it was pretty cool helping him with the music videos.#$b#I dunno, you're really too good for any guy in this town. Good luck though.",
		"shane.reaction.married_Sam": "That was a nice wedding, as far as weddings go.#$b#If you ever need help on the farm, you know where I live. I don't mind helping out with the animals if you ever need it.",
		"shane.reaction.dating_Sebastian": "Hey, uh, so you and the pool shark...#$b#Sebastian must be a decent guy if he won you over. Dude barely talks but I guess I shouldn't judge.#$b#I dunno, you're really too good for any guy in this town. Good luck though.",
		"shane.reaction.married_Sebastian": "That was a nice wedding, as far as weddings go.#$b#If you ever need help on the farm, you know where I live. I don't mind helping out with the animals if you ever need it.",
		"shane.reaction.dating_Alex": "Hey, uh, so you and the gridball star...#$b#Alex is a decent guy, but I'm kind of surprised he won you over. He's been a good friend to me though, at least we get along fine.#$b#I dunno, you're really too good for any guy in this town. Good luck and make sure Alex treats you right.",
		"shane.reaction.married_Alex": "That was a nice wedding, as far as weddings go.#$b#If you ever need help on the farm, you know where I live. Actually, it'll be good having you two as neighbors.",

//SOPHIA DIALOGUE
		"sophia.reaction.dating_Sebastian": "Hi you! So you and Sebastian are dating now? That's so cute!#$b#You've been such good friends for while, I'm sure it'll work out for you both.$h",
		"sophia.reaction.married_Sebastian": "I'm so glad you asked me to help with your makeup for the wedding, you looked amazing!$h#$b#I bet your pictures will turn out great. Come by any time you want another makeover session!$h",
		"sophia.reaction.dating_Sam": "Hi you! So you and Sam are dating now? That's so cute!#$b#You've been such good friends for while, I'm sure it'll work out for you both.$h",
		"sophia.reaction.married_Sam": "I'm so glad you asked me to help with your makeup for the wedding, you looked amazing!$h#$b#I bet your pictures will turn out great. Come by any time you want another makeover session!$h",

//VICTOR DIALOGUE
		"victor.reaction.dating_Sebastian": "Hi @, yeah I heard about you and Sebastian from Sam, he won't stop talking about it at game night.#$b#Seb's a really great guy, I'm sure you'll be happy together.$h",
		"victor.reaction.married_Sebastian": "You and Sebastian making a life here in the valley makes me think I'll be able to make it here too.#$b#I've noticed... Abby is maturing into a fascinating woman, she had some family issues and drama, but she's finally moving past that.#$b#It's inspiring me to take steps in my life to become more independent.",
		"victor.reaction.dating_Sam": "Hi @, yeah I heard about you and Sam, he won't stop talking about it at game night.#$b#I've noticed... Abby is maturing into a fascinating woman, she had some family issues and drama, but she's finally moving past that.#$b#It's inspiring me to take steps in my life to become more independent.",
		"victor.reaction.married_Sam": "You and Sam making a life here in the valley makes me think I'll be able to make it here too.#$b#Sam's a really great guy, super high energy but that's probably a good thing on the farm! I'm sure you'll be happy together.$h",
		"victor.reaction.dating_Alex": "Hi @, yeah I heard about you and Alex from Sam, he won't stop talking about it at game night.#$b#Alex is a decent guy, we've been neighbors for a long time and he's always doing things for his grandparents. I'm sure you'll be happy together.$h",
		"victor.reaction.married_Alex": "You and Alex making a life here in the valley makes me think I'll be able to make it here too.#$b#I've noticed... Haley never really made an effort to get to know me before, but she's been really friendly lately.#$b#Things are changing and it's inspiring me to take steps in my life to move forward.",

//VINCENT DIALOGUE
		"vincent.Introduction": "Oh, hi! I haven't seen you before, my name's Vincent.#$b#Momma says not to talk to strangers... But you seem okay.#$b#Are you the new farmer? Do you have a lot of animals? Like chickens and cows? Can I visit sometime and feed them?$h",
		"vincent.daily.Mon": "I wanna be just like my big brother when I grow up! He can play guitar, skateboard, do a handstand, he's so cool!$h#$e#You met Sam, right? He has blonde hair sticking up all over. I guess I better go... Okay! Bye!",
		"vincent.daily.Mon4.1": "I'm glad Dad's back... but he doesn't really want to play very much.$s#$b#Mom says he needs time to get used to being home again. I hope he feels better soon, I have all kinds of things I want to do with him.$s",
		"vincent.daily.Mon4.2": "Dad's not around much... I miss playing with him.$s#$b#I wish he could come to visit once in a while, so we could play for a few days.$s#$b#I hope the war ends soon. I want my dad back.",
		"vincent.daily.Tue": "*sighs* ... Mom won't let me have any more gummies today.$s#$b#Do you like gummies? If you ever get any, can I have some? I'll share mine with you too!#$e#Do you like horses? I think they're great, but I've never ridden one.#$b#Oh, I wonder what it would be like to ride an elephant! That would be amazing!!$h",
		"vincent.daily.Tue6": "Can you keep a secret?$u#$b#I wanna marry Miss Penny when I grow up cuz she's real nice and shares her snacks with me sometimes. Just don't tell her, okay?$u#$e#I can't tell Sam secrets, he likes to talk too much. Momma says I like to talk too but not as much as Sam.#$b#Look at this cool rock I found! I think I'll give it to Jas.#$b#I would give it to Miss Penny, but then she might know I think she's nice.",
		"vincent.daily.Tue8": "*sighs* School is kinda boring sometimes, I like doing things outside, not reading and math.#$e#Uncle Seb says math is fun, but he's kind of weird...#$b#Sometimes science is fun, we talked about amphibians and ara... arach... arachnids, y'know, spiders and stuff. Jas was grossed out, it was great!",
		"vincent.daily.Wed": "I wanna look for bugs, but Mom gets mad when I'm all dirty.$u#$b#It's a tough choice. Are there a lot of bugs on your farm? I bet there are!#$e#You have to know where to look, like under rocks and sticks and stuff.#$b#I found a whole beetle civilization under an old rotten board once! It was awesome!$h",
		"vincent.daily.Wed4": "The tidepools are so much fun! I found a starfish and a weird crab there once.#$e#Sometimes Uncle Elliott is there and he tells stories about the ocean and stuff.#$b#He uses really big words though so sometimes I don't understand, but it's fun listening anyway!",
		"vincent.daily.Wed6": "I want to go explore in the woods but Mom says I can't go by myself. Will you take me when you go to find mushrooms and stuff?#$e#Uncle Seb says there's some old ruins in there with a weird statue and everything.#$b#I really wanna see that! Maybe I can climb on top and you can take my picture!$h",
		"vincent.daily.Thu": "I'm hungry... have you seen Mom?$s#$b#*sighs* I guess I'll have to go home and see if I can sneak in the kitchen and look in the fridge.#$e#Mom doesn't like it when I eat too many snacks, she says it spoils dinner. I dunno, if dinner is good I can eat both!$h#$b#I want to be as tall as Sam so I need a lot of food to grow!",
		"vincent.daily.Thu2": "You're pretty fun for a grown-up, you don't tell me to be quiet all the time and you play with me and Sam.$h#$e#Uncle Seb is nice too. Some people think he's weird because he doesn't talk much, but I think he's okay. He's a good listener, kinda like you!$h",
		"vincent.daily.Thu4": "Oh hi @! Do you want to go for a picnic sometime or play at the park?#$b#We can hunt for bugs and build tiny villages out of rocks and leaves for them!$h",
		"vincent.daily.Thu6": "@! You like animals, right? I want a pet. Maybe a dog like Dusty, he's nice and Alex says I can pet him whenever I want.#$e#But it's not the same as having one of my very own. Abby has a guinea pig, he's cute but doesn't lick my face or follow me around...#$b#Do chickens sit on your lap? A chicken might be fun, then we'd have free eggs!",
		"vincent.daily.Thu8": "Uncle Seb showed me how to set up a ter... terra... terrarium to keep a pet frog! I can keep one in my room if I want.#$e#I just gotta get Mom to say yes.#$b#We even caught some frogs, then we let them go so they wouldn't be sad without their families.$h",
		"vincent.daily.Fri": "Ew, it's boiled beet night again...$s#$b#It's even worse than lentil soup.$s#$b#You grow food on your farm, right? So that means you can eat whatever you want?#$e#Mom says this stuff is healthy and will make me grow strong, but I don't think so.#$e#Too many beets just make my pee purple! I mean, that's kinda cool, but not worth it.#$b#Oh, don't tell Momma I said that, she might get mad.$s",
		"vincent.daily.Fri4": "Hmm... It's fish casserole tonight. It's okay, but not as good as dessert!#$e#Granny Evelyn made cookies and gave me one, don't tell Momma *whispers* it's our secret.",
		"vincent.daily.Fri6": "Mom let Uncle Gus make me a sandwich. It was really good!#$e#Maybe I'll be a chief when I grow up... oh, chef! That's it! Then I could eat whatever I want.$h#$b#A chief would be good too, then I could lead people around and tell them what to do. We would have lots of fun building things!",
		"vincent.daily.Fri8": "Sam made pancakes today, he's really good at it. He made mine shaped like an octopus!$h#$b#I think it tastes even better when the pancakes are in fun shapes. Plus there's more crunchy edges!",
		"vincent.daily.Sat_1": "Mom says that Dad's coming back soon!#$b#I hope he brings me some toys or something.$u#$b#Sam says he can't carry too much stuff so it's okay if he didn't get me anything. I'm just happy he will be home!#$b#I bet he'll be bored since he won't be busy fighting anymore. Maybe he'll like doing things with me and Sam. Like play at the beach with us!",
		"vincent.daily.Sat": "Miss Penny makes me read a new book every week. It's hard to sit still and finish a whole book.$s#$e#Sometimes she lets me pick a book though, then I can pick the interesting ones that are about dinosaurs or pirates!",
		"vincent.daily.Sat6.1": "Dad seems sad since he came back.#$e#I don't really remember what he was like before, but Sam says his heart needs to heal.$s#$b#I hope he gets better quick since I really want to play with him.#$b#I want to do something to help but I'm not sure what.$s",
		"vincent.daily.Sat6.2": "I wonder if Dad will ever come home... I bet he's lonely without us, I would hate to be all alone without Sam or Momma.$s#$b#Maybe I'll ask Sam to help me write him a letter. And I'll draw a picture to go in it too.#$b#Oh! I could draw a picture of you, me, Sam, and Seb with the pumpkin we carved! Dad will like that.",
		"vincent.daily.Sun": "Hi! I've seen you a few times now so we can be friends.#$b#Here, I got this pack of candy, want a piece?#$e#Momma doesn't let me eat candy very often, but I did extra good on my homework, so she let me have some today!$h",
		"vincent.daily.Sun6": "I'm glad you're my friend, you like to do fun stuff and you tell good stories with voices and funny faces.#$b#Do you have any good animal stories today? I especially like the chicken ones!",
		"vincent.daily.Sun8": "Hi @!#$e#Don't tell Mom... but you're my favorite grown-up, except for Sam but he doesn't really count.#$b#Next time you're at our house, I've got a new construction set to show you, it has batteries so the parts can move!$h#$b#We can make a walking robot, or a ferris wheel... hmmm maybe a robot horse?",
		"vincent.reaction.dating_Sam": "See? I was right, Sam really does like you a lot!$h#$b#I like you too, but I'm not gonna kiss you or anything, blech!#$b#Oh! Oh! Let's have a picnic, like we do for special things. This is a special thing, right?$h",
		"vincent.reaction.married_Sam": "Does this mean Sam is moving to the farm? Hmm... I'm going to miss him at home. Can I move to the farm too?#$b#Oh, then I'd miss Momma. Okay, I got it, we can all live on the farm! Then we can all be together AND I can feed the animals!$h#$b#I especially like the weird color chickens, they're the best!$h",
		"vincent.reaction.dating_Sebastian": "See? I was right, Uncle Seb really does like you a lot!$h#$b#I like you too, but I'm not gonna kiss you or anything, blech!#$b#Oh! Oh! Let's have a picnic, like we do for special things. This is a special thing, right?$h",
		"vincent.reaction.married_Sebastian": "Does this mean Seb is moving to the farm? Hmm... I'm going to miss seeing him at the lake. Can I move to the farm too?#$b#Oh, then I'd miss Sam and Momma. Okay, I got it, we can all live on the farm! Then we can all be together AND I can feed the animals!$h#$b#I especially like the weird color chickens, they're the best!$h",
		"vincent.schedule.Resort_Entering": "The boat ride was amazing! I saw a whale!$h#$b#At least I'm pretty sure it was a whale, Captain said it was just some kelp but I don't think so.#$b#Hey, maybe I'll be a boat captain some day!$h",
		"vincent.schedule.Resort_Leaving": "Oh man, I don't wanna leave, this was so much fun! Thanks for building sand castles with me, Sam was busy playing his guitar.#$e#And he was making gross googoo eyes at you, haha!#$b#I'm gonna really watch close on the way back and see if the whale is still there!$h",
		"vincent.schedule.Resort_Shore": "Do you think there are sharks here? I wonder if they come close just to see if there are any swimmers not paying attention...$h#$b#I want to see if I can get a picture of one, did I show you my new camera? It's really a phone but has a camera in it too.#$b#It's not really new, it was Sam's and he gave it to me when he got a new one. Anyway, there's so many things I need pictures of! See ya!$h",
		"vincent.schedule.Resort": "If you look close, you can see little bugs jumping out of the sand. Look! And there's a tiny crab... oooh, I wonder if there are clams in these little holes!$h#$b#Wanna play in the sand with me? I brought my castle building stuff so we can make a fortress with a moat.#$b#There's some really cool looking plants that we can use for decorations and maybe catch a couple of crabs to live there and rule over the sand bugs...$h",
		"vincent.reaction.GreenRain": "Mom! I wanna go outside and play! The rain looks so weird, like alien rain!#$b#Maybe it'll turn everything green, or maybe there will be mutant plants growing... I really wanna see!%noturn",
		"vincent.reaction.GreenRain_2": "%Vincent is covered in moss.#$b#Hey, look at me! I'm Swamp Boy... I have the power to grow moss on anything and I can talk to plants... mwaahaha!!$h",

//WILLY DIALOGUE
		"willy.reaction.dating_Sebastian": "Well hello, matey! How have the waters been treating you?$h#$b#I hear you and Sebastian are courting, heh! He's a good lad, quiet, enjoys gazing out over the sea, a kindred spirit I'd wager.$h",
		"willy.reaction.married_Sebastian": "Ah, such a nice wedding. I particularly enjoyed the drinks on the house!$h#$b#I'm not much of a dancer, but if the right lady were to come around, I might give it a try.#$b#I reckon I'd be fairly good at it seeing as my sea legs give me good balance.",
		"willy.reaction.dating_Sam": "Well hello, matey! How have the waters been treating you?$h#$b#I hear you and Sam are courting, heh! He's a good lad, a bit noisy but I'm sure he'll mellow with time.$h",
		"willy.reaction.married_Sam": "Ah, such a nice wedding. I particularly enjoyed the drinks on the house!$h#$b#I'm not much of a dancer, but if the right lady were to come around, I might give it a try.#$b#I reckon I'd be fairly good at it seeing as my sea legs give me good balance.",
		"willy.reaction.dating_Alex": "Well hello, matey! How have the waters been treating you?$h#$b#I hear you and Alex are courting, heh! He's a good lad, he cares for his grandparents and he's quite the catch! *winks*.$h",
		"willy.reaction.married_Alex": "Ah, such a nice wedding. I particularly enjoyed the drinks on the house!$h#$b#I'm not much of a dancer, but if the right lady were to come around, I might give it a try.#$b#I reckon I'd be fairly good at it seeing as my sea legs give me good balance.",

//EVENT EDITS

//Demetrius 6-Heart Tomato
	"demetrius.event.tomato.1": "Demetrius, I didn't tell you to get tomatoes. I said to get fruit.",
	"demetrius.event.tomato.2": "Oh, um... well, technically, tomatoes ARE fruits, heh!",
	"demetrius.event.tomato.3": "When a normal person says they want fruit, they NEVER mean tomatoes. It doesn't matter what the scientific classification is.",
	"demetrius.event.tomato.4": "@! I'm glad you're here. We need an outside opinion.",
	"demetrius.event.tomato.5": "How would you classify a tomato?",
	"demetrius.event.tomato.6": "Vegetable",
	"demetrius.event.tomato.7": "Fruit",
	"demetrius.event.tomato.8": "Robin, to be perfectly honest, I forgot what you said to get and these tomatoes looked so delicious so I decided on them.#$b#I'll make a point of writing it down next time.",
	"demetrius.event.tomato.9": "Pfft, oh all right, you're off the hook this time. I'm sure I can use the tomatoes anyway, they do look great!$h",
	"demetrius.event.tomato.10": "Thanks for your help, @.$h",

//Robin Fancy Bed
	"demetrius.event.bed.1": "Voila! My newest creation.$h#$b#It's a deluxe four poster bed, crafted from the finest local hardwood.",
	"demetrius.event.bed.2": "Um... Robin? What's the point of the four posts? It seems like an inefficient use of materials.$s",
	"demetrius.event.bed.3": "It's called 'beauty', bud... you know, that thing that most people find enjoyable?$6",
	"demetrius.event.bed.4": "Hmm, I see your point... it is a very attractive sleep receptacle.",
	"demetrius.event.bed.5": "'Sleep receptacle'? That sounds like we're sleeping in some kind of pod. Demetrius, sometimes I don't know about you, haha!$h",
	"demetrius.event.bed.6": "Hey @... Come in.",
	"demetrius.event.bed.7": "Check this out... It's the bed I was able to make thanks to all the wood you gathered.",
	"demetrius.event.bed.8": "So, what do you think?",
	"demetrius.event.bed.9": "The aesthetics are perfect",
	"demetrius.event.bed.10": "The four posts seem inefficient",
	"demetrius.event.bed.11": "Yeah",
	"demetrius.event.bed.12": "*ahem*... Well... If anyone needs me, I'll be in my pod...$5",
	"demetrius.event.bed.13": "Great minds think alike...$h",
	"demetrius.event.bed.14": "You two, I should have known...$3",
	"demetrius.event.bed.15": "Now that I have a prototype, I can start selling them in the shop.",
	"demetrius.event.bed.16": "Hey... these might look good in your place, @! What do you say... can we pencil you in for a half dozen?",
	"demetrius.event.bed.17": "Mom!",

//Maru 2-Heart
	"maru.event.vanilla2.1": "Oh, hello there!",
	"maru.event.vanilla2.2": "My Dad and I are just testing some soil samples. Not as much fun as testing robots, but still interesting.",
	"maru.event.vanilla2.3": "Come on over! We could use a hand, actually.$h",
	"maru.event.vanilla2.4": "Would you watch this beaker for me? I'm gonna grab the last batch of samples.#$b#I'll be right back, just call Dad over if you see any changes.",
	"maru.event.vanilla2.5": "Thanks for helping out, @.",
	"maru.event.vanilla2.6": "Maru's been interested in science since she was little and I showed her some fun experiments for kids. She's my special little girl.$h",
	"maru.event.vanilla2.7": "Though she's not so little anymore, it seems like only a short time ago we were doing experiments with eggs and bottles. *sigh*",
	"maru.event.vanilla2.8": "Well, it is exciting to see what she's working on now, the cutting edge of robotics. I'm so proud of her!$h",
	"maru.event.vanilla2.9": "Hey, sorry about that. I hope you found something to talk about while I was gone.",
	"maru.event.vanilla2.10": "...I was just telling @ about the experiments we used to do when you were little.",
	"maru.event.vanilla2.11": "Right, @?",
	"maru.event.vanilla2.12": "(Smile and nod)",
	"maru.event.vanilla2.13": "It's cool how you and your dad are so close.",
	"maru.event.vanilla2.14": "Pfft, Dad, you've got to stop telling everyone about me being some kind of kid scientist.$h#$b#Okay! Here, @... let me show you how to use the equipment.",
	"maru.event.vanilla2.15": "Pfft, Dad, you've got to stop telling everyone about me being some kind of kid scientist.$h",
	"maru.event.vanilla2.16": "Okay, okay... I'm just proud of you, sweetie. But I don't want to embarrass you.",
	"maru.event.vanilla2.17": "That's okay, Dad. I really don't mind.#$b#We should get back to work before these samples crystallize.",

//Penny 2-Heart
	"penny.event.vanilla2.1": "*Sigh*... How am I going to reach that letter in the back?$s",
	"penny.event.vanilla2.2": "Here, let me help you, Mr. Mullner!",
	"penny.event.vanilla2.3": "There you go!$h",
	"penny.event.vanilla2.4": "Hmmph. I could've done it myself! And I can certainly move around on my own!$u#$b#How feeble do you think I am?",
	"penny.event.vanilla2.5": "@? How long have you been there? Heh...",
	"penny.event.vanilla2.6": "Don't worry, you did a kind thing helping out, Penny.",
	"penny.event.vanilla2.7": "I know you meant well, but it's really better to ask first instead of assuming George wanted help.",
	"penny.event.vanilla2.8": "I'm just taking a walk, minding my own business.",
	"penny.event.vanilla2.9": "*sigh*... No, no... I'm sorry, miss. I shouldn't have gotten so angry, I know you meant well.$s",
	"penny.event.vanilla2.10": "It was actually very kind of you to help me out, you have a good heart.",
	"penny.event.vanilla2.11": "That's okay, Mr. Mullner. I understand. I really should have asked you first though, I'm sorry about that.",
	"penny.event.vanilla2.12": "It must be difficult to grow old...$u",
	"penny.event.vanilla2.13": "I'd rather not think about it.",
	"penny.event.vanilla2.14": "It's just a different part of life.",
	"penny.event.vanilla2.15": "That's why we should respect our elders.",
	"penny.event.vanilla2.16": "I'd rather die young...",
	"penny.event.vanilla2.17": "Well, it was interesting talking to you, @. I should go.$u",
}
