{
  "Format": "2.3.0",
  "Changes": [
    {
      "Action": "EditData",
      "Target": "Characters/Dialogue/Haley",
      "Entries": {
        "Introduction": "Oh, you're that new farmer, right? @, right?#$b#I'm Haley.$11#$e#You know, if it weren't for those awful clothes, you might actually be kind of pretty.#$b#Actually, never mind.$7",
        "Tue4": "Hey, so I know I’ve been really mean to you in the past. Not many people try to stay close to me, even when I’m being.. like that. But you did.$13#$e#Sorry for before.$3",
        "Fri4": "Do you go to the saloon like the rest of the townsfolk? Em mentioned she sees you during her shifts.#$b#Not really my thing.$2",
        "Sat4": "Thanks for being friends with me. I don’t really have a lot of friends, besides Alex and to some extent, my sister.$11#$e#We ARE friends, right?$8#$b#Right.",
        "Sun4": "So, I knew I grew up here and all but I’ve been thinking about how cool it would be to...hang out more with some of the girls around here.#$b#Girls just really...they just really get me... you know?$4",
        "Wed6": "I don’t know if you’ve noticed this or you act like you don’t, but everyone in town raves about the crops from your farm.#$b#It’s kind of funny because Pierre acts like he grows them himself, but we all know the truth. Nobody just outright calls him out.$4",
        "Sat6": "It’s the weekend!$1#$b#Do you have time later, @? I can totally cook us dinner and then we can have a sleepover together.#$b#You can even borrow my clothes!$1#$e#I only have one bed?#$b#Uhm, so what? Does that...bother you?$2",
        "Sun6": "You know, I’ve been thinking a lot about our...friendship. Em even said it’s changed me...for the better.$11#$e#I’m just really glad we’ve gotten close. I feel like I can just express myself without judgment.$13#$b#You’re a good friend, you know that?$13",
        "Mon8": "You know, it’s kinda strange. I’ve been feeling a lot more settled in Pelican Town lately.#$b#It’s like, I’m finally starting to feel the charm of this place.$11#$b#Maybe it was a good thing I didn’t move after all.$13#$e#What about you, though? I hope you’ll stay and settle here for good.$2",
        "Mon8_summer": "Do you wanna join me for a walk down the beach sometime? You’ve always been so busy running around town and tending to your crops, you know?#$b#It’s nice to take a breather from time to time.$11#$b#I’ll make it worth your time,@. I promise.$2",
        "Wed8": "I know people have a...distinct impression of me and I can’t totally blame them for that. There are days when…I don’t even like myself.$2#$e#Spending time with you has changed my outlook in life in more ways than one, though.#$b#I mean, who cares, right? I like myself and I accept myself for who I am. It should be enough.$13",
        "Fri8": "Em says you frequent the Saloons.#$b#She even told me you’re practically good friends with everyone in town.#$b#I mean...that’s a good thing.$4#$e#I am still your favorite, right?$8",
        "Sun8": "Have you ever felt like you’re hiding a part of yourself? I know it’s not always easy to be honest about who you are, especially when you’re not sure how people, especially your loved ones, will react.$7#$e#Just know I’ll always be here for you, okay? You can trust me with anything, @.$13",
        "Tue10": "Days like this, I like to think about what makes me happy...what makes me feel true to myself and it’s just so funny to me that it’s truly the simplest things in my life that do.#$b#The town’s scenery, Em cooking us breakfast, pretty sunflowers, my parents sending me their monthly postcards, and being able to express my love for you means... it means so much to me.$4",
        "Thu10": "Honestly, I sometimes wonder if I would have ever been truly happy if I hadn't accepted my sexuality.$2#$b#Honestly? It felt like I was living in a limbo, having to conform to something I was not.$2#$b#But now, with you in my life, I know that truly embracing who I am was the best decision I ever made.$13",
        "Thu10_summer": "I hope it doesn’t bother you that I hang out with Alex sometimes. I know he can be…much, but he’s a good guy with a soft heart and he’s always been a good friend.#$b#Besides, by now, you already know I’ve never really been attracted to him that way.#$b#You, on the other hand…$4",
        "Thu10_fall": "Hey, sweetheart. I know what you do isn't really within the domain of my expertise but as your girlfriend, I wanna do what I can for you.$11#$b#I baked you some sweets though, a snack you can eat to restore your energy.[222 608]",
        "Fri10": "Babe, I’m so glad you’re here! I was just thinking of ways I could support you so I cooked something for you.[197 204 208 213 220 222 230]$1#$e#Hey, what do you think of sleeping over tonight? Em’s going home late from her job anyway, so we can totally have the privacy we need… $4",
        "Fri10_winter": "Babe, I’m so glad you’re here! I figured you didn't have crops to tend to so I was wondering if we can crash at your place tonight? I'm totally down to feel your body warmth. $4",
        "Sun10": "I was always afraid to embrace my identity, so worried about the judgment I’d get from others. I had an image I maintained, you know?$2#$b#With you by my side, loving me and accepting me the way that I am, I feel so free… so liberated.$11#$e#Loving you has been the best thing that’s ever happened to me, @.$13",
        "spring_2_1": "Oh, it’s you again.#$b#What do you want this time, farmer?$7#$b#Shouldn't you be out in the fields or something?",
        "spring_7_1": "I guess farming does keep you busy, but it wouldn't hurt to find a hobby that doesn't involve… all of that dirt, right?",
        "spring_12_1": "Ugh, I cannot stand leeks and horseradishes! The smell, the taste... just everything about them is horrible!$5#$e#Don’t you even think of gifting them to me, farmer.$3",
        "spring_15_1": "I heard from Emily that you're from Zuzu City. So, why'd you come to this boring place?#$b#Your grandfather?$12#$b#I see.#$b#Well, personally, I would've stayed there—everythere there, especially the fashion, is so much better.$7#$e# Although, judging by your look, I don't think you care much about that.$2",
        "spring_23_1": "Have you heard about the Flower Dance coming up?#$b#I’ve been planning my outfit and everything!$1#$b#Ugh, I really need to remember to bring my camera—I've got to capture how pretty the scenery looks.$1#$e#Maybe my mom will see them and get a little jealous of how great it all turned out.$2",
        "spring_28_1": "Spring was lovely or whatever, and I did get some great pictures of the daffodils and the lake.#$b#Honestly though, I am soooooo ready for summer!$h#$b#Have you seen the beach here during Summer? Plus, I have a whole new wardrobe to show off!$h",
        "summer_2_1": "You’ve trudged through the heat to come here? Don’t you have work to do?#$b#I’m getting used to it or whatever, but like…$13#$b#Farmer, why are you looking at me like that?$3",
        "summer_6_1": "Have you heard of the Calico Desert? That’s where my sister’s best friend works.#$b#After the bus broke down, she doesn’t visit Em as much.$2#$b#She does send coconuts though, so she’s cool in my book.$11",
        "summer_10_1": "If the Mayor hasn't told you yet, we’re having the Luau tomorrow.$7#$b#Make sure to bring some of your best crops—I want to see if they're worth all that dirt and hard work.$h",
        "summer_13_1": "I found this really pretty rainbow shell while taking pictures on the beach the other day.$11#$e#Sometimes, it honestly feels like a waste when I see how much trash gets left behind, especially after the Luau.$2#$b#I hope you’re not contributing to that, farmer.$7",
        "summer_17_1": "You know, I love the summer sun, but it’s really taking a toll on my skin.$2#$b#I’m thinking of investing in a good hydrating sunscreen.#$b#You know, you should probably consider some skincare too; it really helps with all the sun exposure you get from tending to that farm of yours.",
        "summer_22_1": "Sunflowers are such a summer staple! Have you tried planting them on your farm?$h#$b#I bet they'd look better than whatever you’ve got now.",
        "summer_27_1": "Summer’s ending really soon, farmer. Ugh, I’m totally gonna miss this season, but hey, at least the sunflowers are still in bloom, right?$2#$e#Well, shouldn’t you be harvesting your crops by now?",
        "fall_1_1": "The fall leaves are really pretty, don't you think? I like the change in aesthics but I still do miss the warmth of summer.",
        "fall_7_1": "You know, I recently went for a walk near the lake to take pictures of the fall colors, but all I found were mushrooms everywhere.$3#$b#Why do some people even like those things so much?$3#$e#Ugh, they totally ruin the vibe.$5",
        "fall_10_1": "Hey, @. I was reading about fall fashion on CSS’s blog. It’s amazing what styling can do!$h#$e#Well, too bad you haven’t updated your wardrobe—it’s really not my taste.",
        "fall_15_1": "Are you joining the Stardew Valley Fair?#$b#Em spent WEEKS sewing for the festival's banner.$2#$e#Oh, are you?#$b#Well, I hear Abigail’s dad is pretty tough to beat. It’d be interesting to see how the new farmer would stack up.#$e#Good luck.$11",
        "fall_20_1": "Ugh, pumpkins everywhere! They’re so overrated, in my opinion.$2#$b#At least the fall colors make up for it.$7",
        "fall_26_1": "You know, I’m not really into the whole spooky vibe or whatever, but I guess it’s a chance to get nice photos for my blog. Halloween-themed boards seem to be a trend nowadays.#$e#You should probably get a costume or something… if that’s your thing.",
        "winter_3_1": "Ugh, my skin gets so dry with this cold weather. I need to find a good moisturizer and some SPF. Maybe I’ll pick up something new online.$2#$e#Why are you looking at me like that? You DO realize you still need to wear sunscreen during winter?",
        "winter_8_1": "I have a check-up with Doctor Harvey tomorrow. I’m not exactly too thrilled about it, but staying healthy is important—gotta keep up appearances, you know?#$e#Besides, being at my best means feeling and looking my best!$h",
        "winter_13_1": "You know, I’m not a fan of how the fountain near the Community Center looks frozen.#$b#It’s supposed to be a centerpiece of the town, but it just looks so dull and grey in winter.$2",
        "winter_17_1": "Winter can get pretty dull, so I like to check out everyone’s fashion choices every once in a while. It’s the one time people really try to stand out while looking cozy, you know?#$b#Emily knows her fashion so I’m not worried.$11#$b#Although, honestly? Abigail’s outfit is just... ugh. Thank Yoba she’s pretty, atleast.$2",
        "winter_20_1": "It’s a bit quiet with just Em and me this year...like every other year.$2#$b#Sigh, the house feels so empty without Mom and Dad around.$2",
        "winter_24_1": "Emily and I are planning to cozy up with some hot cocoa for the Feast of the Winter Star.#$b#Oh, maybe I should get her that cashmere sweater she was raving about last week.",
        "winter_27_1": "Winter’s been pretty mellow this year. Ah, I’m really looking forward to the flowers coming back!$h#$e#I can't wait to take more photos and enjoy being outside again—I've had enough of the cold!$3",
        "spring_1_2": "Happy new year, @! I’m surprised to see you here on the first day of the year.#$e#Oh, I am sooooo ready to ditch the winter layers for lighter and more colorful outfits. Spring fashion is my favorite!$h",
        "spring_5_2": "It’s great to see everything coming back to life. I’ve been thinking of trying my hand at some new fashion sketches inspired by spring.",
        "spring_9_2": "Unlike the last season, spring actually makes me so productive with my photography.$11#$b#You know, I headed over to the lake near Marnie’s yesterday and the reflections in the waters and the newly sprouted leaves made for some stunning photos!#$e#You should join me next time when you’re free.",
        "spring_12_2": "Oh great, the Egg Festival again.$2#$b#I’m not really thrilled about it—eggs are just soooo not my thing.$2",
        "spring_14_2": "Oh? You’re here?#$b#Thanks for stopping by on my birthday.$h#$b#My plans?$7#$b# Well, Em and I might grab some food before she heads out for work.#$e#I wish Mom and Dad were here to celebrate... $2#$b$ It means a lot that you came though, so thank you.$11",
        "spring_17_2": "Oh, I would just love to get a fruit salad today. Apricot’s are in season so it’s the perfect time to stock up fruit if you wanna make some next season.#$b#Dandelions? On a salad?#$b#Well, count me out.$3",
        "spring_23_2": "Hey, are you going to the Flower Festival this year? I’m thinking of wearing the new earrings my Mom got me from her trip at Mineral Town.#$e#What do you mean you didn’t prepare?$12#$b#Sigh, I’ve got some extra cloth you can use to tailor a dress for tomorrow.[428]#$b#You can use my sister’s sewing machine if you don’t already have one but do ask permission from her first.",
        "spring_26_2": "Emily’s birthday is coming up. Any gift ideas?$2#$e#Hmmm, maybe she’ll like new dancing shoes or new dyeing materials.",
        "summer_1_2": "I keep forgetting how hot it gets during summer. But at least I can start sunbathing by the beach.#$e#Ooooh, maybe I should wear that new bikini I ordered last month!$h",
        "summer_4_2": "Sigh, I’m not very good at gardening...$2#$b#Why am I so glum? Well, I tried to learn how to garden and it’s not as easy as that online tutorial taught me.#$e#Maybe you can teach me?$11#$b#Hey, help a pretty girl out!$1",
        "summer_10_2": "I hope you're ready for the Luau tomorrow. You should bring some of your best crops! Everyone’s gonna like you better, you know?$11#$e#You know what? You should totaaaally bring coconut! It’s the best fruit, like, ever.$h",
        "summer_14_2": "I was taking a nice walk by the beach the other day and I noticed the ocean’s been less polluted nowadays.#$b#Hey, why are you looking at me like that? I’m not superficial – I care about nature too, you know.$2",
        "summer_17_2": "Hey @, so guess what? I grew a flower!!!$h#Not just any flower – a sunflower! So I tried to study this tutorial from M. Sappho's blog, and after a few failed attempts, I learned how to grow one.#$b#Here, I thought you might like it![421]$h",
        "summer_22_2": "I’ve been testing out different sunscreens for summer. Sunbathing has taught me that it’s really important to keep your skin safe and healthy in this heat.#$b#Do you want any recommendations?",
        "summer_25_2": "I’ve been taking so many photos this summer and they turned out so nice! The lighting was just perfect on this one and I really nailed the composition on this one. My favorite one’s the rainbow shot I got after the green rain we had the other day.$h#$e#Maybe I’ll post a summer-themed board on my blog after I send these pics to my parents.",
        "summer_28_2": "Summer’s ending really soon, farmer. I’m totally gonna miss this season, but hey, at least the sunflowers are still in bloom, right?#$e#Well, I appreciate the visit but you should really tend to your crops by now.",
        "fall_1_2": "I’m still getting used to the cooler weather. I mean, it’s nice for fashion, but I’ll miss the heat.$2",
        "fall_3_2": "Hey @, so I accidentally ordered extra sunflower seeds from Pierre’s and thought you might want to plant them.You know, they’ll make your farm look soooo much prettier.[431]$h#$e#You’re welcome.$h",
        "fall_7_2": "Ugh, I've been craving some fruit salad lately.$2#$b#The recipe should be available around this time on TV. It’s really perfect for a healthy snack.$11",
        "fall_15_2": "Just like last year, Em spent WEEKS sewing the Stardew Valley Fair banner. That girl really needs to learn how to rest.$2#$b#Oh, you’re joining? I hope you win this year. Good luck!$11",
        "fall_20_2": "Have you noticed how Penny’s auburn hair looks even more vibrant in the fall? I don’t know why but it kind of feels like she was made for this season.$11#$b#Uhmmm, did that sound… weird?$2",
        "fall_26_2": "Hey, what's your favorite kind of music? I’ve been listening to this artist Claire-o from Zuzu City and…she really gets me.$2#$e#Uhm, anyway, I do need some new alternative artists to listen to while I’m blogging or developing my photos. Any recommendations?",
        "winter_2_2": "By now, I think you already know I’m not the biggest fan of the colder seasons. But hey, atleast I get the chance to show off my new winter fashion.#$e#Gotta find the silver lining somewhere, you know?$11",
        "winter_4_2": "It’s nice of you to come trudging in the snow to visit me. You don’t really have any crops to tend to, do you?#$e#Feel free to visit anytime. I can brew you some hot cocoa.$11",
        "winter_7_2": "I was looking at some photos I had and realized how much I’ve changed.#$e#It’s funny how winter can make you reflect on things—like your feelings and how you want to present yourself.$2",
        "winter_15_2": "Some people in my old high school used to be so surprised when they found out Emily and I were siblings.#$b#Even if we’re different in some parts of our personalities, we’re still pretty alike in a lot of ways.",
        "winter_18_2": "So you know how this cold weather is really drying out my skin? I found this fantastic moisturizer for this season.#$b#Sigh, I just wish it wasn’t so chilly out.$2#$e#I can… put it on you, if you like..$4",
        "winter_21_2": "What are your plans for the Feast of the Winter Star?#$b#I’m planning to get myself some new lens.#$e#I’m trying to brainstorm what I should get for Em, though.$2",
        "winter_28_2": "You’ve come to see me before the new year?#$b#That’s… really sweet.$4#$e#I’m glad you moved here, @. I hope you have a prosperous spring.",
        "give_flowersA": "Oh.. @, I’m so flatted. These are so beautiful!$11#$b#...Wait? You want to be my girlfriend?$12#$b#I..i$8#$b#I am so in love with you that only a fool would refuse.$4",
        "give_flowersB": "These look so beautiful!$4#$bWait…are you asking me to be your girlfriend? $8#$b#Yes!! A million times yes!!!$11#$b#I am so in love with you that only a fool would refuse.$4",
        "dating_Haley": "You have no idea how happy you made me.$4#$b#I thought my love for you was one-sided.$2#$b#I was just so afraid that you’d stop spending time with me if you found out…I was into girls.$2",
        "dating_Haley_memory_oneday": "I couldn’t sleep the entire night, @. I’m so happy that I’m yours..$8",
        "dating_Haley_memory_oneyear": "Happy anniversary, babe! Being with you has made me so happy beyond words.$1#$e#Do you see us being together forever? Sometimes I wonder if I'll always be your girlfriend, because I just cannot picture my future without you in it.$u",
        "dating_Alex": "So I heard you're dating Alex?#$b#I....$2#$b#I hope he makes you happy,@.$13",
        "breakUp": "Was it just a phase to you, @? Were you just toying with my feelings? Was there something wrong with me?$2"
      }
    }
  ]
}