{
	//GIFTS
	  "J4ZMIN.MailSam01": "@,^I found these on the beach, but then I realized I have no place for them.^^Anyway, maybe you can find a use for them.^^-Sam",
	  "J4ZMIN.MailSam02": "@,^Got a few of these from work... uh, legally, of course.^^They were just sitting there. Thought you might enjoy them.^^-Sam",
	  "J4ZMIN.MailSam03": "@,^Ugh, Mom made pickles again. Why does she keep thinking I'll like these slimy things?^^No way I'm eating them. Maybe you'll have better luck with 'em.^^-Sam",
	  "J4ZMIN.MailSam04": "Hey @,^Found this old drum in my closet. No idea where it came from, but it looks like it has some history.^^Thought it might be more your thing than mine, so here you go!^^-Sam",
	  "J4ZMIN.MailSam05": "Hey @,^Thought you might like these tomato seeds.^^My mom swears by 'em—says fresh tomatoes make the best sandwiches. Guess that means you'll need bread too. Sorry, I didn't think that far ahead.^^Good luck planting!^-Sam",
	  "J4ZMIN.MailSam06": "@!^So, I found this snail hanging out near the water the other day. It's, like, the coolest little dude ever. Thought you might wanna meet it. Don't eat him, okay?^^Catch you soon!^-Sam",
	  "J4ZMIN.MailSam07": "Hey, @!^I picked up this cheese press for you. You can use it to make your own fresh cheese—honestly, homemade cheese is way better than the stuff you find in stores. Just think about it... cheese on demand!^^Catch you later!^-Sam",
	  "J4ZMIN.MailSam08": "@,^Okay, hear me out—I decided to try cooking. Yeah, I know, big shocker. Turns out, I can make pancakes that don't taste like cardboard.^^I made a ton, though, and there's no way I can eat them all. So here, take some!^^Pro tip: drown 'em in syrup. It makes everything better. Enjoy!^-Sam",
	  "J4ZMIN.MailSam09": "Yo, @!^You know I had to send you some pizza—our favorite, right?^^Next time you're free, let's make it a pizza-and-movie night. You pick the movie—I'm cool with anything, as long as it's not a boring documentary.^^Miss ya!^-Sam",
	  "J4ZMIN.MailSam10": "Hey, @!^So, I got these warp totems... totally practical, right? Now you can pop down to the beach anytime.^^Imagine this: you, me, the sound of the waves, and maybe some pizza (obviously). Doesn't that sound like the perfect day?^^Let's make it happen soon.^^See ya, cutie! ;)^-Sam",
	
	//TITLES
	"J4ZMIN.TitleSam01": "Clam",
	"J4ZMIN.TitleSam02": "Joja Cola",
	"J4ZMIN.TitleSam03": "Pickles",
	"J4ZMIN.TitleSam04": "Ancient Drum",
	"J4ZMIN.TitleSam05": "Tomato Seeds",
	"J4ZMIN.TitleSam06": "Snail",
	"J4ZMIN.TitleSam07": "Cheese Press",
	"J4ZMIN.TitleSam08": "Pancakes",
	"J4ZMIN.TitleSam09": "Pizza",
	"J4ZMIN.TitleSam10": "Warp Totems"
}
