{
	//regular mail
	
	"Spam.CatFacts": "Congratulations, @!^You have been subscribed to Cat Facts!^We will send you Cat Facts at a later date. Keep an eye out!^^** If this mail was recieved in error, please contact ------ to unsubscribe.^(Conveniently, the sender's contact information is too smudged to read.)",
	"Spam.CatFactsSub": "Cat Facts Subscription Notice",
	
	"Spam.CatFacts1": "Cat Fact No. 1!^Most cats have five toes on their front paws and four on their back paws. Some cats can actually have more toes, though! These cats are called 'polydactyls.' Sometimes their extra toes make their paws look like oven mitts!^Wow!",
	"Spam.CatFacts1Desc": "Cat Facts 1",
	
	"Spam.CatFacts2": "Cat Fact No. 2!^Cats don't actually have nine lives! A scientific study was recently published that has found that cats can have anywhere from one to thirty lives. Sometimes, there's the rare outlier that has as many as ------ lives!^Wow!",
	"Spam.CatFacts2Desc": "Cat Facts 2",
	
	"Spam.CatFacts3": "Cat Fact No. 3!^Be careful planting lilies around places where cats live! Lilies are very poisonous to cats. Let's keep our fuzzy friends safe!",
	"Spam.CatFacts3Desc": "Cat Facts 3",
	
	"Spam.CatFacts4": "cat fact no 4^cat like fish. plz give fish to cat? cat love you when cat get fish.",
	"Spam.CatFacts4Desc": "Cat Facts 4?",
	
	"Spam.CatFacts5": "Cat Fact No. 5!^Did you know thatppppppppppppppppppppppp000000000000000000000000ooooooooooooooooooooo;",
	"Spam.CatFacts5Desc": "Cat Facts 5?",
	
	"Spam.JunimoMail": "hi hi!^you are friend to junimo, yes?^you can be super friend to junimo with yummy starfruit!^raisin too!^^bye bye!^   - M. Rasmodius, Wizard",
	"Spam.JunimoMailDesc": "Letter from the Wizard?",
	
	"Spam.JunimoMailNextDay": "Greetings, farmer.^I apologize if a letter was sent to you yesterday from my tower, as it was in error. A summoning spell I cast went awry, and I believe the the little hooligan got into my writing supplies. You may disregard it if you wish, and please accept this small gift for the trouble.^   - M. Rasmodius, Wizard^^",
	"Spam.JunimoMailNextDayDesc": "Rasmodius Apology Letter",
	
	"Spam.PrismaticGag": "Geologists will HATE you with this one simple trick!^^Have you ever heard of a prismatic shard? They're quite rare, aren't they?^What if you could just make one appear out of thin air? Well, it's quite simple!^All you have to do is say \"[74]\". That's it! It's that easy!^^Try it today!",
	"Spam.PrismaticGagDesc": "Free Prismatic Shards?",
	
	"Spam.LawsuitSettle": "To whom it may concern:^The class action lawsuit was a success! Here is your portion of the settlement.^We at the Zuzu branch of Hawthorne and Associates are so proud we were able to represent you in this monumental success against the Joja Corporation wrt. their demeaning use of \"The Naughty Corner\" during employee arbitration.^Maybe next we can tackle the feeding troughs in the cafeteria!",
	"Spam.LawsuitSettleDesc": "Settlement Winnings",
	
	"Spam.FreeEnergy": "Have you ever heard about free energy?^Well, there's energy!^And it's free!^And it's right here!^And you've heard about it right now!^^Spread the word!",
	"Spam.FreeEnergyDesc": "It's Free Energy!",
	
	"Spam.FreeEnergyAgain": "After recieving some complaints from our last Free Energy campaign, we are here to announce that this is the REAL free energy!^It's here! Again! Free Energy!^It's yours! You can take it!^It's good stuff! Accept no imitations!",
	"Spam.FreeEnergyAgainDesc": "Free Energy, Again",
	
	"Spam.FreeEnergyFinale": "We at Free Energy! Inc. are here to issue a formal apology to all our beloved subscribers.^We were misled on what we thought \"free energy\" meant.^It does not mean giving out batteries for free, and it does not mean giving out energy drinks for free, either.^\"Free energy\" is actually the concept of making electricity from nothing... And what do you know, we figured out how to do just that!^So it's free energy! From the sun! Forever! All you have to do is wait for it!^It took us a while to figure out how to turn our surplus energy drinks into solar panels, but our blunder is your benefit! Enjoy!",
	"Spam.FreeEnergyFinaleDesc": "Free Energy, Forever!",
	
	"Spam.LetterOfEncouragement": "Hey there.^^You probably don't know me, to be honest. But if you're reading this, I figure it was meant to be... I don't know if you need to hear this or not, but I'll say it anyway:^You're doing just fine.^Stuff's gonna work out.^Just keep moving forward, one step at a time.^And if there's an old friend in your life you haven't talked to in a while, why not see how they're doing? You might be surprised!^Take care of yourself, okay? You've got this.^^   -a friend",
	"Spam.LetterOfEncouragementDesc": "A Letter of Encouragement",
	
	"Spam.StarsAreWatching": "^^^^   The stars are watching you with great interest.^^                  Make them proud.",
	"Spam.StarsAreWatchingDesc": "The Stars are Watching",
	
	"Spam.ChainLetter": "You've been cursed by the chain letter demon! Send this mail to 5 of your friends or else your cereal will always be soggy!",
	"Spam.ChainLetterDesc": "A Chain Letter",
	
	"Spam.LuckyNumbers": "Today's lucky numbers are:^^23 73 77 41 05 59",
	"Spam.LuckyNumbersDesc": "Today's Lucky Numbers",
	
	"Spam.GameTheory": "INCREDIBLE BREAKTHROUGH IN HOW WE UNDERSTAND THE WORLD!^^Have you ever wondered why some things are the way they are? Researchers at the Ferngill Institute of Science are under fire after publishing \"Game Theory,\" a paper that argues about the existence of \"smah-pee,\" \"strings,\" and \"sprites.\" Keep reading to find out more and see if this affects you!^^(The rest of the paper has been torn off.)",
	"Spam.GameTheoryDesc": "Learn About Game Theory!",
	
	"Spam.JojaAd": "ONE DAY ONLY! GET A BUCKETFUL OF INCREDIBLE SAVINGS!^^As part of the release of our new Joja Cola(tm) MEGA Size, enjoy MEGA deals in all stores for one day only!^All You have to do is purchase one MEGA Size Joja Cola bucket. Then, after you finish your refreshing beverage, anything you can fit inside the bucket is 90% off! That's right, 90%! Hurry, this deal won't last long!^*MUST CLIP COUPON TO SAVE. VALID FOR ONE DAY ONLY.*^^(The coupon is several weeks out of date...)",
	"Spam.JojaAdDesc": "One Day Sale at JojaMart!",
	
	"Spam.RaffleWinner": "Congratulations @! You've won our 'Raffle for a Raffle' sweepstakes!^Enclosed is your prize. Enjoy!",
	"Spam.RaffleWinnerDesc": "Raffle Winner!",
	
	"Spam.RiffraffWinner": "Congratulations @! You've won our 'Raffle for some Riffraff' sweepstakes!^Enclosed is your prize. Enjoy!",
	"Spam.RiffraffWinnerDesc": "Riffraff Winner!",
	
	"Spam.LotteryWinner": "To whom it may concern:^^We have it on record that you purchased a lottery ticket with the numbers:^23 73 77 41 05 59^We are here to inform you that you have won the Ferngill Lottery jackpot with these numbers! However, due to what appears to be a freak incident several thousand other individuals have won with the same numbers on that day. Since the jackpot has to be split between all of the winners, the winnings per person are not large enough to require collection at our offices. We have attached the winnings below. Have a great day.^^- The Ferngill Lottery",
	"Spam.LotteryWinnerDesc": "Lottery Winner!",
	
	"Spam.HotPeppers": "Meet hot peppers in your local area!^^Huge juicy melons waiting just for you!^^Only at Pierre's -- Don't get hot and bothered by this summer's sizzling deals!",
	"Spam.HotPeppersDesc": "Pierre's Sizzling Deals!",
	
	"Spam.DatingWebsite": "Hello, stranger!^^Are you all alone on a nice Friday morning like this one?^Looking for someone to fill that hole in your lonely heart? Check out the Lonely Farmer Forum to find friends and meet someone special today.",
	"Spam.DatingWebsiteDesc": "Lonely Farmer Forum",
	
	"Spam.SplashPark": "Hey Thrivers!^^This is just a notice to inform you that the Joja Splashin' Experience Park in Zuzu City will be temporarily closed for the next few weeks as we investigate a safety risk involving the Dunk Zone(tm). In the meantime, why not try out NEW Joja Silver? Now with 80% better degreasing capabilities! Every dozen cases bought will net you a voucher for the park once it re-opens!",
	"Spam.SplashParkDesc": "Splash Park Closing Notice",
	
	//ominous mail
	
	"Spam.IsAnyoneHere": "Hello?^^^Is anyone there?^^^Hello?",
	"Spam.IsAnyoneHereDesc": "Hello?",
	
	"Spam.WeKnow": "We know what you did, @.^^^We're waiting.",
	"Spam.WeKnowDesc": "We Know",
	
	"Spam.TrialConcluded": "Your response has been recorded and the trial is now concluded.^Thank you for your response.",
	"Spam.TrialConcludedDesc": "Trial Concluded",
	
	"Spam.GoToBed": "Shouldn't you be asleep already?",
	"Spam.GoToBedDesc": "Why are you awake?",
	
	//config
	
	"config.OminousMail.name": "Allow ominous mail",
	"config.OminousMail.description": "Enables mail with more \"ominous\" tones. They don't have any effect on the game, they're just less silly and more creepy.",
}