{
  //////////////  Lantana 

  "Introduction": "Hello lovely! Welcome to Lantana Lagoon, the most wondrous place of all!!!",
  "Mon": "Hey there!!!!#$e#Yesterday, I saw a Blue-Fringed Warbler, a rare bird to see this far south!$1#$e#Luckily, I got several pictures of her!$1#$e#It reminds me of the time I went down to Dunwell's Valley...#$e#Well, I didn't see any rare birds then, but, there was a large waterfall I jumped over...#$e#Turns out, it's illegal to jump down that waterfall...$2#$e#They said it is because people drown there. But I am literally a mermaid!$1#$e#I happened to be in leg form when I jumped. I was too tired to swap back into leg form, so...#$e#I got to spend the night in jail.$2#$e#The next day, the officers saw me in tail form, slapping my tail on the bars.#$e#It made quite a racket, it annoyed the shell out of everyone!#$e# #$y 'Hey, you ever been to jail, @?_All of the time!!!_My hero!!! Always be you, @!!!_Only once._Hey, don't feel bad, everyone has to start somewhere!_Never. I actually keep the law, unlike some._Well you are boring!#$e#Anyways, they struggled really hard to get me into the squad car, and even harder to get me out.#$e#They wheeled me into court on a wheelbarrow!$1#$e#The judge was annoyed at the ruckous, annoyed that I was in only a bikini top in her court room, and even more annoyed at the guards for hauling in a mermaid for the crime of 'Being in the Water Wrong'.#$e#She dismissed the charges, but told me to not go chasing waterfalls anymore, at least not in her jurisdiction.#$e#Anyways, how did that remind me of that bird?#$e#I don't remember, but I know there was some link somewhere...'",
  "Tue": "Hot peppers are nice.#$e#I prefer eating on land, it's REALLY hard to cook under the sea!#$e#Plus, after some seven hundred years, a girl gets powerful bored of raw fish and seaweed!#$e@#It's super hard to put ketchup on food underwater!#$e#And even harder to get everthing all garlicked up good!#$e#Truth is, I am lying... I have been eating land food for over the past six hundred years.#$e#I ate my first roast pork when I was just 21, hundreds of years before the Ferngill Republic existed!#$e#Well, it tasted ok, but, really, needed red pepper flakes, which just weren't around yet.#$e#Hamburgers are probably the greatest human food invention, the peak of culinary excellence, the summit of all sentient knowledge of suppers!$1@#$e#A lot of us have little grottos accessible only by water, where there are modern kitchen appliences set up to where they can cook and eat, but stay in tail form in the water the entire time!#$e#Me? That's way too much work for me. Although, I do visit my pod sister Magnolia and eat with her sometimes.#$e#It's so fun to feed the little fishies leftover bits and crumbs while I eat!$1#$e#No, I don't eat fish much, I prefer cow, pig, chicken, and... I reckon other farm mammals.#$e#Oh, right, chicken isn't a mammal!#$e#Everything under the sea is just about a fish to y'all, but somehow y'all take exception to birds being classified as a type of mammal!$1#$e#Sorry, It's just funny to me, that's all!$1#$e#Because a shark doesn't even have real bones but people call them fish!$1#$e#But Pig meat is white meat like chickens, but they are still somehow mammals...$2#$e#Anyways...crabs are really fun to watch, but I don't care for eating them#$e#I prefer to eat fake crab meat, which hilariously is fish!$1#$e#Oh, I do like vegetables too, like celery and what-not!#$e#Some mermaids like vegetables a whole lot, but just about all of us are still a little carnivorous.#$e#Being that we are technically, according to your classifications, marine mammals, we eat a lot of meat by nature.#$e#But we do like seaweed a lot more than dolphins do.#$e#Dolphins are hilarious! They tell the most ribald jokes!#$e#Orcas too. I swam with a pod of orcas for a while...#$e#It was fun, but the food sucked.",
  "Thu": "Hey love!!! Nice to see you!#$e#Remember this: citrus cures scurvy!!!#$e#Oh, right, y'all figured that out 300 years ago!#$e#Sorry, I am a most unreliable Public Service Announcer!",
  "Wed": "Hey there lovely!#$e#Today is the holy day of the week for us mermaids!#$e#!#$e#We mermaids have a number of various holy days  and holidays!#$e#We are a little too chaotic to observe things ritually every single time like humans do!#$e#But every new mood, around 3 AM, we have a special gathering, where we worship our Goddesses and celebrate our pod's sisterhood.#$e#My pod means everything to me!#$e#My favorite holiday is Winter Solstice! I eat cookies my Grandma bakes, and all my whole pod gets together for games and food!#$e#It's really special! My mom owns a 50's style Diner, she caters all the food!#$e#I love eating until I am about to burst then running around until I am about to collapse!$1#$e#And some parts of the celebration we don't tell humans about, they are sacred to us.#$e#I do adore turkey with mashed potatoes and cranberry sauce and corn casserole!!!$1#$e#Anyways... Now I am hungry...",
  "Fri": "Hey sweetie!#$e#Sometimes, I like to think about rocks.#$e#I like all sorts of rocks!#$e#But rocks are most fun to play with on the edge of the shore, underwater!#$e#I like to run my hands through the stones, and feel each stone bounce along my hands!#$e#I also like plants a lot!#$e#I like trees the most!!! <3 $1",
  "Sat": "Slimes are the cutest little things! #$e#I also really love lizards, even more than slimes!#$e#They are so cute and they tell the silliest stories!$1#$e#Also, I love dragons!$1#$e#THey are so pretty!!!",
  







}